Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: Length in characters (string) or elements (list).
de: Länge in Zeichen (String) oder Elementen (Liste).
es: Longitud en caracteres (cadena) o elementos (lista).
fr: Longueur en caractères (chaîne) ou éléments (liste).
ja: 文字（文字列）または要素（リスト）単位の長さ。

source: Returns the absolute value of a number.
de: Gibt den absoluten Wert einer Zahl zurück.
es: Devuelve el valor absoluto de un número.
fr: Renvoie la valeur absolue d'un nombre.
ja: 数値の絶対値を返します。

source: Absolute value of `num`.
de: Absolutwert von `num`.
es: Valor absoluto de `num`.
fr: Valeur absolue de `num`.
ja: `num`の絶対値。

source: Converts a number contained in a string to a numeric value.
de: Konvertiert eine in einem String enthaltene Zahl in einen numerischen Wert.
es: Convierte un número contenido en una cadena en un valor numérico.
fr: Convertit un nombre contenu dans une chaîne en valeur numérique.
ja: 文字列に含まれる数値を数値に変換します。

source: a string expression containing the text representation of a number
de: einen Stringausdruck, der die Textdarstellung einer Zahl enthält
es: una expresión de cadena que contiene la representación textual de un número
fr: une expression de chaîne contenant la représentation textuelle d'un nombre
ja: 数値のテキスト表現を含む文字列式

source: Numeric value of `num$`.
de: Zahlenwert von `num$`.
es: Valor numérico de `num$`.
fr: Valeur numérique de `num$`.
ja: `num$`の数値。

source: Get the position of the first occurrence of a string in another string.
de: Ruft die Position des ersten Auftretens einem String in einem anderen String ab.
es: Obtiene la posición de la primera aparición de una cadena en otra cadena.
fr: Obtenez la position de la première occurrence d'une chaîne dans une autre chaîne.
ja: 別の文字列に文字列が最初に発生した位置を取得します。

source: string in which to search
de: String, in dem gesucht werden soll
es: cadena en la que buscar
fr: chaîne dans laquelle rechercher

source: string to search for
de: String, nach dem gesucht werden soll
es: cadena para buscar
fr: chaîne à rechercher
ja: 検索する文字列

source: Position of first occurence of `needle$` (starting with `0`), or `-1` if it could not be found.
de: Position der ersten Erscheinung von `needle$` (ab `0`) oder `-1`, wenn es nicht gefunden werden konnte.
es: Posición de la primera aparición de `needle$` (comenzando con `0`), o`-1` si no se pudo encontrar.
fr: Position de la première occurrence de `needle$` (commençant par `0`), ou `-1` si elle est introuvable.
ja: `needle$`の最初の出現位置（ `0`で始まる）、または見つからなかった場合は`-1`。

source: NOTE: The meaning of the return value differs from other BASIC implementations, in which `0` usually indicates that the string has not been found, and locations found start at `1`.
de: HINWEIS: Die Bedeutung des Rückgabewerts unterscheidet sich von anderen BASIC-Implementierungen, bei denen `0` normalerweise angibt, dass der String nicht gefunden wurde und die gefundenen Positionen bei `1` beginnen.
es: NOTA: El significado del valor de retorno difiere de otras implementaciones BÁSICAS, en las que "0" generalmente indica que la cadena no se ha encontrado, y las ubicaciones encontradas comienzan en "1".
fr: REMARQUE: La signification de la valeur de retour diffère des autres implémentations BASIC, dans lesquelles `0` indique généralement que la chaîne n'a pas été trouvée et que les emplacements trouvés commencent à `1`.
ja: 注：戻り値の意味は、他のBASIC実装とは異なります。通常、`0`は文字列が見つからないことを示し、見つかった場所は`1`から始まります。

source: Value of the `down` direction for input devices.
de: Wert der Richtung `runter` für Eingabegeräte.

source: Call a procedure and get its return value.
de: Ruft eine Prozedur auf und gibt ihren Rückgabewert zurück.
es: Llame a un procedimiento y obtenga su valor de retorno.
fr: Appelez une procédure et obtenez sa valeur de retour.
ja: プロシージャを呼び出して、その戻り値を取得します。

source: Evaluates to the first return value of a procedure.
de: Wertet den ersten Rückgabewert einer Prozedur aus.
es: Evalúa el primer valor de retorno de un procedimiento.
fr: Évalue à la première valeur de retour d'une procédure.
ja: プロシージャの最初の戻り値に評価されます。

source: name of a procedure declared with `PROC`
de: Name einer mit `PROC` deklarierten Prozedur
es: nombre de un procedimiento declarado con `PROC`
fr: nom d'une procédure déclarée avec `PROC`
ja: `PROC`で宣言されたプロシージャの名前

source: a string or numeric expression
de: ein String oder ein numerischer Ausdruck
es: una cadena o expresión numérica
fr: une chaîne ou une expression numérique
ja: 文字列または数値式

source: First return value of called procedure.
de: Erster Rückgabewert der aufgerufenen Prozedur.
es: Primer valor de retorno del procedimiento llamado.
fr: Première valeur de retour de la procédure appelée.
ja: 呼び出されたプロシージャの最初の戻り値。

source: Most implementations of BASIC allow declaration of functions using `DEF FN`, a syntax that is not supported by Engine BASIC. To achieve the same result, you will have to rewrite the function declaration:
de: Die meisten Implementierungen von BASIC ermöglichen die Deklaration von Funktionen mit DEF FN, einer Syntax, die von Engine BASIC nicht unterstützt wird. Um das gleiche Ergebnis zu erzielen, müssen Sie die Funktionsdeklaration neu schreiben:
es: La mayoría de las implementaciones de BASIC permiten la declaración de funciones usando `DEF FN`, una sintaxis que no es compatible con Engine BASIC. Para lograr el mismo resultado, deberá volver a escribir la declaración de la función:
fr: La plupart des implémentations de BASIC permettent la déclaration de fonctions en utilisant `DEF FN`, une syntaxe qui n'est pas prise en charge par Engine BASIC. Pour obtenir le même résultat, vous devrez réécrire la déclaration de fonction:
ja: BASICのほとんどの実装では、EngineBASICでサポートされていない構文である `DEFFN`を使用して関数を宣言できます。同じ結果を得るには、関数宣言を書き直す必要があります。

source: Exponentiation operator.
de: Potenzierungsoperator.
es: Operador de exponenciación.
fr: Opérateur d'exponentiation.
ja: べき乗演算子。

source: `a` raised to the power of `b`.
de: `a` zur Potenz von `b` erhoben.
es: `a` elevado al poder de` b`.
fr: `a` élevé à la puissance de `b`.
ja: `a`は`b`の累乗になります。

source: String equality operator.
de: String-Gleichheitsoperator.
es: Operador de igualdad de cadenas.
fr: Opérateur d'égalité de chaîne.
ja: 文字列等価演算子。

source: `-1` if the value of `a$` is identical to the value of `b$`, `0` otherwise.
de: `-1`, wenn der Wert von `a$` mit dem Wert von `b$` identisch ist, andernfalls `0`.
es: `-1` si el valor de` a$ `es idéntico al valor de `b$ `, `0` en caso contrario.
fr: `-1` si la valeur de` a$ `est identique à la valeur de` b$ `, `0` sinon.
ja: `a$`の値が `b$`の値と同じである場合は `-1`、それ以外の場合は`0`。

source: `-1` if the value of `a$` is different from the value of `b$`, `0` otherwise.
de: `-1`, wenn sich der Wert von `a$` vom Wert von `b$` unterscheidet, andernfalls `0`.
es: `-1` si el valor de` a$ `es diferente del valor de` b$ `, `0` en caso contrario.
fr: `-1` si la valeur de` a$ `est différente de la valeur de` b$ `, `0` sinon.
ja: `a$`の値が `b$`の値と異なる場合は `-1`、それ以外の場合は`0`。

source: `-1` if the value of `a$` precedes the value of `b$` when sorted alphabetically, `0` otherwise.
de: `-1`, wenn der Wert von `a$` vor dem Wert von `b$` steht, wenn er alphabetisch sortiert ist, andernfalls `0`.
es: `-1` si el valor de` a$ `precede al valor de` b$ `cuando se ordena alfabéticamente, `0` en caso contrario.
fr: `-1` si la valeur de` a$ `précède la valeur de` b$ `lorsqu'elle est triée par ordre alphabétique, `0` dans le cas contraire.
ja: アルファベット順にソートしたときに `a$`の値が `b$`の値よりも前にある場合は `-1`、それ以外の場合は`0`。

source: `-1` if the value of `a$` succeeds the value of `b$` when sorted alphabetically, `0` otherwise.
de: `-1`, wenn der Wert von `a$` dem Wert von `b$` folgt, wenn er alphabetisch sortiert ist, andernfalls `0`.
es: `-1` si el valor de` a$ `sucede al valor de` b$ `cuando se ordena alfabéticamente, `0` en caso contrario.
fr: `-1` si la valeur de` a$ `succède à la valeur de` b$ `lorsqu'elle est triée par ordre alphabétique, `0` dans le cas contraire.
ja: アルファベット順にソートしたときに `a$`の値が `b$`の値の後に続く場合は `-1`、それ以外の場合は`0`。

source: a BASIC program line number
de: eine BASIC-Programmzeilennummer
es: un número de línea de programa BÁSICO
fr: un numéro de ligne de programme BASIC
ja: BASICプログラムの行番号

source: a BASIC program label
de: ein BASIC-Programmlabel
es: una etiqueta de programa BÁSICA
fr: une étiquette de programme BASIC
ja: BASICプログラムラベル

source: Try not to use `GOTO` often as it tends to make programs more difficult to understand. If possible, use loop constructs and procedure calls instead.
de: Versuchen Sie, `GOTO` nicht oft zu verwenden, da dies das Verständnis von Programmen erschwert. Verwenden Sie nach Möglichkeit stattdessen Schleifenkonstrukte und Prozeduraufrufe.
es: Trate de no usar `GOTO` a menudo, ya que tiende a hacer que los programas sean más difíciles de entender. Si es posible, utilice construcciones de bucle y llamadas a procedimientos en su lugar.
fr: Essayez de ne pas utiliser `GOTO` souvent car il a tendance à rendre les programmes plus difficiles à comprendre. Si possible, utilisez plutôt des constructions de boucle et des appels de procédure.
ja: プログラムを理解しにくくする傾向があるため、 `GOTO`を頻繁に使用しないようにしてください。可能であれば、代わりにループ構造とプロシージャ呼び出しを使用してください。

source: Calls a subroutine.
de: Ruft eine Unterroutine auf.
es: Llama a una subrutina.
fr: Appelle un sous-programme.
ja: サブルーチンを呼び出します。

source: It may be more convenient to use `PROC` procedures and the `CALL` command instead.
de: Es kann bequemer sein, stattdessen `PROC`-Prozeduren und den `CALL` -Befehl zu verwenden.
es: Puede ser más conveniente utilizar los procedimientos `PROC` y el comando` CALL` en su lugar.
fr: Il peut être plus pratique d'utiliser les procédures `PROC` et la commande` CALL` à la place.
ja: 代わりに、 `PROC`プロシージャと`CALL`コマンドを使用する方が便利な場合があります。

source: Branches to one of several locations, depending on the value of an expression.
de: Verzweigt zu einer von mehreren Positionen, abhängig vom Wert eines Ausdrucks.
es: Se ramifica a una de varias ubicaciones, según el valor de una expresión.
fr: Se branche à l'un des emplacements, en fonction de la valeur d'une expression.
ja: 式の値に応じて、いくつかの場所の1つに分岐します。

source: `ON GOTO` and `ON GOSUB` will branch to the first given line number or label if `expression` is `1`, to the second if `expression` is `2`, and so forth. If `expression` is `0`, it will do nothing, and execution will continue with the next instruction.
de: `ON GOTO` und `ON GOSUB` verzweigen zur ersten angegebenen Zeilennummer oder Bezeichnung, wenn `expression` `1` ist, zur zweiten, wenn `expression` `2` ist, und so weiter. Wenn `expression` `0` ist, wird nichts unternommen und die Ausführung mit der nächsten Anweisung fortgesetzt.
es: `ON GOTO` y `ON GOSUB` se ramificarán al primer número de línea o etiqueta dados si `expression` es `1`, al segundo si `expression` es `2`, y así sucesivamente. Si `expresión` es `0`, no hará nada y la ejecución continuará con la siguiente instrucción.
fr: `ON GOTO` et `ON GOSUB` se branchent sur le premier numéro de ligne ou étiquette donné si `expression` est `1`, sur le second si `expression` est `2`, et ainsi de suite. Si `expression` vaut `0`, cela ne fera rien et l'exécution se poursuivra avec l'instruction suivante.
ja: `ON GOTO` と `ON GOSUB` は、`式` が `1` ならば最初に与えられた行番号またはラベルに、`式` が `2` ならば2番目に、といった具合に分岐します。もし `expression` が `0` ならば、何もせず、次の命令で実行を続けます。

source: `ON GOSUB` calls the given location as a subroutine, while `ON GOTO` simply continues execution there.
de: `ON GOSUB` ruft den angegebenen Ort als Unterprogramm auf, während `ON GOTO` dort einfach die Ausführung fortsetzt.
es: `ON GOSUB` llama a la ubicación dada como una subrutina, mientras que `ON GOTO` simplemente continúa la ejecución allí.
fr: `ON GOSUB` appelle l'emplacement donné comme un sous-programme, tandis que` ON GOTO` continue simplement l'exécution là-bas.
ja: `ON GOSUB`は指定された場所をサブルーチンとして呼び出しますが、`ON GOTO`は単にそこで実行を継続します。

source: Call one of several subroutines, depending on the value of an expression.
de: Ruft je nach Wert eines Ausdrucks eine von mehreren Unterroutinen auf.
es: Llame a una de varias subrutinas, según el valor de una expresión.
fr: Appelez l'un de plusieurs sous-programmes, en fonction de la valeur d'une expression.
ja: 式の値に応じて、いくつかのサブルーチンの1つを呼び出します。

source: Defines an event handler for sprite collisions.
de: Definiert einen Ereignishandler für Sprite-Kollisionen.
es: Define un controlador de eventos para colisiones de sprites.
fr: Définit un gestionnaire d'événements pour les collisions de sprites.
ja: スプライト衝突のイベントハンドラーを定義します。

source: The handler is called once for each collision between two sprites. The handler can be disabled using `ON SPRITE OFF`.
de: Der Handler wird für jede Kollision zwischen zwei Sprites einmal aufgerufen. Der Handler kann mit `ON SPRITE OFF` deaktiviert werden.
es: El controlador se llama una vez por cada colisión entre dos sprites. El controlador puede desactivarse usando "ON SPRITE OFF".
fr: Le gestionnaire est appelé une fois pour chaque collision entre deux sprites. Le gestionnaire peut être désactivé en utilisant `ON SPRITE OFF`.
ja: ハンドラーは、2つのスプライト間の衝突ごとに1回呼び出されます。ハンドラーは、`ON SPRITE OFF`を使用して無効にできます。

source: a procedure defined with `PROC`
de: eine mit `PROC` definierte Prozedur
es: un procedimiento definido con `PROC`
fr: une procédure définie avec `PROC`
ja: `PROC`で定義されたプロシージャ

source: The event handler will be passed three numeric arguments: The sprite IDs of the involved sprites, and the direction of the collision, as would be returned by `SPRCOLL()`.
de: Dem Ereignishandler werden drei numerische Argumente übergeben: Die Sprite-IDs der beteiligten Sprites und die Richtung der Kollision, wie sie von SPRCOLL() zurückgegeben werden.
es: Al controlador de eventos se le pasarán tres argumentos numéricos: Los ID de sprite de los sprites involucrados y la dirección de la colisión, como lo devolvería `SPRCOLL()`.
fr: Le gestionnaire d'événements recevra trois arguments numériques: les ID de sprite des sprites impliqués, et la direction de la collision, comme cela serait retourné par `SPRCOLL()`.
ja: イベントハンドラーには、3つの数値引数が渡されます。関連するスプライトのスプライトIDと、 `SPRCOLL()`によって返される衝突の方向です。

source: The handler will be called once for each sprite collision, but it has to be re-enabled using `ON SPRITE CALL` each time to prevent event storms.
de: Der Handler wird bei jeder Sprite-Kollision einmal aufgerufen, muss jedoch jedes Mal mit `ON SPRITE CALL` wieder aktiviert werden, um Ereignisstürme zu vermeiden.
es: El controlador se llamará una vez por cada colisión de sprites, pero debe volver a habilitarse usando `ON SPRITE CALL` cada vez para evitar tormentas de eventos.
fr: Le gestionnaire sera appelé une fois pour chaque collision de sprite, mais il doit être réactivé en utilisant `ON SPRITE CALL` à chaque fois pour éviter les tempêtes d'événements.
ja: ハンドラーはスプライトの衝突ごとに1回呼び出されますが、イベントストームを防ぐために、毎回`ON SPRITE CALL`を使用してハンドラーを再度有効にする必要があります。

source: WARNING: This command has never been tested.
de: WARNUNG: Dieser Befehl wurde noch nie getestet.
es: ADVERTENCIA: Este comando nunca ha sido probado.
fr: AVERTISSEMENT: cette commande n'a jamais été testée.
ja: 警告：このコマンドはテストされていません。

source: The handler is called when the MML pattern of any sound channel has finished playing. It can be disabled using `ON PLAY ... OFF`.
de: Der Handler wird aufgerufen, wenn das MML-Pattern eines beliebigen Soundkanals beendet ist. Es kann mit `ON PLAY ... OFF` deaktiviert werden.
es: Se llama al controlador cuando el patrón MML de cualquier canal de sonido ha terminado de reproducirse. Puede desactivarse usando `ON PLAY ... OFF`.
fr: Le gestionnaire est appelé lorsque la lecture du motif MML de n'importe quel canal audio est terminée. Il peut être désactivé en utilisant `ON PLAY ... OFF`.
ja: ハンドラーは、サウンドチャネルのMMLパターンの再生が終了したときに呼び出されます。`ON PLAY ... OFF`を使用して無効にすることができます。

source: a sound channel [`0` to `{MML_CHANNELS_m1}`]
de: ein Tonkanal [`0` bis `{MML_CHANNELS_m1} `]
es: un canal de sonido [`0` a `{MML_CHANNELS_m1} `]
fr: un canal sonore [`0` à `{MML_CHANNELS_m1}`]
ja: サウンドチャネル[`0`から`{MML_CHANNELS_m1}`]

source: All end-of-music handlers will be disabled when one of them is called, and they therefore have to be re-enabled using `ON PLAY CALL` if so desired.
de: Alle End-of-Music-Handler werden deaktiviert, wenn einer von ihnen aufgerufen wird, und müssen daher auf Wunsch mit `ON PLAY CALL` wieder aktiviert werden.
es: Todos los controladores de fin de música se desactivarán cuando se llame a uno de ellos y, por lo tanto, deberán volver a activarse mediante "ON PLAY CALL" si así se desea.
fr: Tous les gestionnaires de fin de musique seront désactivés lorsque l'un d'eux est appelé, et ils doivent donc être réactivés en utilisant `ON PLAY CALL` si vous le souhaitez.
ja: すべての音楽終了ハンドラーは、そのうちの1つが呼び出されると無効になるため、必要に応じて`ON PLAY CALL`を使用して再度有効にする必要があります。

source: An event on one channel will disable handling on all channels. That is stupid.
de: Ein Ereignis auf einem Kanal deaktiviert die Behandlung auf allen Kanälen. Das ist dumm
es: Un evento en un canal inhabilitará el manejo en todos los canales. Eso es estupido.
fr: Un événement sur un canal désactivera la gestion sur tous les canaux. C'est stupide.
ja: 1つのチャネルでイベントが発生すると、すべてのチャネルでの処理が無効になります。それは愚かです。

source: Defines a game controller input handler triggered by changes in the state of the buttons of a given controller.
de: Definiert einen Game-Controller-Eingabehandler, der durch Änderungen des Status der Schaltflächen eines bestimmten Controllers ausgelöst wird.
es: Define un controlador de entrada de controlador de juego activado por cambios en el estado de los botones de un controlador determinado.
fr: Définit un gestionnaire d'entrée de contrôleur de jeu déclenché par des changements d'état des boutons d'un contrôleur donné.
ja: 特定のコントローラーのボタンの状態の変化によってトリガーされるゲームコントローラー入力ハンドラーを定義します。

source: Game controller input event handling can be disabled using `ON PAD OFF`.
de: Die Ereignisbehandlung für Gamecontroller-Eingänge kann mit `ON PAD OFF` deaktiviert werden.
es: El manejo de eventos de entrada del controlador de juegos se puede desactivar usando "ON PAD OFF".
fr: La gestion des événements d'entrée du contrôleur de jeu peut être désactivée en utilisant `ON PAD OFF`.
ja: ゲームコントローラの入力イベント処理は、`ON PAD OFF`を使用して無効にできます。

source: number of the game controller [`0` to `{MAX_PADS_m1}`]
de: Nummer des Gamecontrollers [`0` bis `{MAX_PADS_m1} `]
es: número del controlador de juego [`0` a `{MAX_PADS_m1} `]
fr: numéro du contrôleur de jeu [`0` à `{MAX_PADS_m1}`]
ja: ゲームコントローラの番号[`0`から`{MAX_PADS_m1}`]

source: The event handler will receive two numeric arguments: the number of the game controller that has changed state, and a bit pattern indicating which buttons have changed.
de: Der Ereignishandler erhält zwei numerische Argumente: die Nummer des Gamecontrollers, dessen Status geändert wurde, und ein Bitmuster, das angibt, welche Schaltflächen geändert wurden.
es: El controlador de eventos recibirá dos argumentos numéricos: el número del controlador de juego que ha cambiado de estado y un patrón de bits que indica qué botones han cambiado.
fr: Le gestionnaire d'événements recevra deux arguments numériques: le numéro du contrôleur de jeu qui a changé d'état et un modèle de bits indiquant quels boutons ont changé.
ja: イベントハンドラーは、状態が変更されたゲームコントローラーの番号と、変更されたボタンを示すビットパターンの2つの数値引数を受け取ります。

source: Unlike some other event handlers, the game controller handler remains enabled after an event has been processed and does not have to be re-armed.
de: Im Gegensatz zu einigen anderen Ereignishandlern bleibt der Gamecontroller-Handler aktiviert, nachdem ein Ereignis verarbeitet wurde, und muss nicht erneut aktiviert werden.
es: A diferencia de otros controladores de eventos, el controlador de juego sigue habilitado después de que un evento haya sido procesado y no tiene que ser re-armado.
fr: Contrairement à certains autres gestionnaires d'événements, le gestionnaire de contrôleur de jeu reste activé après qu'un événement a été traité et n'a pas besoin d'être réarmé.
ja: 他のいくつかのイベントハンドラーとは異なり、ゲームコントローラーハンドラーは、イベントが処理された後も有効のままであり、再度準備する必要はありません。

source: Enables error handling and, when a run-time error occurs, directs your program to branch to an error-handling routine.
de: Aktiviert die Fehlerbehandlung und weist Ihr Programm bei Auftreten eines Laufzeitfehlers an, zu einer Fehlerbehandlungsroutine zu verzweigen.
es: Habilita el manejo de errores y, cuando ocurre un error en tiempo de ejecución, indica a su programa que se bifurque a una rutina de manejo de errores.
fr: Active la gestion des erreurs et, lorsqu'une erreur d'exécution se produit, dirige votre programme vers une routine de gestion des erreurs.
ja: エラー処理を有効にし、実行時エラーが発生すると、プログラムをエラー処理ルーチンに分岐するように指示します。

source: Error handling can be disabled using `ON ERROR OFF`.
de: Die Fehlerbehandlung kann mit `ON ERROR OFF` deaktiviert werden.
es: El manejo de errores se puede deshabilitar usando "ON ERROR OFF".
fr: La gestion des erreurs peut être désactivée en utilisant `ON ERROR OFF`.
ja: エラー処理は、`ON ERROR OFF`を使用して無効にできます。

source: The error code is passed to the handler in `RET(0)`, and the line number in `RET(1)`.
de: Der Fehlercode wird in `RET(0)` an den Handler und die Zeilennummer in `RET(1)` übergeben.
es: El código de error se pasa al controlador en `RET(0) ', y el número de línea en `RET(1)`.
fr: Le code d'erreur est passé au gestionnaire dans `RET(0)` et le numéro de ligne dans `RET(1)`.
ja: エラーコードは `RET(0)`でハンドラーに渡され、 `RET(1)`で行番号が渡されます。

source: When an error has been forwarded from a sub-program that has been started with `EXEC`, the line number of the sub-program in which the error has been triggered is passed in `RET(2)`.
de: Wenn ein Fehler von einem Unterprogramm weitergeleitet wurde, das mit `EXEC` gestartet wurde, wird die Zeilennummer des Unterprogramms, in dem der Fehler ausgelöst wurde, in `RET(2)` übergeben.
es: Cuando se ha reenviado un error desde un subprograma que se ha iniciado con "EXEC", el número de línea del subprograma en el que se ha disparado el error se pasa en "RET(2)".
fr: Lorsqu'une erreur a été transmise à partir d'un sous-programme qui a été démarré avec `EXEC`, le numéro de ligne du sous-programme dans lequel l'erreur a été déclenchée est passé dans `RET(2)`.
ja: `EXEC`で起動したサブプログラムからエラーが転送された場合、エラーが発生したサブプログラムの行番号が`RET(2)`に渡されます。

source: Unlike other event handlers, `ON ERROR` does not call the error handler as a procedure, and it is not possible to use `RETURN` to resume execution. `RESUME` must be used instead.
de: Im Gegensatz zu anderen Ereignishandlern ruft `ON ERROR` den Fehlerhandler nicht als Prozedur auf, und es ist nicht möglich, `RETURN` zu verwenden, um die Ausführung fortzusetzen. Stattdessen muss `RESUME` verwendet werden.
es: A diferencia de otros controladores de eventos, "ON ERROR" no llama al controlador de errores como un procedimiento y no es posible utilizar "RETURN" para reanudar la ejecución. En su lugar, debe utilizarse "RESUME".
fr: Contrairement aux autres gestionnaires d'événements, `ON ERROR` n'appelle pas le gestionnaire d'erreurs en tant que procédure, et il n'est pas possible d'utiliser` RETURN` pour reprendre l'exécution. `RESUME` doit être utilisé à la place.
ja: 他のイベントハンドラーとは異なり、 `ON ERROR`はエラーハンドラーをプロシージャとして呼び出さないため、`RETURN`を使用して実行を再開することはできません。代わりに `RESUME`を使用する必要があります。
