Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: When a program is executed using `EXEC` and does not define its own error handler, any errors occurring in the child program will be forwarded to the parent program's error handler, if there is one.
de: Wenn ein Programm mit `EXEC` ausgeführt wird und keinen eigenen Fehlerhandler definiert, werden alle im untergeordneten Programm auftretenden Fehler an den Fehlerhandler des übergeordneten Programms weitergeleitet, sofern vorhanden.
es: Cuando un programa se ejecuta usando `EXEC` y no define su propio controlador de errores, cualquier error que ocurra en el programa hijo será reenviado al controlador de errores del programa padre, si lo hay.
fr: Lorsqu'un programme est exécuté en utilisant `EXEC` et ne définit pas son propre gestionnaire d'erreurs, toutes les erreurs survenant dans le programme enfant seront transmises au gestionnaire d'erreurs du programme parent, s'il y en a un.
ja: プログラムが `EXEC`を使用して実行され、独自のエラーハンドラーが定義されていない場合、子プログラムで発生したエラーは、親プログラムのエラーハンドラー（存在する場合）に転送されます。

source: Resume program execution after an error has been handled.
de: Setzt die Programmausführung fort, nachdem ein Fehler behoben wurde.
es: Reanudar la ejecución del programa después de que se haya manejado un error.
fr: Reprenez l'exécution du programme après qu'une erreur a été gérée.
ja: エラーが処理された後、プログラムの実行を再開します。

source: When an error has been caught by a handler set up using `ON ERROR`, it is possible to resume execution after the instruction that caused the error using `RESUME`.
de: Wenn ein Fehler von einem Handler abgefangen wurde, der mit `ON ERROR` eingerichtet wurde, kann die Ausführung nach der Anweisung, die den Fehler verursacht hat, mit `RESUME` fortgesetzt werden.
es: Cuando un controlador configurado con `ON ERROR` detecta un error, es posible reanudar la ejecución después de la instrucción que causó el error con `RESUME`.
fr: Lorsqu'une erreur a été interceptée par un gestionnaire configuré à l'aide de `ON ERROR`, il est possible de reprendre l'exécution après l'instruction qui a causé l'erreur en utilisant` RESUME`.
ja: `ON ERROR`を使用して設定されたハンドラーによってエラーがキャッチされた場合、`RESUME`を使用してエラーの原因となった命令の後に実行を再開することができます。

source: In other BASIC implementations, `RESUME` will retry the instruction that has caused the error, and it is possible to continue after the error using `RESUME NEXT`. In Engine BASIC, `RESUME` will always skip the instruction that generated the error.
de: In anderen BASIC-Implementierungen wiederholt `RESUME` die Anweisung, die den Fehler verursacht hat, und es ist möglich, nach dem Fehler mit `RESUME NEXT` fortzufahren. In Engine BASIC überspringt `RESUME` immer die Anweisung, die den Fehler generiert hat.
es: En otras implementaciones BÁSICAS, `RESUME` reintentará la instrucción que ha causado el error, y es posible continuar después del error usando `RESUME NEXT`. En Engine BASIC, `RESUME` siempre omitirá la instrucción que generó el error.
fr: Dans d'autres implémentations BASIC, `RESUME` réessayera l'instruction qui a causé l'erreur, et il est possible de continuer après l'erreur en utilisant` RESUME NEXT`. Dans Engine BASIC, `RESUME` ignorera toujours l'instruction qui a généré l'erreur.
ja: 他のBASIC実装では、 `RESUME`はエラーの原因となった命令を再試行し、`RESUME NEXT`を使用してエラーの後で続行することができます。Engine BASICでは、 `RESUME`は常にエラーを生成した命令をスキップします。

source: It is not possible to repeat the instruction that has generated the error.
de: Es ist nicht möglich, die Anweisung zu wiederholen, die den Fehler generiert hat.
es: No es posible repetir la instrucción que ha generado el error.
fr: Il n'est pas possible de répéter l'instruction qui a généré l'erreur.
ja: エラーが発生した命令を繰り返すことはできません。

source: Triggers an error.
de: Löst einen Fehler aus.
es: Activa un error.
fr: Déclenche une erreur.
ja: エラーをトリガーします。

source: error code
de: Fehlercode
es: código de error
fr: code d'erreur
ja: エラーコード

source: Calls a procedure.
de: Ruft eine Prozedur auf.
es: Llama un procedimiento.
fr: Appelle une procédure.
ja: プロシージャを呼び出します。

source: At least as many arguments must be given as defined in the procedure declaration. Additional arguments can be accessed using `ARG()` and `ARG$()`.
de: Es müssen mindestens so viele Argumente angegeben werden, wie in der Prozedurdeklaration definiert. Auf zusätzliche Argumente kann mit `ARG()` und `ARG$()` zugegriffen werden.
es: Se deben proporcionar al menos tantos argumentos como se define en la declaración del procedimiento. Se puede acceder a argumentos adicionales usando `ARG()` y `ARG$()`.
fr: Au moins autant d'arguments doivent être donnés comme défini dans la déclaration de procédure. Des arguments supplémentaires sont accessibles en utilisant `ARG()` et `ARG$()`.
ja: 少なくとも、プロシージャ宣言で定義されている数の引数を指定する必要があります。追加の引数には、 `ARG()`および `ARG $()`を使用してアクセスできます。

source: Return from a subroutine or procedure.
de: Rückkehr von einem Unterprogramm oder einer Prozedur.
es: Regreso de una subrutina o procedimiento.
fr: Retour d'un sous-programme ou d'une procédure.
ja: サブルーチンまたは手順から戻ります。

source: If specified, up to {MAX_RETVALS} return values of each type (numeric or string) can be returned to the caller.
de: Wenn angegeben, können bis zu {MAX_RETVALS} Rückgabewerte jedes Typs (numerisch oder String) an den Aufrufer zurückgegeben werden.
es: Si se especifica, se pueden devolver al llamante hasta {MAX_RETVALS} valores de retorno de cada tipo (numérico o de cadena).
fr: Si spécifié, jusqu'à {MAX_RETVALS} valeurs de retour de chaque type (numérique ou chaîne) peuvent être renvoyées à l'appelant.
ja: 指定された場合、各タイプ（数値または文字列）の戻り値を最大 {MAX_RETVALS} 個まで呼び出し元に返すことができる。

source: Repeats a block of instructions while a condition is true or until a condition becomes true.
de: Wiederholt einen Anweisungsblock, während eine Bedingung erfüllt ist oder bis eine Bedingung erfüllt ist.
es: Repite un bloque de instrucciones mientras una condición es verdadera o hasta que una condición se convierte en verdadera.
fr: Répète un bloc d'instructions pendant qu'une condition est vraie ou jusqu'à ce qu'une condition devienne vraie.
ja: 条件が真である間、または条件が真になるまで、命令のブロックを繰り返します。

source: If no condition is specified, the loop will repeat forever.
de: Wenn keine Bedingung angegeben ist, wird die Schleife für immer wiederholt.
es: Si no se especifica ninguna condición, el ciclo se repetirá para siempre.
fr: Si aucune condition n'est spécifiée, la boucle se répétera indéfiniment.
ja: 条件が指定されていない場合、ループは永久に繰り返されます。

source: Executes a series of instructions as long as a specified condition is "true".
de: Führt eine Reihe von Anweisungen aus, solange eine angegebene Bedingung "wahr" ist.
es: Ejecuta una serie de instrucciones siempre que una condición especificada sea "verdadera".
fr: Exécute une série d'instructions tant qu'une condition spécifiée est "vraie".
ja: 指定された条件が「真」である限り、一連の命令を実行します。

source: `condition` is evaluated at the start of the loop. If it is "false", execution continues after the corresponding `WEND` instruction. (Note that all kinds of loops can be nested, so this may not be the nearest `WEND` instruction.)
de: `Bedingung` wird zu Beginn der Schleife ausgewertet. Wenn es "false" ist, wird die Ausführung nach der entsprechenden `WEND`-Anweisung fortgesetzt. (Beachten Sie, dass alle Arten von Schleifen verschachtelt werden können, sodass dies möglicherweise nicht die nächste WEND-Anweisung ist.)
es: La `condición` se evalúa al comienzo del ciclo. Si es "falso", la ejecución continúa después de la instrucción `WEND` correspondiente. (Tenga en cuenta que se pueden anidar todo tipo de bucles, por lo que puede que esta no sea la instrucción `WEND` más cercana).
fr: `condition` est évaluée au début de la boucle. S'il est "faux", l'exécution se poursuit après l'instruction "WEND" correspondante. (Notez que toutes sortes de boucles peuvent être imbriquées, donc ce n'est peut-être pas l'instruction `WEND` la plus proche.)
ja: `condition`はループの開始時に評価されます。「false」の場合、対応する `WEND`命令の後に実行が続行されます。（すべての種類のループをネストできるため、これが最も近い `WEND`命令ではない可能性があることに注意してください。）

source: If `condition` is "true", the instructions following the `WHILE` instruction will be executed, until the corresponding `WEND` instruction is reached, at which point `condition` will be evaluated again to determine whether to continue the loop.
de: Wenn `Bedingung` "wahr" ist, werden die Anweisungen, die auf die Anweisung `WHILE` folgen, ausgeführt, bis die entsprechende Anweisung `WEND` erreicht ist. An diesem Punkt wird `condition` erneut ausgewertet, um zu bestimmen, ob die Schleife fortgesetzt werden soll.
es: Si la `condición` es" verdadera ", las instrucciones que siguen a la instrucción `WHILE` se ejecutarán, hasta que se alcance la instrucción `WEND` correspondiente, en cuyo punto la` condición` se evaluará nuevamente para determinar si continuar el ciclo.
fr: Si `condition` est `vraie`, les instructions qui suivent l'instruction `WHILE` seront exécutées, jusqu'à ce que l'instruction `WEND` correspondante soit atteinte, à quel point `condition` sera à nouveau évaluée pour déterminer s'il faut continuer la boucle.
ja: `condition`が" true "の場合、対応する`WEND`命令に到達するまで、 `WHILE`命令に続く命令が実行されます。到達した時点で、`condition`が再度評価され、ループを続行するかどうかが決定されます。

source: The `WHILE` keyword can also form part of a `LOOP` command.
de: Das `WHILE` Keyword kann auch Teil eines `LOOP`-Befehls sein.
es: La palabra clave `WHILE` también puede formar parte de un comando `LOOP`.
fr: Le mot clé `WHILE` peut également faire partie d'une commande` LOOP`.
ja: `WHILE`キーワードは、`LOOP`コマンドの一部を形成することもできます。

source: Iterates a `WHILE` loop.
de: Iteriert eine WHILE-Schleife.
es: Itera un bucle `WHILE`.
fr: Itère une boucle `WHILE`.
ja: `WHILE`ループを繰り返します。

source: Starts a loop repeating a block of instructions a specified number of times.
de: Startet eine Schleife, in der ein Anweisungsblock eine bestimmte Anzahl von Malen wiederholt wird.
es: Inicia un ciclo que repite un bloque de instrucciones un número específico de veces.
fr: Démarre une boucle répétant un bloc d'instructions un nombre spécifié de fois.
ja: 指定された回数だけ命令のブロックを繰り返すループを開始します。

source: a numeric variable used as the loop counter
de: Eine numerische Variable, die als Schleifenzähler verwendet wird
es: una variable numérica utilizada como contador de bucle
fr: une variable numérique utilisée comme compteur de boucle
ja: ループカウンターとして使用される数値変数

source: initial value of the loop counter
de: Anfangswert des Schleifenzählers
es: valor inicial del contador de bucle
fr: valeur initiale du compteur de boucle
ja: ループカウンタの初期値

source: If no loop variable is specified in the `NEXT` command, the top-most `FOR` loop on the loop stack (that is, the one started last) will be iterated. If it is specified, the `FOR` loop associated with the given variable will be iterated, and any nested loops below it will be discarded.
de: Wenn im Befehl `NEXT` keine Schleifenvariable angegeben ist, wird die oberste `FOR`-Schleife auf dem Schleifenstapel (dh die zuletzt gestartete) iteriert. Wenn dies angegeben ist, wird die der angegebenen Variablen zugeordnete FOR-Schleife iteriert und alle darunter liegenden verschachtelten Schleifen werden verworfen.
es: Si no se especifica ninguna variable de bucle en el comando `NEXT`, se iterará el bucle `FOR` superior en la pila de bucles (es decir, el que se inició en último lugar). Si se especifica, el bucle "FOR" asociado con la variable dada será iterado y cualquier bucle anidado debajo de él será descartado.
fr: Si aucune variable de boucle n'est spécifiée dans la commande `NEXT`, la boucle` FOR` la plus haute de la pile de boucles (c'est-à-dire celle commencée en dernier) sera itérée. S'il est spécifié, la boucle `FOR` associée à la variable donnée sera itérée, et toutes les boucles imbriquées en dessous seront supprimées.
ja: `NEXT`コマンドでループ変数が指定されていない場合、ループスタックの最上位の`FOR`ループ（つまり、最後に開始されたループ）が繰り返されます。指定した場合、指定された変数に関連付けられた `FOR`ループが繰り返され、その下にネストされたループはすべて破棄されます。

source: Iterates a `DO` loop.
de: Iteriert eine DO-Schleife.
es: Itera un bucle "DO".
fr: Itère une boucle `DO`.
ja: `DO`ループを繰り返します。

source: Increments and tests the counter in a `FOR` loop.
de: Inkrementiert und testet den Zähler in einer FOR-Schleife.
es: Incrementa y prueba el contador en un bucle "FOR".
fr: Incrémente et teste le compteur dans une boucle `FOR`.
ja: FOR` ループの中でカウンターを増やし、テストします。

source: Executes a instruction or instruction block depending on specified conditions.
de: Führt abhängig von den angegebenen Bedingungen einen Befehl oder einen Befehlsblock aus.
es: Ejecuta una instrucción o un bloque de instrucciones según las condiciones especificadas.
fr: Exécute une instruction ou un bloc d'instructions en fonction des conditions spécifiées.
ja: 指定された条件に応じて、命令または命令ブロックを実行します。

source: one or more instructions on one or more lines
de: eine oder mehrere Anweisungen in einer oder mehreren Zeilen
es: una o más instrucciones en una o más líneas
fr: une ou plusieurs instructions sur une ou plusieurs lignes
ja: 1行以上の1つ以上の指示

source: one or more instructions, separated by colons
de: eine oder mehrere Anweisungen, durch Doppelpunkte getrennt
es: una o más instrucciones, separadas por dos puntos
fr: une ou plusieurs instructions, séparées par des deux-points
ja: コロンで区切られた1つ以上の指示

source: A `condition` is considered "false" if it is zero, and "true" in any other case.
de: Eine `condition` wird als "falsch" betrachtet, wenn sie Null ist, und in jedem anderen Fall als "wahr".
es: Una "condición" se considera "falsa" si es cero y "verdadera" en cualquier otro caso.
fr: Une `condition` est considérée comme" fausse "si elle est nulle, et" vraie "dans tous les autres cas.
ja: `condition`は、ゼロの場合は「false」と見なされ、それ以外の場合は「true」と見なされます。

source: IMPORTANT: In many BASIC implementations, `ENDIF` is spelled `END IF` (that is, as two commands). If the sequence `END IF` is entered or loaded in a program, Engine BASIC will convert it to `ENDIF`.
de: WICHTIG: In vielen BASIC-Implementierungen wird `ENDIF` als `END IF` geschrieben (dh als zwei Befehle). Wenn die Sequenz `END IF` in ein Programm eingegeben oder geladen wird, konvertiert Engine BASIC sie in `ENDIF`.
es: IMPORTANTE: En muchas implementaciones BASIC, `ENDIF` se escribe `END IF` (es decir, como dos comandos). Si se ingresa o carga la secuencia "END IF" en un programa, Engine BASIC la convertirá a "ENDIF".
fr: IMPORTANT: dans de nombreuses implémentations BASIC, `ENDIF` est orthographié` END IF` (c'est-à-dire sous forme de deux commandes). Si la séquence `END IF` est entrée ou chargée dans un programme, Engine BASIC la convertira en `ENDIF`.
ja: 重要：多くのBASIC実装では、 `ENDIF`は`END IF`と綴られます（つまり、2つのコマンドとして）。シーケンス `END IF`がプログラムに入力またはロードされると、EngineBASICはそれを`ENDIF`に変換します。

source: Ends a muli-line `IF` instruction.
de: Beendet eine mehrzeilige IF-Anweisung.
es: Finaliza una instrucción `IF` de varias líneas.
fr: Termine une instruction `IF` sur plusieurs lignes.
ja: マルチラインの `IF`命令を終了します。

source: Introduces the `ELSE` branch of an `IF` instruction.
de: Führt den ELSE-Zweig eines IF-Befehls ein.
es: Introduce la rama `ELSE` de una instrucción `IF`.
fr: Introduit la branche `ELSE` d'une instruction` IF`.
ja: `IF`命令の`ELSE`ブランチを導入します。

source: Ends the program.
de: Beendet das Programm.
es: Termina el programa.
fr: Termine le programme.
ja: プログラムを終了します。

source: Redraw the text screen.
de: Zeichnt den Textbildschirm neu.
es: Vuelva a dibujar la pantalla de texto.
fr: Redessiner l'écran de texte.
ja: テキスト画面を再描画します。

source: Overwrites anything displayed on-screen with the characters stored in the text buffer.
de: Überschreibt alles, was auf dem Bildschirm angezeigt wird, mit den im Textpuffer gespeicherten Zeichen.
es: Sobrescribe todo lo que se muestra en pantalla con los caracteres almacenados en el búfer de texto.
fr: Remplace tout ce qui est affiché à l'écran par les caractères stockés dans la mémoire tampon de texte.
ja: 画面に表示されているものを、テキストバッファに保存されている文字で上書きします。

source: Deletes the program in memory as well as all variables.
de: Löscht das Programm im Speicher sowie alle Variablen.
es: Elimina el programa de la memoria, así como todas las variables.
fr: Supprime le programme en mémoire ainsi que toutes les variables.
ja: メモリ内のプログラムとすべての変数を削除します。

source: Deletes all variables.
de: Löscht alle Variablen.
es: Elimina todas las variables.
fr: Supprime toutes les variables.
ja: すべての変数を削除します。

source: Halts the program.
de: Hält das Programm an.
es: Detiene el programa.
fr: Arrête le programme.
ja: プログラムを停止します。

source: A program stopped by a `STOP` command can be resumed using `CONT`.
de: Ein Programm, das durch einen STOP-Befehl gestoppt wurde, kann mit CONT fortgesetzt werden.
es: Un programa detenido por un comando `STOP` puede reanudarse usando `CONT`.
fr: Un programme arrêté par une commande `STOP` peut être repris en utilisant `CONT`.
ja: `STOP`コマンドで停止したプログラムは、`CONT`を使用して再開できます。

source: Enables or disables the system and procedure profiler.
de: Aktiviert oder deaktiviert den System- und Prozedurprofiler.
es: Habilita o deshabilita el generador de perfiles de sistema y procedimiento.
fr: Active ou désactive le profileur de système et de procédure.
ja: システムおよびプロシージャプロファイラを有効または無効にします。

source: The system profiler shows a bar in the border of the screen indicating how much CPU time is spent on the various tasks of the grahpics and sound subsystems. It helps in determining the cause of system overloads that lead to graphics and/or sound glitches.
de: Der Systemprofiler zeigt am Rand des Bildschirms einen Balken an, der angibt, wie viel CPU-Zeit für die verschiedenen Aufgaben der Grafik- und Sound-Subsysteme aufgewendet wird. Es hilft bei der Ermittlung der Ursache von Systemüberlastungen, die zu Grafik- und / oder Tonstörungen führen.
es: El generador de perfiles del sistema muestra una barra en el borde de la pantalla que indica cuánto tiempo de CPU se dedica a las diversas tareas de los subsistemas gráficos y de sonido. Ayuda a determinar la causa de las sobrecargas del sistema que provocan fallas en los gráficos y / o el sonido.
fr: Le profileur système affiche une barre dans le bord de l'écran indiquant le temps processeur consacré aux différentes tâches des sous-systèmes graphiques et sonores. Il aide à déterminer la cause des surcharges du système qui entraînent des problèmes graphiques et / ou sonores.
ja: システムプロファイラーは、画面の境界にバーを表示し、グラフィックスおよびサウンドサブシステムのさまざまなタスクに費やされたCPU時間を示します。グラフィックやサウンドの不具合につながるシステムの過負荷の原因を特定するのに役立ちます。

source: `PROFILE ON` enables the profiler, `PROFILE OFF` disables it.
de: `PROFILE ON` aktiviert den Profiler, `PROFILE OFF` deaktiviert ihn.
es: `PROFILE ON` habilita el generador de perfiles, `PROFILE OFF` lo deshabilita.
fr: `PROFILE ON` active le profileur,` PROFILE OFF` le désactive.
ja: `PROFILE ON`はプロファイラーを有効にし、`PROFILE OFF`はプロファイラーを無効にします。

source: `PROFILE ON` also enables the procedure profiler that helps determine the number of CPU cycles used in each BASIC procedure. After the program has been run, the results can be viewed using `PROFILE LIST`.
de: `PROFILE ON` aktiviert auch den Prozedurprofiler, mit dessen Hilfe die Anzahl der in jeder BASIC-Prozedur verwendeten CPU-Zyklen bestimmt werden kann. Nachdem das Programm ausgeführt wurde, können die Ergebnisse mit `PROFILE LIST` angezeigt werden.
es: `PROFILE ON` también habilita el perfilador de procedimientos que ayuda a determinar el número de ciclos de CPU usados ​​en cada procedimiento BASIC. Una vez que se ha ejecutado el programa, los resultados se pueden ver usando "PROFILE LIST".
fr: `PROFILE ON` active également le profileur de procédure qui aide à déterminer le nombre de cycles CPU utilisés dans chaque procédure BASIC. Une fois le programme exécuté, les résultats peuvent être visualisés à l'aide de la `LISTE DE PROFILS`.
ja: `PROFILE ON`は、各BASICプロシージャで使用されるCPUサイクル数を決定するのに役立つプロシージャプロファイラも有効にします。プログラムの実行後、 `PROFILELIST`を使用して結果を表示できます。

source: It is not possible to switch the system and procedure profiling on and off independently.
de: Es ist nicht möglich, die System- und Prozedurprofilerstellung unabhängig voneinander ein- und auszuschalten.
es: No es posible activar y desactivar la creación de perfiles del sistema y del procedimiento de forma independiente.
fr: Il n'est pas possible d'activer et de désactiver le profilage du système et des procédures indépendamment.
ja: システムと手順のプロファイリングのオンとオフを個別に切り替えることはできません。

source: Executes a BASIC program as a child process.
de: Führt ein BASIC-Programm als untergeordneten Prozess aus.
es: Ejecuta un programa BASIC como un proceso hijo.
fr: Exécute un programme BASIC en tant que processus enfant.
ja: 子プロセスとしてBASICプログラムを実行します。

source: name of the BASIC program file to be executed
de: Name der auszuführenden BASIC-Programmdatei
es: nombre del archivo de programa BASIC que se ejecutará
fr: nom du fichier programme BASIC à exécuter
ja: 実行するBASICプログラムファイルの名前

source: A program run via `EXEC` runs in its own program and variable space, and nothing it does affects the calling program or its variables, with the exception of the following:
de: Ein Programm, das über EXEC ausgeführt wird, wird in einem eigenen Programm und Variablenbereich ausgeführt, und nichts, was es tut, wirkt sich auf das aufrufende Programm oder seine Variablen aus, mit Ausnahme der folgenden:
es: Un programa que se ejecuta a través de `EXEC` se ejecuta en su propio programa y espacio de variables, y nada de lo que hace afecta al programa que lo llama ni a sus variables, con la excepción de lo siguiente:
fr: Un programme exécuté via `EXEC` s'exécute dans son propre programme et espace variable, et rien de ce qu'il fait n'affecte le programme appelant ou ses variables, à l'exception de ce qui suit:
ja: `EXEC`を介して実行されるプログラムは、独自のプログラムと変数スペースで実行され、次の場合を除いて、呼び出し元のプログラムまたはその変数に影響を与えることはありません。

source: * *Open files* are shared between the parent and child program. Any changes will be visible to both programs.
de: * * Geöffnete Dateien * werden zwischen dem übergeordneten und dem untergeordneten Programm gemeinsam genutzt. Alle Änderungen sind für beide Programme sichtbar.
es: * * Los archivos abiertos * se comparten entre el programa principal y el secundario. Cualquier cambio será visible para ambos programas.
fr: * * Les fichiers ouverts * sont partagés entre le programme parent et le programme enfant. Toutes les modifications seront visibles pour les deux programmes.
ja: **開いているファイル*は親プログラムと子プログラムの間で共有されます。変更は両方のプログラムに表示されます。

source: * *Error handlers* set in the parent program will be triggered by errors in the child program, unless they are handled by the child.
de: * * Fehlerbehandlungsroutinen *, die im übergeordneten Programm festgelegt wurden, werden durch Fehler im untergeordneten Programm ausgelöst, sofern sie nicht vom untergeordneten Programm behandelt werden.
es: * * Los controladores de errores * establecidos en el programa padre se activarán por errores en el programa hijo, a menos que sean manejados por el hijo.
fr: * * Les gestionnaires d'erreurs * définis dans le programme parent seront déclenchés par des erreurs dans le programme enfant, à moins qu'ils ne soient gérés par l'enfant.
ja: *親プログラムに設定された*エラーハンドラー*は、子プログラムで処理されない限り、子プログラムのエラーによってトリガーされます。

source: There is no generalized way to share data between parent and child program.
de: Es gibt keine allgemeine Möglichkeit, Daten zwischen übergeordneten und untergeordneten Programmen auszutauschen.
es: No existe una forma generalizada de compartir datos entre el programa principal y el secundario.
fr: Il n'y a pas de moyen généralisé de partager des données entre les programmes parents et enfants.
ja: 親プログラムと子プログラム間でデータを共有する一般化された方法はありません。

source: Continues an interrupted program.
de: Setzt ein unterbrochenes Programm fort.
es: Continúa un programa interrumpido.
fr: Continue un programme interrompu.
ja: 中断されたプログラムを続行します。
