Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: * Unlike with other BASIC implementations, `start` is zero-based, i.e. the first byte is 0, not 1.
de: * Im Gegensatz zu anderen BASIC-Implementierungen ist `start` nullbasiert, dh das erste Byte ist 0, nicht 1.
es: * A diferencia de otras implementaciones BASIC, `start` es basado en cero, es decir, el primer byte es 0, no 1.
fr: * Contrairement aux autres implémentations BASIC, `start` est basé sur zéro, c'est-à-dire que le premier octet est 0, pas 1.
ja: *他のBASIC実装とは異なり、 `start`はゼロベースです。つまり、最初のバイトは1ではなく0です。

source: Returns a string containing the UTF-8 encoding of the specified Unicode codepoint.
de: Gibt eine Zeichenfolge zurück, die die UTF-8-Codierung des angegebenen Unicode-Codepoints enthält.
es: Devuelve una cadena que contiene la codificación UTF-8 del punto de código Unicode especificado.
fr: Renvoie une chaîne contenant l'encodage UTF-8 du point de code Unicode spécifié.
ja: 指定されたUnicodeコードポイントのUTF-8エンコーディングを含む文字列を返します。

source: * To construct string from a byte value without UTF-8 encoding, use the `a$ = [byte]` syntax.
de: * Um einen String aus einem Byte-Wert ohne UTF-8-Codierung zu erstellen, verwenden Sie die Syntax `a$ = [byte]`.
es: * Para construir una cadena de un valor de byte sin la codificación UTF-8, use la sintaxis `a$ = [byte]`.
fr: * Pour construire une chaîne à partir d'une valeur d'octet sans encodage UTF-8, utilisez la syntaxe `a$ = [byte]`.
ja: * UTF-8エンコーディングを使用せずにバイト値から文字列を作成するには、 `a$= [byte]`構文を使用します。

source: Converts string to all-lowercase letters.
de: Wandelt String in Kleinbuchstaben um.
es: Convierte la cadena de caracteres en letras minúsculas.
fr: Convertit la chaîne en lettres minuscules.

source: string to convert
de: zu konvertierende Zeichenfolge
es: cadena para convertir
fr: chaîne à convertir
ja: 変換する文字列

source: Value of `s$` with all letters replaced with their lowercase equivalents.
de: Wert von `s$`, wobei alle Buchstaben durch ihre Kleinbuchstaben ersetzt werden.
es: Valor de `s$` con todas las letras sustituidas por sus equivalentes de minúscula.
fr: Valeur de `s$` avec toutes les lettres remplacées par leurs équivalents en minuscules.
ja: `s$`の値。すべての文字が、同等の小文字に置き換えられています。

source: Converts string to all-uppercase letters.
de: Wandelt String in Großbuchstaben um.
es: Convierte la cadena a las letras mayúsculas.
fr: Convertit la chaîne en lettres majuscules.
ja: 文字列をすべて大文字に変換します。

source: Value of `s$` with all letters replaced with their uppercase equivalents.
de: Wert von `s$`, wobei alle Buchstaben durch ihre Großbuchstaben ersetzt wurden.
es: Valor de `s$` con todas las letras sustituidas por sus equivalentes de mayúscula.
fr: Valeur de `s$` avec toutes les lettres remplacées par leurs équivalents en majuscules.
ja: `s$`の値。すべての文字が、同等の大文字に置き換えられています。

source: Returns the value of an environment variable.
de: Gibt den Wert einer Umgebungsvariablen zurück.
es: Devuelve el valor de una variable de entorno.
fr: Renvoie la valeur d'une variable d'environnement.
ja: 環境変数の値を返します。

source: name of environment variable
de: Name der Umgebungsvariablen
es: nombre de la variable de entorno
fr: nom de la variable d'environnement
ja: 環境変数の名前

source: Value of the specified environment variable.
de: Wert der angegebenen Umgebungsvariablen.
es: Valor de la variable de entorno especificada.
fr: Valeur de la variable d'environnement spécifiée.
ja: 指定された環境変数の値。

source: data to be written
de: zu schreibende Daten
es: datos por escrito
fr: données à écrire
ja: 書き込むデータ

source: * When writing a string that is to be used by a C function you have to make sure to add a `0`-byte at the end, e.g. `"text" + CHR$(0)`.
de: * Beim Schreiben eines Strings, der von einer C-Funktion verwendet werden soll, muss am Ende ein `0`-Byte hinzugefügt werden, zB `"text" + CHR$(0)`.
es: * Al escribir una cadena que va a ser utilizada por una función C tienes que asegurarte de añadir un `0`-byte al final, por ejemplo `"text" + CHR$(0)`.
fr: * Lors de l'écriture d'une chaîne qui doit être utilisée par une fonction C, vous devez vous assurer d'ajouter un `0`-octet à la fin, par exemple `"texte" + CHR$(0)`.
ja: * C関数で使用される文字列を作成する場合は、末尾に必ず`0`バイトを追加する必要があります（例：`"text" + CHR$(0)`）。

source: The alternative syntax `FREE()` is supported for backwards compatibility with earlier versions of Engine BASIC.
de: Die alternative Syntax `FREE()` wird aus Gründen der Abwärtskompatibilität mit früheren Versionen von Engine BASIC unterstützt.
es: La sintaxis alternativa `FREE()` es compatible con versiones anteriores del Engine BASIC.
fr: La syntaxe alternative `FREE()` est prise en charge pour une compatibilité descendante avec les versions antérieures de Engine BASIC.
ja: 以前のバージョンのEngineBASICとの下位互換性のために、代替構文`FREE()`がサポートされています。

source: Reads a byte string of data from an address in memory.
de: Lies einen Byte-String von Daten aus einer Adresse im Speicher.
es: Lee una cadena de datos byte de una dirección en memoria.
fr: Lit une chaîne d'octets de données à partir d'une adresse en mémoire.
ja: メモリ内のアドレスからデータのバイト文字列を読み取ります。

source: number of bytes to read, or 0
de: Anzahl der zu lesenden Bytes oder 0
es: número de bytes a leer, o 0
fr: nombre d'octets à lire, ou 0
ja: 読み取るバイト数、または0

source: Byte string containing `length` bytes of data starting at `addr`.
de: Byte-String, der `length` Datenbytes enthält, beginnend bei `addr`.
es: Cadena de byte que contiene `length` bytes de datos que comienzan en `addr`.
fr: Chaîne d'octets contenant `length` octets de données commençant à `addr`.
ja: `addr` から始まる `length` バイトのデータを含むバイト列。

source: * Memory at `addr` must allow byte-wise access.
de: * Der Speicher bei `addr` muss byteweisen Zugriff erlauben.
es: * La memoria en `addr` debe permitir el acceso directo.
fr: * La mémoire à `addr` doit permettre un accès par octet.
ja: * `addr`のメモリは、バイト単位のアクセスを許可する必要があります。

source: * When `length` is `0`, data is read until a `0`-byte is encountered. Use this to read C-style strings.
de: * Wenn `length` `0` ist, werden Daten gelesen, bis ein `0`-Byte gefunden wird. Verwenden Sie dies, um Zeichenfolgen im C-Stil zu lesen.
es: * Cuando `length` es `0`, los datos se leen hasta que se encuentre un byte `0`. Use esto para leer cadenas de estilo C.
fr: * Lorsque `length` est `0`, les données sont lues jusqu'à ce qu'un `0`-byte soit rencontré. Utilisez-le pour lire des chaînes de style C.
ja: * `length`が`0`の場合、データは`0`バイトに遭遇するまで読み取られます。これを使用して、Cスタイルの文字列を読み取ります。

source: Reboots the system.
de: Startet das System neu.
es: Reinicia el sistema.
fr: Redémarre le système.
ja: システムを再起動します。

source: Only implemented on the H3 platform.
de: Nur auf der H3-Plattform implementiert.
es: Sólo se implementó en la plataforma H3.
fr: Uniquement implémenté sur la plate-forme H3.
ja: H3プラットフォームにのみ実装されています。

source: Sets the CPU clock frequency.
de: Legt die CPU-Taktfrequenz fest.
es: Establece la frecuencia del reloj CPU.
fr: Définit la fréquence d'horloge du processeur.
ja: CPUクロック周波数を設定します。

source: CPU speed in percent of maximum.
de: CPU-Geschwindigkeit in Prozent des Maximums.
es: Velocidad de la CPU en porcentaje del máximo.
fr: Vitesse du processeur en pourcentage du maximum.
ja: CPU 速度（最大値に対する割合）。

source: * Only implemented on the H3 platform.
de: * Nur auf der H3-Plattform implementiert.
es: * Solo implementado en la plataforma H3.
fr: * Uniquement implémenté sur la plate-forme H3.
ja: * H3プラットフォームにのみ実装されています。

source: * Will not generate an error on platforms that do not support it.
de: * Erzeugt keinen Fehler auf Plattformen, die es nicht unterstützen.
es: * No generará un error en las plataformas que no lo admiten.
fr: * Ne générera pas d'erreur sur les plateformes qui ne le prennent pas en charge.
ja: *それをサポートしていないプラットフォームでエラーを生成しません。

source: * When `speed` is `-1` the CPU speed will be reset to the power-on default.
de: * Wenn `speed` `-1` ist, wird die CPU-Geschwindigkeit auf die Einschaltvorgabe zurückgesetzt.
es: * Cuando `speed` es `-1`, la velocidad de la CPU se restablecerá al valor predeterminado de encendido.
fr: * Lorsque `speed` est `-1` La vitesse de la CPU sera réinitialisée à la valeur par défaut.
ja: * CPU 速度は、`speed` が `-1` の場合、パワーオン時のデフォルトにリセットされます。

source: Installs a packaged module to the system module directory.
de: Installiert ein verpacktes Modul im Systemmodulverzeichnis.
es: Instala un módulo empaquetado al directorio del módulo del sistema.
fr: Installe un module empaqueté dans le répertoire du module système.
ja: パッケージ化されたモジュールをシステムモジュールディレクトリにインストールします。

source: name of a packaged module file
de: Name einer gepackten Moduldatei
es: nombre de un archivo de módulo empaquetado
fr: nom d'un fichier de module empaqueté
ja: パッケージ化されたモジュールファイルの名前

source: Loads a module from the system module directory.
de: Lädt ein Modul aus dem Systemmodulverzeichnis.
es: Carga un módulo del directorio del módulo del sistema.
fr: Charge un module à partir du répertoire des modules système.
ja: システムモジュールディレクトリからモジュールをロードします。

source: name of an installed module
de: Name eines installierten Moduls
es: nombre de un módulo instalado
fr: nom d'un module installé
ja: インストールされているモジュールの名前

source: Shows the names of all modules currently loaded.
de: Zeigt die Namen aller aktuell geladenen Module an.
es: Muestra los nombres de todos los módulos actualmente cargados.
fr: Affiche les noms de tous les modules actuellement chargés.
ja: 現在ロードされているすべてのモジュールの名前を表示します。

source: Ensures that a given module is loaded.
de: Stellt sicher, dass ein bestimmtes Modul geladen wird.
es: Asegura que se cargue un módulo dado.
fr: Assure qu'un module donné est chargé.
ja: 指定されたモジュールがロードされていることを確認します。

source: module name
de: Modulname
es: nombre del módulo
fr: nom du module
ja: モジュール名

source: Checks if a module called `module_name` has alredy been loaded. If not, it will search for the module in `/sys/modules/module_name` and load it. If no module is found, it will generate an error.
de: Prüft, ob ein Modul namens `module_name` bereits geladen wurde. Wenn nicht, wird das Modul in `/sys/modules/module_name` gesucht und geladen. Wenn kein Modul gefunden wird, wird ein Fehler generiert.
es: Revisa si se ha cargado un módulo llamado `module_name`. Si no, buscará el módulo en `/sys/modules/module_name` y lo cargará. Si no se encuentra ningún módulo, generará un error.
fr: Vérifie si un module appelé `module_name` a déjà été chargé. Sinon, il recherchera le module dans `/sys/modules/module_name` et le chargera. Si aucun module n'est trouvé, il générera une erreur.
ja: `module_name`というモジュールがすでにロードされているかどうかを確認します。そうでない場合は、`/sys/modules/module_name`でモジュールを検索してロードします。モジュールが見つからない場合は、エラーが生成されます。

source: The behavior of `#REQUIRE` differs from that of other BASIC commands. It is executed as soon as it is spotted by the interpreter, for instance when loading a program.
de: Das Verhalten von `#REQUIRE` unterscheidet sich von dem anderer BASIC-Befehle. Es wird ausgeführt, sobald es vom Interpreter erkannt wird, zB beim Laden eines Programms.
es: El comportamiento de `#REQUIRE` difiere del de otros comandos BASIC. Se ejecuta tan pronto como es visto por el intérprete, por ejemplo al cargar un programa.
fr: Le comportement de `#REQUIRE` diffère de celui des autres commandes BASIC. Il est exécuté dès qu'il est repéré par l'interpréteur, par exemple lors du chargement d'un programme.
ja: `＃REQUIRE`の動作は、他のBASICコマンドの動作とは異なります。プログラムのロード時など、インタプリタによって検出されるとすぐに実行されます。

source: This means that `#REQUIRE` will already generate an error when loading a program if the specified module cannot be found.
de: Dies bedeutet, dass `#REQUIRE` bereits beim Laden eines Programms einen Fehler generiert, wenn das angegebene Modul nicht gefunden werden kann.
es: Esto significa que `#REQUIRE` ya generará un error al cargar un programa si no se puede encontrar el módulo especificado.
fr: Cela signifie que `#REQUIRE` générera déjà une erreur lors du chargement d'un programme si le module spécifié est introuvable.
ja: これは、指定されたモジュールが見つからない場合、プログラムのロード時に`＃REQUIRE`がすでにエラーを生成していることを意味します。

source: When executed during normal program flow, `#REQUIRE` will not do anything.
de: Bei der Ausführung während des normalen Programmablaufs wird `#REQUIRE` nichts tun.
es: Cuando se ejecute durante el flujo normal del programa, `#REQUIRE` no hará nada.
fr: Lorsqu'il est exécuté pendant le déroulement normal du programme, `#REQUIRE` ne fera rien.
ja: 通常のプログラムフロー中に実行された場合、`＃REQUIRE`は何もしません。

source: font number
de: Schriftartnummer
es: número de fuente
fr: numéro de police
ja: フォント番号

source: font name
de: Schriftartenname
es: nombre de fuente
fr: nom de la police
ja: フォント名

source: font width (pixels)
de: Schriftbreite (Pixel)
es: ancho de fuente (pixels)
fr: largeur de police (pixels)
ja: フォント幅(ピクセル)

source: font height (pixels)
de: Schrifthöhe (Pixel)
es: altura de la fuente (pixels)
fr: hauteur de police (pixels)
ja: フォントの高さ（ピクセル）

source: Returns the index of the selected font in `RET(0)`.
de: Gibt den Index der ausgewählten Schriftart in `RET(0)` zurück.
es: Devuelve el índice de la fuente seleccionada en `RET(0)`.
fr: Renvoie l'index de la police sélectionnée dans `RET(0)`.
ja: 選択したフォントのインデックスを`RET(0)`で返します。

source: The following fonts are built-in:
de: Die folgenden Schriftarten sind integriert:
es: Las siguientes fuentes están incorporadas:
fr: Les polices suivantes sont intégrées :
ja: 次のフォントが組み込まれています。

source: Lexis font, 6x8 pixels (default)
de: Lexis-Schriftart, 6x8 Pixel (Standard)
es: Fuente Lexis, 6x8 píxeles (por defecto)
fr: Police Lexis, 6x8 pixels (par défaut)
ja: Lexisフォント、6x8ピクセル（デフォルト）

source: PETSCII-style font, 8x8 pixels
de: Schrift im PETSCII-Stil, 8x8 Pixel
es: Fuente de estilo PETSCII, 8x8 píxeles.
fr: Police de style PETSCII, 8x8 pixels
ja: PETSCIIスタイルのフォント、8x8ピクセル

source: Japanese font, 8x8 pixels
de: Japanische Schriftart, 8x8 Pixel
es: Fuente japonesa, 8x8 píxeles
fr: Police japonaise, 8x8 pixels
ja: 日本語フォント、8x8ピクセル

source: HP 100 LX font, 8x8 pixels
de: HP 100 LX-Schriftart, 8x8 Pixel
es: Fuente HP 100 LX, 8x8 píxeles
fr: Police HP 100 LX, 8x8 pixels
ja: HP 100 LXフォント、8x8ピクセル

source: * Additional fonts will be assigned consecutive font indices.
de: * Zusätzlichen Schriftarten werden fortlaufende Schriftartindizes zugewiesen.
es: * A las fuentes adicionales se les asignarán índices de fuentes consecutivos.
fr: * Les polices supplémentaires se verront attribuer des indices de police consécutifs.
ja: *追加のフォントには、連続したフォントインデックスが割り当てられます。

source: * The font set at power-on can be set using the `CONFIG` command.
de: * Die beim Einschalten eingestellte Schriftart kann mit dem Befehl `CONFIG` eingestellt werden.
es: * El tipo de letra configurado al encender el equipo puede ajustarse mediante el comando `CONFIG`.
fr: * La police définie à la mise sous tension peut être définie à l'aide de la commande `CONFIG`.
ja: ※電源投入時に設定するフォントは、 `CONFIG`コマンドで設定できます。

source: Lists installed fonts.
de: Listet installierte Schriftarten auf.
es: Lista las fuentes instaladas.
fr: Répertorie les polices installées.
ja: インストールされているフォントを一覧表示します。

source: Prints a tab-separated list of the indices, names and sizes of the fonts currently loaded.
de: Druckt eine tabulatorgetrennte Liste der Indizes, Namen und Größen der aktuell geladenen Schriftarten.
es: Imprime una lista separada por pestañas de los índices, nombres y tamaños de las fuentes actualmente cargadas.
fr: Imprime une liste séparée par des tabulations des indices, noms et tailles des polices actuellement chargées.
ja: 現在ロードされているフォントのインデックス、名前、サイズのタブ区切りリストを印刷します。

source: The alternative syntax `FRAME()` is supported for backwards compatibility with earlier versions of Engine BASIC.
de: Die alternative Syntax `FRAME()` wird aus Gründen der Abwärtskompatibilität mit früheren Versionen von Engine BASIC unterstützt.
es: La sintaxis alternativa `FRAME()` es compatible con versiones anteriores del Engine BASIC.
fr: La syntaxe alternative `FRAME()` est prise en charge pour une compatibilité descendante avec les versions antérieures de Engine BASIC.
ja: 代替構文`FRAME()`は、以前のバージョンのEngineBASICとの下位互換性のためにサポートされています。

source: Valid register numbers are: `$05`, `$53`, `$84`, `$86`, `$9F` and `$B7`.
de: Gültige Registernummern sind: `$05`, `$53`, `$84`, `$86`, `$9F` und `$B7`.
es: Los números de registro válidos son: `$05`, `$53`, `$84`, `$86`, `$9F` y `$B7`.
fr: Les numéros de registre valides sont : `$05`, `$53`, `$84`, `$86`, `$9F` et `$B7`.
ja: 有効なレジスタ番号: `$05`、`$53`、`$84`、`$86`、`$9F`、`$B7`。

source: Loads a TrueType font from a file.
de: Lädt eine TrueType-Schriftart aus einer Datei.
es: Carga una fuente TrueType de un archivo.
fr: Charge une police TrueType à partir d'un fichier.
ja: ファイルからTrueTypeフォントをロードします。

source: name of TrueType font file
de: Name der TrueType-Schriftartdatei
es: Nombre del archivo de fuente TrueType
fr: nom du fichier de police TrueType
ja: TrueTypeフォントファイルの名前

source: Proportional fonts and fonts that are not specifically designed for use on low-resolution screens will not look very good.
de: Proportionale Schriftarten und Schriftarten, die nicht speziell für die Verwendung auf Bildschirmen mit niedriger Auflösung entwickelt wurden, sehen nicht sehr gut aus.
es: Las fuentes proporcionales y las que no están diseñadas específicamente para su uso en pantallas de baja resolución no se verán muy bien.
fr: Les polices proportionnelles et les polices qui ne sont pas spécifiquement conçues pour être utilisées sur des écrans à faible résolution ne seront pas très belles.
ja: プロポーショナルフォントや、低解像度の画面で使用するために特別に設計されていないフォントは、見栄えがよくありません。

source: tile set's X coordinate, pixels [`0` to `PSIZE(0)-1`]
de: X-Koordinate des Kachelsatzes, Pixel [`0` bis `PSIZE(0)-1`]
es: coordenada X del conjunto de baldosas, en píxeles [de `0` a `PSIZE(0)-1`]
fr: Coordonnée X de l'ensemble des tuiles, en pixels [`0` à `PSIZE(0)-1`].
ja: タイルセットのX座標、ピクセル [`0` から `PSIZE(0)-1`].

source: tile set's Y coordinate, pixels [`0` to `PSIZE(2)-1`]
de: Y-Koordinate des Kachelsatzes, Pixel [`0` bis `PSIZE(2)-1`]
es: coordenada Y del conjunto de baldosas, píxeles [de `0` a `PSIZE(2)-1`]
fr: Coordonnée en Y de l'ensemble des tuiles, en pixels [`0` à `PSIZE(2)-1`].
ja: タイルセットのY座標、ピクセル [`0` から `PSIZE(2)-1`].

source: * `9`: Keyword separation optional [`0` (default) or `1`] + Controls if BASIC keywords need to be separated from other language elements containing alphanumeric characters with a space (`0`), or if they can be adjacent to those like in traditional BASIC dialects (`1`).
de: * `9`: Schlüsselworttrennung optional [`0` (Standard) oder `1`] + Legt fest, ob BASIC-Schlüsselwörter von anderen Sprachelementen, die alphanumerische Zeichen enthalten, mit einem Leerzeichen getrennt werden müssen (`0`), oder ob sie wie in traditionellen BASIC-Dialekten nebeneinander stehen können (`1`).
es: * `9`: Separación de palabras clave opcional [`0` (por defecto) o `1`] + Controla si las palabras clave de BASIC deben ser separadas de otros elementos del lenguaje que contengan caracteres alfanuméricos con un espacio (`0`), o si pueden ser adyacentes a las mismas como en los dialectos tradicionales de BASIC (`1`).
fr: * `9` : Séparation des mots clés en option [`0` (par défaut) ou `1`] + Contrôle si les mots-clés BASIC doivent être séparés des autres éléments du langage contenant des caractères alphanumériques avec un espace (`0`), ou s'ils peuvent être adjacents à ceux comme dans les dialectes BASIC traditionnels (`1`).

source: down
de: abwärts
es: abajo
fr: vers le bas
ja: ダウン

source: Exits a DO, FOR or WHILE loop.
de: Beendet eine DO-, FOR- oder WHILE-Schleife.
es: Sale de un bucle DO, FOR o WHILE.
fr: Quitte une boucle DO, FOR ou WHILE.
ja: DO、FOR、WHILEループを終了します。

source: the counter variable of a FOR loop
de: die Zählervariable einer FOR-Schleife
es: la variable contadora de un bucle FOR
fr: la variable compteur d'une boucle FOR
ja: FORループのカウンタ変数

source: The matching loop is dropped from the loop stack, and execution resumes after the end of the loop (the nearest following `LOOP`, `NEXT` or `WEND` statement, or the nearest `NEXT loop_variable` statement).
de: Die entsprechende Schleife wird aus dem Schleifenstapel entfernt und die Ausführung wird nach dem Ende der Schleife (der nächstfolgenden `LOOP`-, `NEXT`- oder `WEND`-Anweisung oder der nächstfolgenden `NEXT loop_variable`-Anweisung) fortgesetzt.
es: El bucle coincidente se elimina de la pila de bucles y la ejecución se reanuda después del final del bucle (la siguiente declaración `LOOP`, `NEXT` o `WEND` más cercana, o la declaración `NEXT loop_variable` más cercana).
fr: La boucle correspondante est supprimée de la pile de boucles, et l'exécution reprend après la fin de la boucle (l'instruction `LOOP`, `NEXT` ou `WEND` suivante la plus proche, ou l'instruction `NEXT loop_variable` la plus proche).
ja: マッチしたループはループスタックから削除され、ループの終了後（最も近い `LOOP`、`NEXT`、`WEND` 文、または最も近い `NEXT loop_variable` 文）、実行が再開されます。

source: `EXIT` only works as intended in loops with a "single end", i.e. loops that are not iterated using more than one `LOOP`, `NEXT` or `WEND` statement.
de: EXIT" funktioniert nur wie vorgesehen in Schleifen mit einem "einzigen Ende", d.h. Schleifen, die nicht mit mehr als einer `LOOP`-, `NEXT`- oder `WEND`-Anweisung iteriert werden.
es: `EXIT` solo funciona según lo previsto en bucles con un "único final", es decir, bucles que no se iteran utilizando más de una declaración `LOOP`, `NEXT` o `WEND`.
fr: `EXIT` ne fonctionne comme prévu que dans les boucles avec une "fin unique", c'est-à-dire les boucles qui ne sont pas itérées en utilisant plus d'une instruction `LOOP`, `NEXT` ou `WEND`.
ja: `EXIT` は "single end" のループ、つまり複数の `LOOP`、`NEXT`、`WEND` ステートメントを使用して反復されないループにおいてのみ、意図したとおりに動作します。

source: Power to raise _e_ to.
de: Potenz, auf die _e_ angehoben werden soll.
es: Poder para elevar _e_ a.
fr: Puissance à laquelle élever _e_.

source: Selects the I2C bus to use.
de: Wählt den zu verwendenden I2C-Bus aus.
es: Selecciona el bus I2C a utilizar.
fr: Sélectionne le bus I2C à utiliser.
ja: 使用するI2Cバスを選択します。

source: I2C bus number [`0` to `255`]
de: I2C-Bus-Nummer [`0` bis `255`]
es: Número de bus I2C [`0` a `255`]
fr: Numéro de bus I2C [`0` à` 255`]
ja: I2Cバス番号 [`0` ～ `255`].

source: This command is only implemented on Linux-based platforms.
de: Dieser Befehl ist nur auf Linux-basierten Plattformen implementiert.
es: Este comando sólo está implementado en plataformas basadas en Linux.
fr: Cette commande n'est implémentée que sur les plates-formes Linux.
ja: このコマンドは、Linux ベースのプラットフォームでのみ実装されています。

source: Left button
de: Linke Taste
es: Botón izquierdo
fr: Bouton gauche
ja: 左のボタン

source: Right button
de: Rechte Taste
es: Botón derecho
fr: Bouton droit
ja: 右ボタン

source: Middle button
de: Mittlere Taste
es: Botón medio
fr: Bouton du milieu
ja: 真ん中のボタン

source: n/a
de: k.A.
fr: s/o
ja: 該当なし

source: Write a byte string to an address in memory.
de: Schreiben eines Byte-Strings an eine Adresse im Speicher.
es: Escribe una cadena de byte a una dirección en memoria.
fr: Écrire une chaîne d'octets à une adresse en mémoire.
ja: メモリ内のアドレスにバイト文字列を書き込みます。

source: * Programs are saved without line numbers if `LINE OFF` is specified. Otherwise, line numbers are included.
de: * Programme werden ohne Zeilennummern gespeichert, wenn `LINE OFF` angegeben ist. Andernfalls werden die Zeilennummern mitgespeichert.
es: * Los programas se guardan sin números de línea si se especifica `LINE OFF`. En caso contrario, se incluyen los números de línea.
fr: * Les programmes sont sauvegardés sans numéro de ligne si `LINE OFF` est spécifié. Sinon, les numéros de ligne sont inclus.
ja: * `LINE OFF` が指定された場合、プログラムは行番号なしで保存されます。それ以外の場合は、行番号が含まれます。
