Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: * `10`: Physical screen mode (H3 platform only) [`0` (default) to `6`] + Sets the physical screen resolution: + `0` (1920x1080 HDMI), `1` (1280x1024 DVI), `2` (1280x720 HDMI), `3` + (1024x768 DVI), `4` (800x600 DVI), `5` (640x480 DVI) or `6` + (1920x1200 HDMI). + It is necessary to save the configuration and reboot the system for this option to take effect.
de: * `10`: Physikalischer Bildschirmmodus (nur H3-Plattform) [`0` (Standard) auf `6`] + Stellt die physische Bildschirmauflösung ein: + `0` (1920 x 1080 HDMI), `1` (1280 x 1024 DVI), `2` (1280 x 720 HDMI), `3` + (1024 x 768 DVI), `4` (800 x 600 DVI), `5` (640 x 480 DVI) oder `6` + (1920 x 1200 HDMI). + Es ist erforderlich, die Konfiguration zu speichern und das System neu zu starten, damit diese Option wirksam wird.
es: * `10`: Modo de pantalla física (solo plataforma H3) [`0` (predeterminado) a `6`] + Establece la resolución de la pantalla física: + `0` (1920x1080 HDMI), `1` (1280x1024 DVI), `2` (1280x720 HDMI), `3` + (1024x768 DVI), `4` (800x600 DVI), `5` (640x480 DVI) o `6` + (1920x1200 HDMI). + Es necesario guardar la configuración y reiniciar el sistema para que esta opción surta efecto.
fr: * `10`: Mode écran physique (plate-forme H3 uniquement) [`0` (par défaut) à `6`] + Règle la résolution physique de l'écran: + `0` (1920x1080 HDMI), `1` (1280x1024 DVI), `2 `(1280x720 HDMI), `3 `+ (1024x768 DVI), `4 `(800x600 DVI), `5 `(640x480 DVI) ou `6 `+ (1920x1200 HDMI). + Il est nécessaire de sauvegarder la configuration et de redémarrer le système pour que cette option prenne effet.
ja: * `10`：物理画面モード（H3プラットフォームのみ）[`0` (デフォルト) から `6`] + 物理画面の解像度を設定します：+ `0`（1920x1080 HDMI）、 `1`（1280x1024 DVI）、`2`（1280x720 HDMI）、 `3` +（1024x768 DVI）、`4`（800x600 DVI）、 `5`（640x480 DVI）または, `6` + （1920x1200 HDMI）。 + このオプションを有効にするには、構成を保存してシステムを再起動する必要があります。

source: To restore the default configuration, run the command `REMOVE "/sd/config.ini"` and restart the system.
de: Führen Sie den Befehl `REMOVE "/sd/config.ini"` aus und starten Sie das System neu, um die Standardkonfiguration wiederherzustellen.
es: Para restaurar la configuración predeterminada, ejecute el comando `REMOVE" /sd/config.ini "` y reinicie el sistema.
fr: Pour restaurer la configuration par défaut, exécutez la commande `REMOVE" /sd/config.ini "` et redémarrez le système.
ja: デフォルト設定に戻すには、コマンド `REMOVE "/sd/config.ini"`を実行し、システムを再起動します。

source: * Changing the low-pass filter option (`3`) only takes effect at the time of the next block move, which happens for instance when scrolling the screen.
de: * Das Ändern der Tiefpassfilteroption (`3`) wird nur zum Zeitpunkt der nächsten Blockverschiebung wirksam, die beispielsweise beim Scrollen des Bildschirms auftritt.
es: * El cambio de la opción de filtro de paso bajo (`3`) solo tiene efecto en el momento del siguiente movimiento de bloque, lo que ocurre, por ejemplo, al desplazarse por la pantalla.
fr: * La modification de l'option de filtre passe-bas (`3`) ne prend effet qu'au moment du prochain mouvement de bloc, ce qui se produit par exemple lors du défilement de l'écran.
ja: * ローパスフィルターオプション（`3`）の変更は、次のブロック移動時にのみ有効になります。これは、たとえば画面をスクロールするときに発生します。

source: Saves the current set of configuration options as default.
de: Speichert die aktuellen Konfigurationsoptionen als Standard.
es: Guarda el conjunto actual de opciones de configuración como predeterminado.
fr: Enregistre l'ensemble actuel d'options de configuration par défaut.
ja: 現在の構成オプションのセットをデフォルトとして保存します。

source: Checks whether the end of a file has been reached.
de: Überprüft, ob das Ende einer Datei erreicht wurde.
es: Comprueba si se ha llegado al final de un archivo.
fr: Vérifie si la fin d'un fichier a été atteinte.
ja: ファイルの終わりに到達したかどうかを確認します。

source: number of an open file [`0` to `{MAX_USER_FILES_m1}`]
de: Nummer einer geöffneten Datei [`0` bis `{MAX_USER_FILES_m1} `]
es: número de un archivo abierto [`0` a `{MAX_USER_FILES_m1} `]
fr: numéro d'un fichier ouvert [`0` à `{MAX_USER_FILES_m1}`]

source: `-1` if the end of the file has been reached, `0` otherwise.
de: `-1`, wenn das Ende der Datei erreicht wurde, andernfalls `0`.
es: `-1` si se ha llegado al final del archivo, `0` en caso contrario.
fr: `-1` si la fin du fichier est atteinte, `0` sinon.
ja: ファイルの終わりに達した場合は `-1`、それ以外の場合は`0`。

source: Returns the length of a file in bytes.
de: Gibt die Länge einer Datei in Bytes zurück.
es: Devuelve la longitud de un archivo en bytes.
fr: Renvoie la longueur d'un fichier en octets.
ja: ファイルの長さをバイト単位で返します。

source: Length of file.
de: Länge der Datei.
es: Longitud del archivo.
fr: Longueur du fichier.
ja: ファイルの長さ。

source: Returns the current position within a file.
de: Gibt die aktuelle Position innerhalb einer Datei zurück.
es: Devuelve la posición actual dentro de un archivo.
fr: Renvoie la position actuelle dans un fichier.
ja: ファイル内の現在の位置を返します。

source: Position at which the next byte will be read or written.
de: Position, an der das nächste Byte gelesen oder geschrieben wird.
es: Posición en la que se leerá o escribirá el siguiente byte.
fr: Position à laquelle le prochain octet sera lu ou écrit.
ja: 次のバイトが読み取られるか書き込まれる位置。

source: Returns the next entry of an open directory.
de: Gibt den nächsten Eintrag eines geöffneten Verzeichnisses zurück.
es: Devuelve la siguiente entrada de un directorio abierto.
fr: Renvoie l'entrée suivante d'un répertoire ouvert.
ja: 開いているディレクトリの次のエントリを返します。

source: number of an open directory
de: Nummer eines offenen Verzeichnisses
es: número de un directorio abierto
fr: numéro d'un répertoire ouvert

source: Returns the directory entry as the value of the function.
de: Gibt den Verzeichniseintrag als Wert der Funktion zurück.
es: Devuelve la entrada del directorio como el valor de la función.
fr: Renvoie l'entrée du répertoire comme valeur de la fonction.
ja: 関数の値としてディレクトリエントリを返します。

source: Returns an empty string if the end of the directory has been reached.
de: Gibt einen leeren String zurück, wenn das Ende des Verzeichnisses erreicht wurde.
es: Devuelve una cadena vacía si se ha llegado al final del directorio.
fr: Renvoie une chaîne vide si la fin du répertoire a été atteinte.
ja: ディレクトリの終わりに達した場合は、空の文字列を返します。

source: Also returns the entry's size in `RET(0)` and `0` or `1` in RET(1) depending on whether the entry is a directory itself.
de: Gibt auch die Größe des Eintrags in `RET(0)` und `0` oder `1` in RET (1) zurück, je nachdem, ob der Eintrag selbst ein Verzeichnis ist.
es: También devuelve el tamaño de la entrada en `RET(0)` y `0` o `1` en RET(1) dependiendo de si la entrada es un directorio en sí.
fr: Renvoie également la taille de l'entrée dans `RET(0)` et `0` ou `1` dans RET(1) selon que l'entrée est un répertoire lui-même.
ja: また、エントリがディレクトリ自体であるかどうかに応じて、エントリのサイズを「RET(0)」に返し、`0`または`1`をRET(1)に返します。

source: An error is generated if `dir_num` is not open or not a directory.
de: Ein Fehler wird generiert, wenn `dir_num` nicht geöffnet ist oder kein Verzeichnis.
es: Se genera un error si `dir_num` no está abierto o no es un directorio.
fr: Une erreur est générée si `dir_num` n'est pas ouvert ou n'est pas un répertoire.
ja: `dir_num`が開いていないか、ディレクトリがない場合、エラーが生成されます。

source: Returns a string of characters read from a specified file.
de: Gibt einen String zurück, der aus einer angegebenen Datei gelesen wurde.
es: Devuelve una cadena de caracteres leídos de un archivo especificado.
fr: Renvoie une chaîne de caractères lue à partir d'un fichier spécifié.
ja: 指定されたファイルから読み取られた文字列を返します。

source: number of bytes to read
de: Anzahl der zu lesenden Bytes
es: número de bytes para leer
fr: nombre d'octets à lire
ja: 読み取るバイト数

source: `CMD` allows to redirect standard text output or input operations to files.
de: Mit `CMD` können Standard-Textausgabe- oder -Eingabevorgänge in Dateien umgeleitet werden.
es: `CMD` permite redirigir la salida de texto estándar o las operaciones de entrada a los archivos.
fr: `CMD` permet de rediriger la sortie de texte standard ou les opérations d'entrée vers des fichiers.
ja: `CMD`を使用すると、標準のテキスト出力または入力操作をファイルにリダイレクトできます。

source: Redirection will automatically be reset if a file redirected to is closed (either explicitly or implicitly, by opening a new file using the currently used file number), or when returning to the command prompt.
de: Die Umleitung wird automatisch zurückgesetzt, wenn eine umgeleitete Datei geschlossen wird (entweder explizit oder implizit durch Öffnen einer neuen Datei unter Verwendung der aktuell verwendeten Dateinummer) oder wenn Sie zur Eingabeaufforderung zurückkehren.
es: La redirección se restablecerá automáticamente si se cierra un archivo al que se redirige (ya sea de forma explícita o implícita, al abrir un nuevo archivo con el número de archivo utilizado actualmente) o al volver al símbolo del sistema.
fr: La redirection sera automatiquement réinitialisée si un fichier redirigé vers est fermé (explicitement ou implicitement, en ouvrant un nouveau fichier en utilisant le numéro de fichier actuellement utilisé), ou lors du retour à l'invite de commande.
ja: リダイレクト先のファイルが閉じられた場合（明示的または暗黙的に、現在使用されているファイル番号を使用して新しいファイルを開くことにより）、またはコマンドプロンプトに戻った場合、リダイレクトは自動的にリセットされます。

source: Changes the current directory.
de: Ändert das aktuelle Verzeichnis.
es: Cambia el directorio actual.
fr: Modifie le répertoire actuel.
ja: 現在のディレクトリを変更します。

source: path to the new current directory
de: Pfad zum neuen aktuellen Verzeichnis
es: ruta al nuevo directorio actual
fr: chemin vers le nouveau répertoire courant
ja: 新しい現在のディレクトリへのパス

source: Returns the current working directory.
de: Gibt das aktuelle Arbeitsverzeichnis zurück.
es: Devuelve el directorio de trabajo actual.
fr: Renvoie le répertoire de travail actuel.
ja: 現在の作業ディレクトリを返します。

source: Current working directory.
de: Aktuelles Arbeitsverzeichnis.
es: Directorio de trabajo actual.
fr: Répertoire de travail actuel.
ja: 現在の作業ディレクトリ。

source: Opens a file or directory.
de: Öffnet eine Datei oder ein Verzeichnis.
es: Abre un archivo o directorio.
fr: Ouvre un fichier ou un répertoire.
ja: ファイルまたはディレクトリを開きます。

source: name of the file or directory
de: Name der Datei oder des Verzeichnisses
es: nombre del archivo o directorio
fr: nom du fichier ou du répertoire
ja: ファイルまたはディレクトリの名前

source: file number to be used [`0` to `{MAX_USER_FILES_m1}`]
de: Zu verwendende Dateinummer [`0` bis `{MAX_USER_FILES_m1} `]
es: número de archivo que se utilizará [`0` a `{MAX_USER_FILES_m1} `]
fr: numéro de fichier à utiliser [`0` à `{MAX_USER_FILES_m1}`]
ja: 使用するファイル番号[`0`〜`{MAX_USER_FILES_m1}`]

source: * `*INPUT*` opens the file for reading. (This is the default if no mode is specified.)
de: * `* INPUT *` öffnet die Datei zum Lesen. (Dies ist die Standardeinstellung, wenn kein Modus angegeben ist.)
es: * `* INPUT *` abre el archivo para su lectura. (Este es el valor predeterminado si no se especifica ningún modo).
fr: * `* INPUT *` ouvre le fichier pour la lecture. (Il s'agit de la valeur par défaut si aucun mode n'est spécifié.)
ja: * `* INPUT *`は、読み取り用にファイルを開きます。（これは、モードが指定されていない場合のデフォルトです。）

source: * `*OUTPUT*` empties the file and opens it for writing.
de: * `* OUTPUT *` leert die Datei und öffnet sie zum Schreiben.
es: * `* OUTPUT *` vacía el archivo y lo abre para escribir.
fr: * `* OUTPUT *` vi le fichier et l'ouvre pour l'écriture.
ja: * `* OUTPUT *`はファイルを空にし、書き込み用に開きます。

source: * `*APPEND*` opens the file for writing while keeping its content.
de: * `* APPEND *` öffnet die Datei zum Schreiben, während der Inhalt erhalten bleibt.
es: * `* APPEND *` abre el archivo para escribir mientras mantiene su contenido.
fr: * `* APPEND *` ouvre le fichier pour l'écriture tout en conservant son contenu.
ja: * `* APPEND *`は、内容を保持したまま、書き込み用にファイルを開きます。

source: * `*DIRECTORY*` opens `file$` as a directory.
de: * `* DIRECTORY *` öffnet `file$` als Verzeichnis.
es: * `*DIRECTORY*` abre `file$` como directorio.
fr: * `* RÉPERTOIRE *` ouvre `file$` en tant que répertoire.
ja: * `* DIRECTORY *`は `file$`をディレクトリとして開きます。

source: Closes an open file or directory.
de: Schließt eine geöffnete Datei oder ein geöffnetes Verzeichnis.
es: Cierra un archivo o directorio abierto.
fr: Ferme un fichier ou un répertoire ouvert.
ja: 開いているファイルまたはディレクトリを閉じます。

source: number of an open file or directory [`0` to `{MAX_USER_FILES_m1}`]
de: Nummer einer geöffneten Datei oder eines geöffneten Verzeichnisses [`0` bis` {MAX_USER_FILES_m1} `]
es: número de un archivo o directorio abierto [`0` a `{MAX_USER_FILES_m1} `]
fr: numéro d'un fichier ou d'un répertoire ouvert [`0` à `{MAX_USER_FILES_m1}`]

source: Sets the file position for the next read or write.
de: Legt die Dateiposition für das nächste Lesen oder Schreiben fest.
es: Establece la posición del archivo para la siguiente lectura o escritura.
fr: Définit la position du fichier pour la prochaine lecture ou écriture.
ja: 次の読み取りまたは書き込みのファイル位置を設定します。

source: position where the next read or write should occur
de: Position, an der das nächste Lesen oder Schreiben erfolgen soll
es: posición donde debe ocurrir la siguiente lectura o escritura
fr: position où la prochaine lecture ou écriture doit avoir lieu
ja: 次の読み取りまたは書き込みが発生する位置

source: The command will generate an error if `file_num` is not open or the operation is unsuccessful.
de: Der Befehl generiert einen Fehler, wenn `file_num` nicht geöffnet ist oder der Vorgang nicht erfolgreich ist.
es: El comando generará un error si "file_num" no está abierto o la operación no se realiza correctamente.
fr: La commande générera une erreur si `file_num` n'est pas ouvert ou si l'opération échoue.
ja: `file_num`が開いていないか、操作が失敗した場合、コマンドはエラーを生成します。

source: Displays the contents of the current or a specified directory.
de: Zeigt den Inhalt des aktuellen oder eines angegebenen Verzeichnisses an.
es: Muestra el contenido del directorio actual o especificado.
fr: Affiche le contenu du répertoire actuel ou d'un répertoire spécifié.
ja: 現在のディレクトリまたは指定したディレクトリの内容を表示します。

source: a filename or path, may include wildcard characters [default: all files in the current directory]
de: Ein Dateiname oder Pfad kann Platzhalterzeichen enthalten [Standard: Alle Dateien im aktuellen Verzeichnis]
es: un nombre de archivo o ruta, puede incluir caracteres comodín [predeterminado: todos los archivos en el directorio actual]
fr: un nom de fichier ou un chemin, peut inclure des caractères génériques [par défaut: tous les fichiers du répertoire courant]
ja: ファイル名またはパスには、ワイルドカード文字を含めることができます[デフォルト：現在のディレクトリ内のすべてのファイル]

source: Creates a directory.
de: Erstellt ein Verzeichnis.
es: Crea un directorio.
fr: Crée un répertoire.
ja: ディレクトリを作成します。

source: path to the new directory
de: Pfad zum neuen Verzeichnis
es: ruta al nuevo directorio
fr: chemin vers le nouveau répertoire
ja: 新しいディレクトリへのパス

source: Deletes a directory.
de: Löscht ein Verzeichnis.
es: Elimina un directorio.
fr: Supprime un répertoire.
ja: ディレクトリを削除します。

source: name of directory to be deleted
de: Name des zu löschenden Verzeichnisses
es: nombre del directorio que se eliminará
fr: nom du répertoire à supprimer
ja: 削除するディレクトリの名前

source: Does not support wildcard patterns.
de: Unterstützt keine Platzhaltermuster.
es: No admite patrones de comodines.
fr: Ne prend pas en charge les modèles génériques.
ja: ワイルドカードパターンはサポートしていません。

source: Changes the name of a file or directory.
de: Ändert den Namen einer Datei oder eines Verzeichnisses.
es: Cambia el nombre de un archivo o directorio.
fr: Modifie le nom d'un fichier ou d'un répertoire.
ja: ファイルまたはディレクトリの名前を変更します。

source: current file name
de: aktueller Dateiname
es: nombre de archivo actual
fr: nom de fichier actuel
ja: 現在のファイル名

source: new file name
de: neuer Dateiname
es: nuevo nombre de archivo
fr: nouveau nom de fichier
ja: 新しいファイル名

source: Deletes a file.
de: Löscht eine Datei.
es: Elimina un archivo.
fr: Supprime un fichier.
ja: ファイルを削除します。

source: WARNING: `REMOVE` does not ask for confirmation before deleting the specified file.
de: WARNUNG: `REMOVE` fordert keine Bestätigung an, bevor die angegebene Datei gelöscht wird.
es: ADVERTENCIA: `REMOVE` no solicita confirmación antes de eliminar el archivo especificado.
fr: AVERTISSEMENT: `REMOVE` ne demande pas de confirmation avant de supprimer le fichier spécifié.
ja: 警告： `REMOVE`は、指定されたファイルを削除する前に確認を求めません。

source: WARNING: Do not confuse with `DELETE`, which deletes lines from the program in memory.
de: WARNUNG: Nicht mit `DELETE` verwechseln, wodurch Zeilen aus dem Programm im Speicher gelöscht werden.
es: ADVERTENCIA: No confunda con `DELETE`, que borra líneas del programa en la memoria.
fr: AVERTISSEMENT: ne pas confondre avec `DELETE`, qui supprime les lignes du programme en mémoire.
ja: 警告：メモリ内のプログラムから行を削除する `DELETE`と混同しないでください。

source: file to be deleted
de: zu löschende Datei
es: archivo para ser eliminado
fr: fichier à supprimer
ja: 削除するファイル

source: Copies a file.
de: Kopiert eine Datei.
es: Copia un archivo.
fr: Copie un fichier.
ja: ファイルをコピーします。

source: file to be copied
de: zu kopierende Datei
es: archivo a copiar
fr: fichier à copier
ja: コピーするファイル

source: Compares two files.
de: Vergleicht zwei Dateien.
es: Compara dos archivos.
fr: Compare deux fichiers.
ja: 2つのファイルを比較します。

source: name of first file to compare
de: Name der ersten zu vergleichenden Datei
es: nombre del primer archivo a comparar
fr: nom du premier fichier à comparer
ja: 比較する最初のファイルの名前

source: If both files are equal, the return value is `0`. Otherwise, the return value is `-1` or `1`.
de: Wenn beide Dateien gleich sind, ist der Rückgabewert `0`. Andernfalls ist der Rückgabewert `-1` oder `1`.
es: Si ambos archivos son iguales, el valor de retorno es "0". De lo contrario, el valor de retorno es `-1` o `1`.
fr: Si les deux fichiers sont égaux, la valeur de retour est `0`. Sinon, la valeur de retour est `-1` ou `1`.
ja: 両方のファイルが等しい場合、戻り値は`0`です。それ以外の場合、戻り値は `-1`または`1`です。

source: If the files are not equal, the sign of the result is determined by the sign of the difference between the first pair of bytes that differ in `file1$` and `file2$`.
de: Wenn die Dateien nicht gleich sind, wird das Vorzeichen des Ergebnisses durch das Vorzeichen der Differenz zwischen dem ersten Bytepaar bestimmt, das sich in `file1$` und `file2$` unterscheidet.
es: Si los archivos no son iguales, el signo del resultado está determinado por el signo de la diferencia entre el primer par de bytes que difieren en `file1$` y `file2$`.
fr: Si les fichiers ne sont pas égaux, le signe du résultat est déterminé par le signe de la différence entre la première paire d'octets qui diffèrent par `file1$` et `file2$`.
ja: ファイルが等しくない場合、結果の符号は、 `file1$`と `file2$`が異なる最初のバイトペア間の差の符号によって決定されます。

source: Saves an area of memory to a file.
de: Speichert einen Speicherbereich in einer Datei.
es: Guarda un área de memoria en un archivo.
fr: Enregistre une zone de mémoire dans un fichier.
ja: メモリの領域をファイルに保存します。

source: name of binary file
de: Name der Binärdatei
es: nombre del archivo binario
fr: nom du fichier binaire
ja: バイナリファイルの名前

source: memory start address
de: Speicherstartadresse
es: dirección de inicio de memoria
fr: adresse de démarrage de la mémoire
ja: メモリ開始アドレス

source: number of bytes to be saved
de: Anzahl der zu speichernden Bytes
es: número de bytes que se guardarán
fr: nombre d'octets à enregistrer
ja: 保存するバイト数

source: `BSAVE` will use 32-bit memory accesses if `addr` and `len` are multiples of 4, and 8-bit accesses otherwise.
de: `BSAVE` verwendet 32-Bit-Speicherzugriffe, wenn `addr` und `len` Vielfache von 4 sind, andernfalls 8-Bit-Zugriffe.
es: `BSAVE` utilizará accesos de memoria de 32 bits si` addr` y `len` son múltiplos de 4, y accesos de 8 bits en caso contrario.
fr: `BSAVE` utilisera des accès mémoire 32 bits si `addr` et `len` sont des multiples de 4, et les accès 8 bits dans le cas contraire.
ja: `BSAVE`は`addr`と`len`が4の倍数である場合は32ビットのメモリアクセスを使用し、それ以外の場合は8ビットのアクセスを使用します。

source: While the `BSAVE` command does a basic sanity check of the given parameters, it cannot predict any system malfunctions resulting from its use. Use with caution.
de: Während der Befehl `BSAVE` eine grundlegende Überprüfung der Integrität der angegebenen Parameter durchführt, kann er keine Systemstörungen vorhersagen, die sich aus seiner Verwendung ergeben. Mit Vorsicht verwenden.
es: Si bien el comando `BSAVE` realiza una verificación básica de cordura de los parámetros dados, no puede predecir ningún mal funcionamiento del sistema resultante de su uso. Úselo con precaución.
fr: Alors que la commande `BSAVE` effectue une vérification de base des paramètres donnés, elle ne peut pas prédire les dysfonctionnements du système résultant de son utilisation. Utiliser avec précaution.
ja: `BSAVE`コマンドは、指定されたパラメータの基本的な健全性チェックを実行しますが、その使用に起因するシステムの誤動作を予測することはできません。注意して使用してください。

source: Loads a binary file to memory.
de: Lädt eine Binärdatei in den Speicher.
es: Carga un archivo binario en la memoria.
fr: Charge un fichier binaire en mémoire.
ja: バイナリファイルをメモリにロードします。

source: memory address to be loaded to
de: Speicheradresse, in die geladen werden soll
es: dirección de memoria que se cargará en
fr: adresse mémoire à charger
ja: ロード先メモリアドレス

source: number of bytes to be loaded [default: whole file]
de: Anzahl der zu ladenden Bytes [Standard: ganze Datei]
es: número de bytes que se cargarán [predeterminado: archivo completo]
fr: nombre d'octets à charger [par défaut: fichier entier]
ja: ロードするバイト数[デフォルト：全体ファイル]

source: `BLOAD` will use 32-bit memory accesses if `addr` and `len` are multiples of 4, and 8-bit accesses otherwise.
de: `BLOAD` verwendet 32-Bit-Speicherzugriffe, wenn `addr` und `len` Vielfache von 4 sind, andernfalls 8-Bit-Zugriffe.
es: `BLOAD` utilizará accesos de memoria de 32 bits si` addr` y `len` son múltiplos de 4, y accesos de 8 bits en caso contrario.
fr: `BLOAD` utilisera des accès mémoire 32 bits si `addr` et `len` sont des multiples de 4, et les accès 8 bits dans le cas contraire.
ja: `BLOAD`は`addr`と`len`が4の倍数である場合は32ビットのメモリアクセスを使用し、それ以外の場合は8ビットのアクセスを使用します。

source: While the `BLOAD` command does a basic sanity check of the given parameters, it cannot predict any system malfunctions resulting from its use. Use with caution.
de: Während der Befehl `BLOAD` eine grundlegende Überprüfung der Integrität der angegebenen Parameter durchführt, kann er keine Systemstörungen vorhersagen, die sich aus seiner Verwendung ergeben. Mit Vorsicht verwenden.
es: Si bien el comando `BLOAD` realiza una verificación básica de cordura de los parámetros dados, no puede predecir ningún mal funcionamiento del sistema resultante de su uso. Úselo con precaución.
fr: Alors que la commande `BLOAD` effectue une vérification de base des paramètres donnés, elle ne peut pas prédire les dysfonctionnements du système résultant de son utilisation. Utiliser avec précaution.
ja: `BLOAD`コマンドは、指定されたパラメータの基本的な健全性チェックを実行しますが、その使用に起因するシステムの誤動作を予測することはできません。注意して使用してください。

source: name of the file
de: Name der Datei
es: nombre del archivo
fr: nom du fichier
ja: ファイルの名前

source: Formats the specified file system.
de: Formatiert das angegebene Dateisystem.
es: Formatea el sistema de archivos especificado.
fr: Formate le système de fichiers spécifié.
ja: 指定されたファイルシステムをフォーマットします。
