Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: You have to separate expressions by either a semicolon (`;`) or a comma (`,`). When you use a semicolon, the expressions are printed without separation. When you use a comma, spaces will be inserted until the next tabulator stop is reached.
de: Sie müssen Ausdrücke entweder durch ein Semikolon (`;`) oder ein Komma (`,`) trennen. Wenn Sie ein Semikolon verwenden, werden die Ausdrücke ohne Trennung gedruckt. Wenn Sie ein Komma verwenden, werden Leerzeichen eingefügt, bis der nächste Tabulatorstopp erreicht ist.
es: Debe separar las expresiones con un punto y coma (`;`) o una coma (`,`). Cuando usa un punto y coma, las expresiones se imprimen sin separación. Cuando use una coma, se insertarán espacios hasta que se alcance la siguiente parada del tabulador.
fr: Vous devez séparer les expressions par un point-virgule (`;`) ou une virgule (`,`). Lorsque vous utilisez un point-virgule, les expressions sont imprimées sans séparation. Lorsque vous utilisez une virgule, des espaces seront insérés jusqu'à ce que le prochain arrêt de tabulation soit atteint.
ja: 式はセミコロン（ `;`）またはコンマ（ `、`）で区切る必要があります。セミコロンを使用すると、式は区切りなしで印刷されます。コンマを使用すると、次のタブキーストップに到達するまでスペースが挿入されます。

source: `TAB()` does not work when output is redirected to a file using `CMD`.
de: `TAB()` funktioniert nicht, wenn die Ausgabe mit `CMD` in eine Datei umgeleitet wird.
es: `TAB()` no funciona cuando la salida se redirige a un archivo usando `CMD`.
fr: `TAB()` ne fonctionne pas lorsque la sortie est redirigée vers un fichier en utilisant `CMD`.
ja: `CMD`を使用して出力がファイルにリダイレクトされる場合、`TAB()`は機能しません。

source: Saves a portion of pixel memory as an image file.
de: Speichert einen Teil des Pixelspeichers als Bilddatei.
es: Guarda una parte de la memoria de píxeles como un archivo de imagen.
fr: Enregistre une partie de la mémoire de pixels sous forme de fichier image.
ja: ピクセルメモリの一部を画像ファイルとして保存します。

source: name of image file to be created
de: Name der zu erstellenden Bilddatei
es: nombre del archivo de imagen que se creará
fr: nom du fichier image à créer
ja: 作成する画像ファイルの名前

source: width of pixel memory section, pixels [`0` to `PSIZE(0)-x-1`, default: `PSIZE(0)`]
de: Breite des Pixelspeicherabschnitts, Pixel [`0` bis `PSIZE(0)-x-1`, Standard: `PSIZE(0)`]
es: ancho de la sección de memoria de píxeles, píxeles [`0` a `PSIZE(0)-x-1`, predeterminado: `PSIZE(0)`]
fr: largeur de la section de mémoire de pixels, pixels [`0` à `PSIZE(0)-x-1`, par défaut: `PSIZE(0)`]
ja: ピクセルメモリセクションの幅、ピクセル[`0`から`PSIZE(0)-x-1`、デフォルト： `PSIZE(0）`]

source: height of pixel memory section, pixels [`0` to `PSIZE(2)-y-1`, default: `PSIZE(1)`]
de: Höhe des Pixelspeicherabschnitts, Pixel [`0` bis `PSIZE(2)-y-1`, Standard: `PSIZE(1)`]
es: altura de la sección de memoria de píxeles, píxeles [`0` a `PSIZE(2)-y-1`, predeterminado: `PSIZE(1)`]
fr: hauteur de la section de mémoire de pixels, pixels [`0` à `PSIZE(2)-y-1`, par défaut: `PSIZE(1)`]
ja: ピクセルメモリセクションの高さ、ピクセル[`0`から`PSIZE(2)-y-1`、デフォルト： `PSIZE(1）`]

source: Loads an image file in whole or in parts to pixel memory.
de: Lädt eine Bilddatei ganz oder teilweise in den Pixelspeicher.
es: Carga un archivo de imagen en su totalidad o en partes en la memoria de píxeles.
fr: Charge un fichier image en tout ou en parties dans la mémoire de pixels.
ja: 画像ファイルの全部または一部をピクセルメモリにロードします。

source: background number [`0` to `{MAX_BG_m1}`]
de: Hintergrundnummer [`0` bis `{MAX_BG_m1} `]
es: número de fondo [`0` a `{MAX_BG_m1} `]
fr: numéro d'arrière-plan [`0` à `{MAX_BG_m1}`]
ja: バックグラウンド番号[`0`から`{MAX_BG_m1}`]

source: sprite range [limits between `0` and `{MAX_SPRITES_m1}`]
de: Sprite-Bereich [Grenzwerte zwischen `0` und `{MAX_SPRITES_m1}`]
es: rango de sprites [límites entre `0` y `{MAX_SPRITES_m1} `]
fr: plage de sprite [limites entre `0` et `{MAX_SPRITES_m1}`]
ja: スプライト範囲[`0`と`{MAX_SPRITES_m1}`の間の制限]

source: X-coordinate of destination, pixels [`0` (default) to `PSIZE(0)-w`]
de: X-Koordinate des Ziels, Pixel [`0` (Standard) bis `PSIZE(0)-w`]
es: Coordenada X de destino, píxeles [`0` (predeterminado) a `PSIZE(0)-w`]
fr: Coordonnée X de la destination, pixels [`0` (par défaut) à `PSIZE(0)-w`]
ja: 宛先のX座標、ピクセル[`0`（デフォルト）から`PSIZE(0)-w`]

source: Y-coordinate of destination, pixels [`0` (default) to `PSIZE(2)-h`]
de: Y-Koordinate des Ziels, Pixel [`0` (Standard) bis `PSIZE(2)-h`]
es: Coordenada Y del destino, píxeles [`0` (predeterminado) a `PSIZE(2)-h`]
fr: Coordonnée Y de la destination, pixels [`0` (par défaut) à `PSIZE(2)-h`]
ja: 宛先のY座標、ピクセル[`0`（デフォルト）から`PSIZE(2)-h`]

source: offset within image file, X axis, pixels [default: `0`]
de: Versatz innerhalb der Bilddatei, X-Achse, Pixel [Standard: `0`]
es: desplazamiento dentro del archivo de imagen, eje X, píxeles [predeterminado: `0`]
fr: décalage dans le fichier image, axe X, pixels [par défaut: `0`]
ja: 画像ファイル内のオフセット、X軸、ピクセル[デフォルト:`0`]

source: offset within image file, Y axis, pixels [default: `0`]
de: Versatz innerhalb der Bilddatei, Y-Achse, Pixel [Standard: `0`]
es: desplazamiento dentro del archivo de imagen, eje Y, píxeles [predeterminado: `0`]
fr: décalage dans le fichier image, axe Y, pixels [par défaut: `0`]
ja: 画像ファイル内のオフセット、Y軸、ピクセル[デフォルト:`0`]

source: width of image portion to be loaded, pixels [default: image width]
de: Breite des zu ladenden Bildteils, Pixel [Standard: Bildbreite]
es: ancho de la parte de la imagen que se va a cargar, píxeles [predeterminado: ancho de la imagen]
fr: largeur de la partie d'image à charger, pixels [par défaut: largeur de l'image]
ja: ロードする画像部分の幅、ピクセル[デフォルト：画像幅]

source: height of image portion to be loaded, pixels [default: image height]
de: Höhe des zu ladenden Bildteils, Pixel [Standard: Bildhöhe]
es: altura de la parte de la imagen que se va a cargar, píxeles [predeterminado: altura de la imagen]
fr: hauteur de la partie d'image à charger, pixels [par défaut: hauteur de l'image]
ja: ロードする画像部分の高さ、ピクセル[デフォルト：画像の高さ]

source: color key for transparency [default: no transparency]
de: Farbschlüssel für Transparenz [Standard: keine Transparenz]
es: clave de color para transparencia [predeterminado: sin transparencia]
fr: clé de couleur pour la transparence [par défaut: pas de transparence]
ja: 透明度のカラーキー[デフォルト：透明度なし]

source: scaling factor [default: `1`]
de: Skalierungsfaktor [Standard: `1`]
es: factor de escala [predeterminado: `1`]
fr: facteur d'échelle [par défaut: `1`]
ja: スケール係数 [デフォルト: `1`]

source: Returns the destination coordinates in `RET(0)` and `RET(1)`, as well as width and height in `RET(2)` and `RET(3)`, respectively.
de: Gibt die Zielkoordinaten in `RET(0)` und `RET(1)` sowie Breite und Höhe in `RET(2)` bzw. `RET(3)` zurück.
es: Devuelve las coordenadas de destino en `RET(0)` y `RET(1)`, así como la anchura y la altura en `RET(2)` y `RET(3)`, respectivamente.
fr: Renvoie les coordonnées de destination dans `RET(0)` et `RET(1)`, ainsi que la largeur et la hauteur dans `RET(2)` et `RET(3)`, respectivement.
ja: 宛先座標を `RET(0)`と `RET(1)`で返し、幅と高さをそれぞれ `RET(2)`と `RET(3)`で返します。

source: If no destination is specified, an area of off-screen memory will be allocated automatically.
de: Wenn kein Ziel angegeben ist, wird automatisch ein Bereich des Off-Screen-Speichers zugewiesen.
es: Si no se especifica ningún destino, se asignará automáticamente un área de memoria fuera de la pantalla.
fr: Si aucune destination n'est spécifiée, une zone de mémoire hors écran sera allouée automatiquement.
ja: 宛先が指定されていない場合、オフスクリーンメモリの領域が自動的に割り当てられます。

source: If `AS BG` is used, the loaded image portion will be assigned to the specified background as its tile set.
de: Wenn `AS BG` verwendet wird, wird der geladene Bildteil dem angegebenen Hintergrund als Kachelsatz zugewiesen.
es: Si se utiliza "AS BG", la parte de la imagen cargada se asignará al fondo especificado como su conjunto de mosaicos.
fr: Si `AS BG` est utilisé, la portion d'image chargée sera affectée à l'arrière-plan spécifié comme son jeu de tuiles.
ja: `AS BG`を使用すると、読み込まれた画像部分がタイルセットとして指定された背景に割り当てられます。

source: If `AS SPRITE` is used, the loaded image portion will be assigned to the specified range of sprites as their sprite patterns.
de: Wenn `AS SPRITE` verwendet wird, wird der geladene Bildteil dem angegebenen Bereich von Sprites als deren Sprite-Pattern zugewiesen.
es: Si se utiliza "AS SPRITE", la parte de la imagen cargada se asignará al rango especificado de sprites como sus patrones de sprites.
fr: Si `comme Sprite` est utilisé, la partie d'image chargée sera attribuée à la plage spécifiée des sprites comme motifs de sprite.
ja: `AS SPRITE`を使用すると、ロードされた画像部分が指定された範囲のスプライトにスプライトパターンとして割り当てられます。

source: If a color key is specified, pixels of the given color will not be drawn.
de: Wenn ein Farbschlüssel angegeben ist, werden Pixel der angegebenen Farbe nicht gezeichnet.
es: Si se especifica una clave de color, no se dibujarán los píxeles del color dado.
fr: Si une clé de couleur est spécifiée, les pixels de la couleur donnée ne seront pas dessinés.
ja: カラーキーを指定した場合、指定した色のピクセルは描画されません。

source: If the scaling factor for both dimensions is `-2`, the image will be fit to the screen while preserving the aspect ratio.
de: Wenn der Skalierungsfaktor für beide Dimensionen `-2` beträgt, wird das Bild unter Beibehaltung des Seitenverhältnisses an den Bildschirm angepasst.
es: Si el factor de escalado para ambas dimensiones es `-2`, la imagen será ajustada a la pantalla preservando al mismo tiempo la relación de aspecto.
fr: Si le facteur de mise à l'échelle pour les deux dimensions est `-2`, l'image sera adaptée à l'écran tout en préservant le rapport hauteur / largeur.
ja: 両方の寸法の倍率が`-2`の場合、アスペクト比を維持しながら画像が画面にフィットします。

source: IMPORTANT: Resizing is not supported for images in PCX format.
de: WICHTIG: Die Größenänderung wird nicht für Bilder im PCX-Format unterstützt.
es: IMPORTANTE: No se admite el cambio de tamaño para imágenes en formato PCX.
fr: IMPORTANT: le redimensionnement n'est pas pris en charge pour les images au format PCX.
ja: 重要：PCX形式の画像のサイズ変更はサポートされていません。

source: Runs the ASCII text editor.
de: Führt den ASCII-Texteditor aus.
es: Ejecuta el editor de texto ASCII.
fr: Exécute l'éditeur de texte ASCII.
ja: ASCIIテキストエディタを実行します。

source: name of file to be edited [default: new file]
de: Name der zu bearbeitenden Datei [Standard: neue Datei]
es: nombre del archivo que se va a editar [predeterminado: nuevo archivo]
fr: nom du fichier à modifier [par défaut: nouveau fichier]
ja: 編集するファイル名[デフォルト：新規ファイル]

source: Load a program from a file.
de: Lädt ein Programm aus einer Datei.
es: Cargue un programa desde un archivo.
fr: Chargez un programme à partir d'un fichier.
ja: ファイルからプログラムをロードします。

source: name of the BASIC program
de: Name des BASIC-Programms
es: nombre del programa BASIC
fr: nom du programme BASIC
ja: BASICプログラムの名前

source: font (encoding) used for UTF-8 conversion [`0` to `{NUM_FONTS_m1}`]
de: Schriftart (Codierung) für die UTF-8-Konvertierung [`0` in `{NUM_FONTS_m1} `]
es: fuente (codificación) utilizada para la conversión UTF-8 [`0` a `{NUM_FONTS_m1} `]
fr: police (encodage) utilisée pour la conversion UTF-8 [`0` en `{NUM_FONTS_m1}`]
ja: UTF-8変換に使用されるフォント（エンコーディング）[`0`から`{NUM_FONTS_m1}`]

source: Merge a program in a file with the program currently in memory.
de: Führt ein Programm in einer Datei mit dem aktuell im Speicher befindlichen Programm zusammen.
es: Fusionar un programa en un archivo con el programa actualmente en la memoria.
fr: Fusionner un programme dans un fichier avec le programme actuellement en mémoire.
ja: ファイル内のプログラムを現在メモリ内にあるプログラムとマージします。

source: name of the BASIC program to be merged
de: Name des zusammenzuführenden BASIC-Programms
es: nombre del programa BASIC que se fusionará
fr: nom du programme BASIC à fusionner
ja: マージするBASICプログラムの名前

source: line number at which to contine execution [default: first line]
de: Zeilennummer, an der die Ausführung fortgesetzt werden soll [Standard: erste Zeile]
es: número de línea en el que continuar la ejecución [predeterminado: primera línea]
fr: numéro de ligne auquel continuer l'exécution [par défaut: première ligne]
ja: 実行を継続する行番号[デフォルト：最初の行]

source: If called from within a program, `MERGE` will continue execution from line `line_num` after the merge (or the beginning of the program if `line_num` is not specified).
de: Wenn `MERGE` aus einem Programm heraus aufgerufen wird, setzt es die Ausführung von Zeile `line_num` nach dem Zusammenführen fort (oder vom Beginn des Programms, wenn `line_num` nicht angegeben ist).
es: Si se llama desde dentro de un programa, `MERGE` continuará la ejecución desde la línea` line_num` después de la fusión (o el comienzo del programa si no se especifica `line_num`).
fr: S'il est appelé depuis un programme, `MERGE` continuera l'exécution à partir de la ligne` line_num` après la fusion (ou au début du programme si `line_num` n'est pas spécifié).
ja: プログラム内から呼び出された場合、 `MERGE`は、マージ後（または、`line_num`が指定されていない場合はプログラムの開始）、行 `line_num`から実行を継続します。

source: When called from within a program, `MERGE` resets all variables. This probably limits its usefulness.
de: Beim Aufruf aus einem Programm setzt `MERGE` alle Variablen zurück. Dies schränkt wahrscheinlich seine Nützlichkeit ein.
es: Cuando se llama desde dentro de un programa, `MERGE` restablece todas las variables. Esto probablemente limita su utilidad.
fr: Lorsqu'il est appelé depuis un programme, `MERGE` réinitialise toutes les variables. Cela limite probablement son utilité.
ja: プログラム内から呼び出されると、 `MERGE`はすべての変数をリセットします。これはおそらくその有用性を制限します。

source: Loads a new program and runs it, keeping the current set of variables.
de: Lädt ein neues Programm und führt es aus, wobei der aktuelle Variablensatz beibehalten wird.
es: Carga un nuevo programa y lo ejecuta, manteniendo el conjunto actual de variables.
fr: Charge un nouveau programme et l'exécute, en conservant l'ensemble actuel de variables.
ja: 新しいプログラムをロードして実行し、現在の変数のセットを保持します。

source: name of the BASIC program to be executed
de: Name des auszuführenden BASIC-Programms
es: nombre del programa BASIC a ejecutar
fr: nom du programme BASIC à exécuter
ja: 実行するBASICプログラムの名前

source: Unlike `EXEC`, `CHAIN` does not allow returning to the original program.
de: Im Gegensatz zu `EXEC` erlaubt `CHAIN` nicht, zum ursprünglichen Programm zurückzukehren.
es: A diferencia de `EXEC`, `CHAIN` no permite volver al programa original.
fr: Contrairement à `EXEC`,` CHAIN` ne permet pas de revenir au programme d'origine.
ja: `EXEC`とは異なり、`CHAIN`は元のプログラムに戻ることを許可しません。

source: Returns a specified number of leftmost characters in a string.
de: Gibt eine bestimmte Anzahl von Zeichen ganz links in einem String zurück.
es: Devuelve un número especificado de caracteres situados más a la izquierda en una cadena.
fr: Renvoie un nombre spécifié de caractères les plus à gauche dans une chaîne.
ja: 文字列の左端の指定された数の文字を返します。

source: any string expression
de: beliebiger Stringausdruck
es: cualquier expresión de cadena
fr: toute expression de chaîne
ja: 任意の文字列式

source: number of characters to return [min `0`]
de: Anzahl der zurückzugebenden Zeichen [min `0`]
es: número de caracteres para devolver [min `0`]
fr: nombre de caractères à renvoyer [min `0`]
ja: 返す文字数[min`0`]

source: Substring of `num` characters or less.
de: Teilstring von `num`-Zeichen oder weniger.
es: Subcadena de caracteres `num` o menos.
fr: Sous-chaîne de caractères `num` ou moins.
ja: `num`文字以下の部分文字列。

source: If `l$` is shorter than `num` characters, the return value is `l$`.
de: Wenn `l$` kürzer als `num` ist, lautet der Rückgabewert `l$`.
es: Si `l$` es más corto que `num` caracteres, el valor de retorno es` l$ `.
fr: Si `l$` est plus court que les caractères `num`, la valeur de retour est `l$`.
ja: `l$`が`num`文字より短い場合、戻り値は`l$`です。

source: Returns a specified number of rightmost characters in a string.
de: Gibt eine bestimmte Anzahl von Zeichen ganz rechts in einem String zurück.
es: Devuelve un número especificado de caracteres situados más a la derecha en una cadena.
fr: Renvoie un nombre spécifié de caractères les plus à droite dans une chaîne.
ja: 文字列内の指定された数の右端の文字を返します。

source: If `r$` is shorter than `num` characters, the return value is `r$`.
de: Wenn `r$` kürzer als `num` ist, lautet der Rückgabewert `r$`.
es: Si `r$` es más corto que `num` caracteres, el valor de retorno es` r$ `.
fr: Si `r$` est plus court que `num` caractères, la valeur de retour est `r$`.
ja: `r$`が `num`文字より短い場合、戻り値は`r$`です。

source: Returns part of a string (a substring).
de: Gibt einen Teil eines Strings (einen Teilstring) zurück.
es: Devuelve parte de una cadena (una subcadena).
fr: Renvoie une partie d'une chaîne (une sous-chaîne).
ja: 文字列の一部（部分文字列）を返します。

source: position of the first character in the substring being returned
de: Position des ersten Zeichens in dem Teilstring, die zurückgegeben wird
es: posición del primer carácter en la subcadena que se devuelve
fr: position du premier caractère dans la sous-chaîne renvoyée
ja: 返される部分文字列の最初の文字の位置

source: number of characters in the substring [default: `LEN(m$)-start`]
de: Anzahl der Zeichen in dem Teilstring [Standard: `LEN(m$)-start`]
es: número de caracteres en la subcadena [predeterminado: `LEN(m$)- inicio`]
fr: nombre de caractères dans la sous-chaîne [par défaut: `LEN(m$)-start`]
ja: サブストリングの文字数[デフォルト： `LEN（m$)-start`]

source: Substring of `len` characters or less.
de: Teilstring von `len` Zeichen oder weniger.
es: Subcadena de caracteres `len` o menos.
fr: Sous-chaîne de caractères `len` ou moins.
ja: `len`文字以下の部分文字列。

source: * If `m$` is shorter than `len` characters, the return value is `m$`.
de: * Wenn `m$` kürzer als `len` Zeichen ist, ist der Rückgabewert` m$ `.
es: * Si `m$` es más corto que `len` caracteres, el valor de retorno es `m$`.
fr: * Si `m$` est plus court que les caractères `len`, la valeur de retour est `m$`.
ja: * `m$` が `len` 文字より短い場合、戻り値は `m$` となる。

source: * Unlike with other BASIC implementations, `start` is zero-based, i.e. the first character is 0, not 1.
de: * Im Gegensatz zu anderen BASIC-Implementierungen basiert `start` auf Null, dh das erste Zeichen ist 0 und nicht 1.
es: * A diferencia de otras implementaciones BASIC, `start` se basa en cero, es decir, el primer carácter es 0, no 1.
fr: * Contrairement aux autres implémentations BASIC, `start` est basé sur zéro, c'est-à-dire que le premier caractère est 0 et non 1.
ja: *他のBASIC実装とは異なり、 `start`はゼロベースです。つまり、最初の文字は1ではなく0です。

source: You cannot assign values to `MID$()`, which is possible in some other BASIC implementations.
de: Sie können `MID$()` keine Werte zuweisen, was in einigen anderen BASIC-Implementierungen möglich ist.
es: No puede asignar valores a `MID$()`, lo cual es posible en algunas otras implementaciones de BASIC.
fr: Vous ne pouvez pas attribuer de valeurs à `MID$()`, ce qui est possible dans certaines autres implémentations BASIC.
ja: `MID$()`に値を割り当てることはできません。これは、他の一部のBASIC実装で可能です。

source: Returns the character corresponding to a specified ASCII code.
de: Gibt das Zeichen zurück, das einem angegebenen ASCII-Code entspricht.
es: Devuelve el carácter correspondiente a un código ASCII especificado.
fr: Renvoie le caractère correspondant à un code ASCII spécifié.

source: Single-character string.
de: String, der aus einem Zeichen besteht.
es: Cadena de un solo carácter.
fr: Chaîne à un caractère.
ja: 1文字の文字列。

source: Returns a string representation of a number.
de: Gibt eine Stringdarstellung einer Zahl zurück.
es: Devuelve una representación de cadena de un número.
fr: Renvoie une représentation sous forme de chaîne d'un nombre.
ja: 数値の文字列表現を返します。

source: any numeric expression
de: ein beliebiger numerischer Ausdruck
es: cualquier expresión numérica
fr: toute expression numérique
ja: 任意の数値式

source: String representation of `num`.
de: String-Darstellung von `num`.
es: Representación de cadena de `num`.
fr: Représentation sous forme de chaîne de `num`.
ja: `num`の文字列表現。

source: Returns one of the string return values returned by the last function call.
de: Gibt einen der vom letzten Funktionsaufruf zurückgegebenen String-Rückgabewerte zurück.
es: Devuelve uno de los valores de retorno de la cadena devueltos por la última llamada de función.
fr: Renvoie l'une des valeurs de retour de chaîne renvoyées par le dernier appel de fonction.
ja: 最後の関数呼び出しによって返された文字列の戻り値の1つを返します。

source: number of the string return value [`0` to `{MAX_RETVALS_m1}`]
de: Nummer des String-Rückgabewerts [`0` bis `{MAX_RETVALS_m1} `]
es: Número del valor de retorno de cadena [`0` a `{MAX_RETVALS_m1}`]
fr: numéro de la valeur de retour de chaîne [`0` à `{MAX_RETVALS_m1}`]
ja: 文字列の戻り値の数[`0`から`{MAX_RETVALS_m1}`]

source: String return value requested.
de: String-Rückgabewert angefordert.
es: Valor de retorno de cadena solicitado.
fr: Valeur de retour de chaîne demandée.
ja: 要求された文字列戻り値

source: Returns the error message associated with a given error number.
de: Gibt die Fehlermeldung zurück, die einer bestimmten Fehlernummer zugeordnet ist.
es: Devuelve el mensaje de error asociado con un número de error dado.
fr: Renvoie le message d'erreur associé à un numéro d'erreur donné.
ja: 指定されたエラー番号に関連付けられたエラーメッセージを返します。

source: error number [`0` to `{max_err}`]
de: Fehlernummer [`0` bis `{max_err} `]
es: número de error [`0` a `{max_err} `]
fr: numéro d'erreur [`0` à `{max_err}`]
ja: エラー番号[`0`から`{max_err}`]

source: Error message.
de: Fehlermeldung.
es: Mensaje de error.
fr: Message d'erreur.
ja: エラーメッセージ。

source: Returns a string of a specified length made up of a repeating character.
de: Gibt einen String mit einer bestimmten Länge zurück, die aus einem sich wiederholenden Zeichen besteht.
es: Devuelve una cadena de una longitud especificada formada por un carácter repetido.
fr: Renvoie une chaîne d'une longueur spécifiée composée d'un caractère répétitif.
ja: 繰り返し文字で構成される指定された長さの文字列を返します。

source: number of characters [at least `0`]
de: Anzahl der Zeichen [mindestens `0`]
es: número de caracteres [al menos `0`]
fr: nombre de caractères [au moins `0`]
ja: 文字数[少なくとも `0`]

source: any non-empty string expression
de: Beliebiger nicht leerer Stringausdruck
es: cualquier expresión de cadena no vacía
fr: toute expression de chaîne non vide
ja: 空でない文字列式

source: * If `char$` contains more than one character, only the first will be considered.
de: * Wenn `char$` mehr als ein Zeichen enthält, wird nur das erste berücksichtigt.
es: * Si 'char$' contiene más de un carácter, solo se considerará el primero.
fr: * Si `char$` contient plus d'un caractère, seul le premier sera considéré.
ja: * `char$`に複数の文字が含まれている場合、最初の文字のみが考慮されます。

source: * If `count` is `0`, an empty string will be returned.
de: * Wenn `count` `0` ist, wird ein leerer String zurückgegeben.
es: * Si `count` es `0`, se devolverá una cadena vacía.
fr: * Si `count` vaut `0`, une chaîne vide sera renvoyée.
ja: * `count`が`0`の場合、空の文字列が返されます。

source: String concatenation operator.
de: String-Verkettungsoperator.
es: Operador de concatenación de cadenas.
fr: Opérateur de concaténation de chaîne.
ja: 文字列連結演算子。

source: Concatenation of `a$` and `b$`.
de: Verkettung von `a$` und `b$`.
es: Concatenación de `a$` y `b$`.
fr: Concaténation de `a$` et `b$`.
ja: `a$`と `b$`の連結。

source: Returns the number of characters in a string or the number of elements in a list.
de: Gibt die Anzahl der Zeichen in einem String oder die Anzahl der Elemente in einer Liste zurück.
es: Devuelve el número de caracteres en una cadena o el número de elementos en una lista.
fr: Renvoie le nombre de caractères dans une chaîne ou le nombre d'éléments dans une liste.
ja: 文字列の文字数またはリストの要素数を返します。

source: reference to a numeric or string list
de: Verweis auf eine numerische oder Stringliste
es: referencia a una lista numérica o de cadenas
fr: référence à une liste numérique ou chaîne
ja: 数値リストまたは文字列リストへの参照
