Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: Slightly smaller than mode 1; helpful if the display does not show the entirety of mode 1.
de: Etwas kleiner als Modus 1; hilfreich, wenn auf dem Display nicht der gesamte Modus 1 angezeigt wird.
es: Ligeramente más pequeño que el modo 1; útil si la pantalla no muestra la totalidad del modo 1.
fr: Légèrement plus petit que le mode 1; utile si l'écran n'affiche pas l'intégralité du mode 1.
ja: モード1よりわずかに小さい。ディスプレイにモード1全体が表示されない場合に役立ちます。

source: Common resolution on many home computer systems.
de: Häufige Auflösung auf vielen Heimcomputersystemen.
es: Resolución común en muchos sistemas informáticos domésticos.
fr: Résolution commune sur de nombreux systèmes informatiques domestiques.
ja: 多くの家庭用コンピュータシステムでの一般的な解像度。

source: Compatible with the SNES system.
de: Kompatibel mit dem SNES-System.
es: Compatible con el sistema SNES.
fr: Compatible avec le système SNES.
ja: SNESシステムと互換性があります。

source: Common resolution used by MSX, ZX Spectrum and others.
de: Gemeinsame Auflösung, die von MSX, ZX Spectrum und anderen verwendet wird.
es: Resolución común utilizada por MSX, ZX Spectrum y otros.
fr: Résolution commune utilisée par MSX, ZX Spectrum et autres.
ja: MSX、ZXSpectrumなどで使用される一般的な解像度。

source: Common low-resolution mode on several home computer systems.
de: Allgemeiner Modus mit niedriger Auflösung auf mehreren Heimcomputersystemen.
es: Modo común de baja resolución en varios sistemas informáticos domésticos.
fr: Mode basse résolution commun sur plusieurs systèmes informatiques domestiques.
ja: いくつかの家庭用コンピュータシステムで一般的な低解像度モード。

source: PC Engine-compatible overscan mode
de: PC Engine-kompatibler Overscan-Modus
es: Modo de sobreexploración compatible con PC Engine
fr: Mode de surbalayage compatible avec PC Engine
ja: PCエンジン互換のオーバースキャンモード

source: Maximum usable resolution in PAL mode. (Overscan on NTSC systems.)
de: Maximal verwendbare Auflösung im PAL-Modus. (Overscan auf NTSC-Systemen.)
es: Resolución máxima utilizable en modo PAL. (Overscan en sistemas NTSC).
fr: Résolution maximale utilisable en mode PAL. (Surbalayage sur les systèmes NTSC.)
ja: PALモードで使用可能な最大解像度。（NTSCシステムでのオーバースキャン。）

source: * While the resolutions are the same for NTSC and PAL configurations, the actual sizes and aspect ratios vary depending on the TV system.
de: * Während die Auflösungen für NTSC- und PAL-Konfigurationen gleich sind, variieren die tatsächlichen Größen und Seitenverhältnisse je nach TV-System.
es: * Si bien las resoluciones son las mismas para las configuraciones NTSC y PAL, los tamaños reales y las relaciones de aspecto varían según el sistema de TV.
fr: * Bien que les résolutions soient les mêmes pour les configurations NTSC et PAL, les tailles et les rapports d'aspect réels varient en fonction du système de télévision.
ja: *解像度はNTSCとPALの構成で同じですが、実際のサイズとアスペクト比はTVシステムによって異なります。

source: * Resolutions have been chosen to match those used in other systems to facilitate porting of existing programs.
de: * Es wurden Auflösungen ausgewählt, die denen anderer Systeme entsprechen, um die Portierung vorhandener Programme zu erleichtern.
es: * Se han elegido resoluciones que coincidan con las utilizadas en otros sistemas para facilitar la adaptación de programas existentes.
fr: * Les résolutions ont été choisies pour correspondre à celles utilisées dans d'autres systèmes pour faciliter le portage des programmes existants.
ja: *解像度は、既存のプログラムの移植を容易にするために、他のシステムで使用されているものと一致するように選択されています。

source: Sets the color space ("palette") for the current screen mode, as well as coefficients for the color conversion function `RGB()`.
de: Legt den Farbraum ("Palette") für den aktuellen Bildschirmmodus sowie die Koeffizienten für die Farbkonvertierungsfunktion `RGB()` fest.
es: Establece el espacio de color ("paleta") para el modo de pantalla actual, así como los coeficientes para la función de conversión de color `RGB()`.
fr: Définit l'espace colorimétrique ("palette") pour le mode d'écran actuel, ainsi que les coefficients pour la fonction de conversion des couleurs `RVB ()`.
ja: 現在の画面モードの色空間（「パレット」）と、色変換関数 `RGB()`の係数を設定します。

source: colorspace number [`0` or `1`]
de: Farbraumnummer [`0` oder `1`]
es: número de espacio de color [`0` o `1`]
fr: numéro d'espace colorimétrique [`0` ou `1`]
ja: 色空間番号[`0`または`1`]

source: hue weight for color conversion [`0` to `7`]
de: Farbtongewicht für die Farbkonvertierung [`0` bis `7`]
es: peso de tono para conversión de color [`0` a `7`]
fr: poids de la teinte pour la conversion des couleurs [`0` en `7`]
ja: 色変換の色相の重み[`0`から`7`]

source: saturation weight for color conversion [`0` to `7`]
de: Sättigungsgewicht für die Farbkonvertierung [`0` bis `7`]
es: peso de saturación para la conversión de color [`0` a `7`]
fr: poids de saturation pour la conversion des couleurs [`0` en `7`]
ja: 色変換の彩度の重み[`0`から`7`]

source: value weight for color conversion [`0` to `7`]
de: Wertgewicht für die Farbkonvertierung [`0` bis `7`]
es: peso del valor para la conversión de color [`0` a `7`]
fr: poids de la valeur pour la conversion des couleurs [`0` en `7`]
ja: 色変換の値の重み[`0`から`7`]

source: conversion fix-ups enabled [`0` or `1`]
de: Konvertierungskorrekturen aktiviert [`0` oder `1`]
es: correcciones de conversión habilitadas [`0` o `1`]
fr: corrections de conversion activées [`0` ou `1`]
ja: コンバージョンフィクスアップ有効 [`0` または `1` ]。

source: The default component weights depend on the color space. They are:
de: Die Standardkomponentengewichte hängen vom Farbraum ab. Sie sind:
es: Los pesos de los componentes predeterminados dependen del espacio de color. Ellos son:
fr: Les poids des composants par défaut dépendent de l'espace colorimétrique. Elles sont:
ja: デフォルトのコンポーネントの重みは、色空間によって異なります。彼らです：

source: Color space
de: Farbraum
es: Espacio de color
fr: Espace colorimétrique
ja: 色空間

source: Conversion fix-ups are enabled by default.
de: Konvertierungskorrekturen sind standardmäßig aktiviert.
es: Las correcciones de conversión están habilitadas de forma predeterminada.
fr: Les correctifs de conversion sont activés par défaut.
ja: 変換の修正はデフォルトで有効になっています。

source: Sets the color of the screen border.
de: Legt die Farbe des Bildschirmrahmens fest.
es: Establece el color del borde de la pantalla.
fr: Définit la couleur de la bordure de l'écran.
ja: 画面の境界線の色を設定します。

source: The color can be set individually for each screen column.
de: Die Farbe kann für jede Bildschirmspalte individuell eingestellt werden.
es: El color se puede configurar individualmente para cada columna de la pantalla.
fr: La couleur peut être définie individuellement pour chaque colonne d'écran.
ja: 画面列ごとに個別に色を設定できます。

source: UV component of the border color [`0` to `255`]
de: UV-Komponente der Randfarbe [`0` bis `255`]
es: Componente UV del color del borde [`0` a `255`]
fr: Composante UV de la couleur de la bordure [`0` à `255`]
ja: ボーダーカラーのUV成分[`0`〜`255`]

source: Y component of the border color [`0` to `255`]
de: Y-Komponente der Rahmenfarbe [`0` bis `255`]
es: Componente Y del color del borde [`0` a `255`]
fr: Composante Y de la couleur de la bordure [`0` à `255`]
ja: ボーダーカラーのY成分[`0`〜`255`]

source: first column to set [default: `0`]
de: erste zu setzende Spalte [Standard: `0`]
es: primera columna para establecer [predeterminado: `0`]
fr: première colonne à définir [par défaut: `0`]
ja: 設定する最初の列[デフォルト： `0`]

source: number of columns to set [default: all]
de: Anzahl der einzustellenden Spalten [Standard: alle]
es: número de columnas para configurar [predeterminado: todas]
fr: nombre de colonnes à définir [par défaut: toutes]
ja: 設定する列数[デフォルト：すべて]

source: There is no direct correspondence between border and screen color values.
de: Es gibt keine direkte Entsprechung zwischen Rand- und Bildschirmfarbwerten.
es: No existe una correspondencia directa entre los valores de color del borde y de la pantalla.
fr: Il n'y a pas de correspondance directe entre les valeurs de couleur de la bordure et de l'écran.
ja: 境界線と画面の色の値は直接対応していません。

source: There is no way to find the allowed range of values for `x` and `w` without trial and error.
de: Es gibt keine Möglichkeit, den zulässigen Wertebereich für `x` und `w` ohne Versuch und Irrtum zu finden.
es: No hay forma de encontrar el rango permitido de valores para `x` y `w` sin prueba y error.
fr: Il n'y a aucun moyen de trouver la plage de valeurs autorisée pour `x` et `w` sans essais et erreurs.
ja: 試行錯誤せずに`x`と`w`の許容値の範囲を見つける方法はありません。

source: Synchronize with video output.
de: Mit Videoausgabe synchronisieren.
es: Sincronice con la salida de video.
fr: Synchroniser avec la sortie vidéo.
ja: ビデオ出力と同期します。

source: Waits until the video frame counter has reached or exceeded a given value, or until the next frame if none is specified.
de: Wartet, bis der Video-Frame-Zähler einen bestimmten Wert erreicht oder überschritten hat, oder bis zum nächsten Frame, wenn keiner angegeben ist.
es: Espera hasta que el contador de fotogramas de vídeo haya alcanzado o superado un valor determinado, o hasta el siguiente fotograma si no se especifica ninguno.
fr: Attend jusqu'à ce que le compteur d'images vidéo ait atteint ou dépassé une valeur donnée, ou jusqu'à l'image suivante si aucune n'est spécifiée.
ja: ビデオフレームカウンタが指定された値に達するか超えるまで、または何も指定されていない場合は次のフレームまで待機します。

source: frame number to be waited for
de: Bildnummer, auf die gewartet werden soll
es: número de fotograma a esperar
fr: numéro de la trame à attendre
ja: 待機するフレーム番号

source: Writes to a video controller register.
de: Schreibt in ein Video-Controller-Register.
es: Escribe en un registro de controlador de video.
fr: Écrit dans un registre de contrôleur vidéo.
ja: ビデオコントローラレジスタに書き込みます。

source: WARNING: Incorrect use of this command can configure the video controller to produce invalid output, with may cause damage to older CRT displays.
de: WARNUNG: Durch falsche Verwendung dieses Befehls kann der Videocontroller so konfiguriert werden, dass er eine ungültige Ausgabe erzeugt. Dies kann zu Schäden an älteren CRT-Anzeigen führen.
es: ADVERTENCIA: El uso incorrecto de este comando puede configurar el controlador de video para producir una salida no válida, lo que puede dañar las pantallas CRT más antiguas.
fr: AVERTISSEMENT: une utilisation incorrecte de cette commande peut configurer le contrôleur vidéo pour produire une sortie non valide, ce qui peut endommager les anciens écrans CRT.
ja: 警告：このコマンドを誤って使用すると、ビデオコントローラが無効な出力を生成するように設定され、古いCRTディスプレイが損傷する可能性があります。

source: video controller register number
de: Videocontroller-Registernummer
es: número de registro del controlador de video
fr: numéro de registre du contrôleur vidéo
ja: ビデオコントローラレジスタ番号

source: value [`0` to `65535`]
de: Wert [`0` bis `65535`]
es: valor [`0` a `65535`]
fr: valeur [`0` à `65535`]
ja: 値[`0`から`65535`]

source: Valid registers numbers are: `$01`, `$28` to `$30`, `$34` to `$36`, `$82` and `$B8`
de: Gültige Registernummern sind: $ 01, $ 28 bis $ 30, $ 34 bis $ 36, $ 82 und $ B8
es: Los números de registros válidos son: `$01`, `$28` a `$30`, `$34` a `$36`, `$82` y `$B8`
fr: Les numéros de registres valides sont : `$01`, `$28` à `$30`, `$34` à `$36`, `$82` et `$B8`
ja: 有効なレジスタ番号: `$01`、`$28` から `$30`、`$34` から `$36`、`$82`、`$B8`

source: The number of values required depends on the register accessed:
de: Die Anzahl der erforderlichen Werte hängt vom Register ab, auf das zugegriffen wird:
es: El número de valores requeridos depende del registro al que se acceda:
fr: Le nombre de valeurs requises dépend du registre accédé:
ja: 必要な値の数は、アクセスするレジスタによって異なります。

source: 3 values
de: 3 Werte
es: 3 valores
fr: 3 valeurs
ja: 3つの値

source: no value
de: kein Wert
es: sin valor
fr: aucune valeur
ja: 値なし

source: 2 values
de: 2 Werte
es: 2 valores
fr: 2 valeurs
ja: 2つの値

source: all others
de: alle anderen
es: todos los otros
fr: tous les autres
ja: 他のすべて

source: 1 value
de: 1 Wert
es: 1 valor
fr: 1 valeur
ja: 1つの値

source: Returns the number of video frames since power-on.
de: Gibt die Anzahl der Videobilder seit dem Einschalten zurück.
es: Devuelve el número de fotogramas de vídeo desde el encendido.
fr: Renvoie le nombre d'images vidéo depuis la mise sous tension.
ja: 電源投入後のビデオフレーム数を返します。

source: Frame count.
de: Frame-Anzahl.
es: Recuento de fotogramas.
fr: Nombre d'images.
ja: フレーム数。

source: Read a video controller register.
de: Liest ein Video-Controller-Register.
es: Leer un registro de controlador de video.
fr: Lisez un registre de contrôleur vidéo.
ja: ビデオコントローラレジスタを読み取ります。

source: Read a location in video memory.
de: Liest einen Ort im Videospeicher.
es: Leer una ubicación en la memoria de video.
fr: Lire un emplacement dans la mémoire vidéo.
ja: ビデオメモリ内の場所を読み取ります。

source: Byte address in video memory. [`0` to `131071`]
de: Byteadresse im Videospeicher. [`0` bis `131071`]
es: Dirección de bytes en la memoria de video. [`0` a `131071`]
fr: Adresse d'octet dans la mémoire vidéo. [`0` à `131071`]
ja: ビデオメモリのバイトアドレス。[`0`から`131071`]

source: Memory content.
de: Speicherinhalt.
es: Contenido de memoria.
fr: Contenu de la mémoire.
ja: メモリコンテンツ。

source: Write data to video memory.
de: Schreibt Daten in den Videospeicher.
es: Escribe datos en la memoria de video.
fr: Ecrivez des données dans la mémoire vidéo.
ja: ビデオメモリにデータを書き込みます。

source: video memory address [`0` to `131071`]
de: Videospeicheradresse [`0` bis `131071`]
es: dirección de memoria de video [`0` a `131071`]
fr: adresse de la mémoire vidéo [`0` à `131071`]
ja: ビデオメモリアドレス[`0`から`131071`]

source: numeric value [`0` to `255`] or string expression
de: numerischer Wert [`0` bis `255`] oder Stringausdruck
es: valor numérico [`0` a `255`] o expresión de cadena
fr: valeur numérique [`0` à `255`] ou expression de chaîne
ja: 数値[`0`〜`255`]または文字列式

source: Moves the text cursor to the specified position.
de: Bewegt den Textcursor an die angegebene Position.
es: Mueve el cursor de texto a la posición especificada.
fr: Déplace le curseur de texte à la position spécifiée.
ja: テキストカーソルを指定した位置に移動します。

source: cursor X coordinate [`0` to `CSIZE(0)-1`]
de: Cursor-X-Koordinate [`0` bis `CSIZE(0)-1`]
es: Coordenada X del cursor [`0` a `CSIZE(0)-1`]
fr: Coordonnée X du curseur [`0` à `CSIZE(0)-1`]
ja: カーソルX座標[`0`から`CSIZE(0)-1`]

source: cursor Y coordinate [`0` to `CSIZE(1)-1`]
de: Cursor-Y-Koordinate [`0` bis `CSIZE(1)-1`]
es: Coordenada Y del cursor [`0` a `CSIZE(1)-1`]
fr: coordonnée Y du curseur [`0` à `CSIZE(1)-1`]
ja: カーソルY座標[`0`から`CSIZE(1)-1`]

source: RGB() can be used to calculate hardware color values from the more easily understood RGB format, and can also help with programs that need to work with different color palettes.
de: RGB() kann verwendet werden, um Hardware-Farbwerte aus dem besser verständlichen RGB-Format zu berechnen, und kann auch bei Programmen hilfreich sein, die mit verschiedenen Farbpaletten arbeiten müssen.
es: RGB() se puede utilizar para calcular valores de color de hardware a partir del formato RGB más fácil de entender y también puede ayudar con los programas que necesitan trabajar con diferentes paletas de colores.
fr: RGB() peut être utilisé pour calculer les valeurs de couleur matérielles à partir du format RVB plus facile à comprendre, et peut également aider avec les programmes qui doivent travailler avec différentes palettes de couleurs.
ja: RGB()は、より理解しやすいRGB形式からハードウェアの色の値を計算するために使用できます。また、さまざまなカラーパレットを操作する必要があるプログラムにも役立ちます。

source: YUV color value
de: YUV-Farbwert
es: Valor de color YUV
fr: Valeur de couleur YUV
ja: YUVカラー値

source: The color conversion method used is optimized for use with pixel art. Its results can be tweaked by setting conversion coefficients with the `PALETTE` command.
de: Die verwendete Farbkonvertierungsmethode ist für die Verwendung mit Pixelkunst optimiert. Die Ergebnisse können durch Einstellen der Umrechnungskoeffizienten mit dem Befehl `PALETTE` optimiert werden.
es: El método de conversión de color utilizado está optimizado para su uso con pixel art. Sus resultados se pueden modificar estableciendo coeficientes de conversión con el comando `PALETTE`.
fr: La méthode de conversion des couleurs utilisée est optimisée pour une utilisation avec le pixel art. Ses résultats peuvent être modifiés en définissant des coefficients de conversion avec la commande `PALETTE`.
ja: 使用される色変換方法は、ピクセルアートでの使用に最適化されています。その結果は、 `PALETTE`コマンドで変換係数を設定することで微調整できます。

source: Changes the foreground and background color for text output.
de: Ändert die Vordergrund- und Hintergrundfarbe für die Textausgabe.
es: Cambia el color de primer plano y de fondo para la salida de texto.
fr: Modifie la couleur de premier plan et d'arrière-plan de la sortie de texte.
ja: テキスト出力の前景色と背景色を変更します。

source: foreground color [range depends on color space]
de: Vordergrundfarbe [Bereich hängt vom Farbraum ab]
es: color de primer plano [el rango depende del espacio de color]
fr: couleur de premier plan [la plage dépend de l'espace colorimétrique]
ja: 前景色[範囲は色空間によって異なります]

source: background color [range depends on color space, default: `0`]
de: Hintergrundfarbe [Bereich hängt vom Farbraum ab, Standard: `0`]
es: color de fondo [el rango depende del espacio de color, predeterminado: `0`]
fr: couleur d'arrière-plan [la plage dépend de l'espace colorimétrique, par défaut: `0`]
ja: 背景色[範囲は色空間によって異なります。デフォルト： `0`]

source: cursor color [range depends on color space]
de: Cursorfarbe [Bereich hängt vom Farbraum ab]
es: color del cursor [el rango depende del espacio de color]
fr: couleur du curseur [la plage dépend de l'espace colorimétrique]
ja: カーソルの色[範囲は色空間によって異なります]

source: Returns the dimensions of the current screen mode in text characters.
de: Gibt die Abmessungen des aktuellen Bildschirmmodus in Textzeichen zurück.
es: Devuelve las dimensiones del modo de pantalla actual en caracteres de texto.
fr: Renvoie les dimensions du mode d'écran actuel en caractères de texte.
ja: 現在の画面モードのサイズをテキスト文字で返します。

source: requested screen dimension: `0`: text screen width `1`: text screen height
de: Angeforderte Bildschirmgröße: `0`: Textbildschirmbreite `1`: Textbildschirmhöhe
es: dimensión de pantalla solicitada: `0`: ancho de la pantalla de texto `1`: altura de la pantalla de texto
fr: dimension d'écran demandée: `0`: largeur de l'écran de texte `1`: hauteur de l'écran de texte
ja: 要求された画面のサイズ： `0`：テキスト画面の幅`1`：テキスト画面の高さ

source: Size in characters.
de: Größe in Zeichen.
es: Tamaño en caracteres.
fr: Taille en caractères.
ja: 文字単位のサイズ。

source: Returns the dimensions of the current screen mode in pixels.
de: Gibt die Abmessungen des aktuellen Bildschirmmodus in Pixel zurück.
es: Devuelve las dimensiones del modo de pantalla actual en píxeles.
fr: Renvoie les dimensions du mode d'écran actuel en pixels.
ja: 現在の画面モードのサイズをピクセル単位で返します。

source: requested screen dimension: `0`: screen width `1`: visible screen height `2`: total screen height
de: angeforderte Bildschirmabmessung: `0`: Bildschirmbreite `1`: sichtbare Bildschirmhöhe `2`: Gesamtbildschirmhöhe
es: dimensión de pantalla solicitada: `0`: ancho de la pantalla `1`: altura de la pantalla visible `2`: altura total de la pantalla
fr: dimension d'écran demandée: `0`: largeur de l'écran `1`: hauteur de l'écran visible `2`: hauteur totale de l'écran
ja: 要求された画面のサイズ： `0`：画面の幅`1`：表示される画面の高さ `2`：画面の全高

source: Size in pixels.
de: Größe in Pixel.
es: Tamaño en píxeles.
fr: Taille en pixels.
ja: ピクセル単位のサイズ。

source: Returns the text cursor position.
de: Gibt die Position des Textcursors zurück.
es: Devuelve la posición del cursor de texto.
fr: Renvoie la position du curseur de texte.
ja: テキストカーソルの位置を返します。

source: requested axis: `0`: horizontal `1`: vertical
de: angeforderte Achse: `0`: horizontal `1`: vertikal
es: eje solicitado: `0`: horizontal `1`: vertical
fr: axe demandé: `0`: horizontal `1`: vertical
ja: 要求された軸： `0`：水平`1`：垂直

source: Position in characters.
de: Position in Zeichen.
es: Posición en caracteres.
fr: Position en caractères.
ja: 文字での位置。

source: Returns the text character on screen at a given position.
de: Gibt das Textzeichen auf dem Bildschirm an einer bestimmten Position zurück.
es: Devuelve el carácter de texto en la pantalla en una posción determinada.
fr: Renvoie le caractère de texte à l'écran à une position donnée.
ja: 画面上の指定された位置にあるテキスト文字を返します。

source: X coordinate, characters
de: X-Koordinate, Zeichen
es: Coordenada X, caracteres
fr: Coordonnée X, caractères
ja: X座標、文字

source: Y coordinate, characters
de: Y-Koordinate, Zeichen
es: Coordenada Y, caracteres
fr: Coordonnée Y, caractères
ja: Y座標、文字

source: Character code.
de: Zeichencode.
es: Código de carácter.
fr: Code de caractère.
ja: 文字コード。

source: * If the coordinates exceed the dimensions of the text screen, `0` will be returned.
de: * Wenn die Koordinaten die Abmessungen des Textbildschirms überschreiten, wird `0` zurückgegeben.
es: * Si las coordenadas exceden las dimensiones de la pantalla de texto, se devolverá "0".
fr: * Si les coordonnées dépassent les dimensions de l'écran de texte, `0` sera renvoyé.
ja: ※座標がテキスト画面の大きさを超える場合は`0`を返します。

source: * The value returned represents the current character in text screen memory. It may not represent what is actually visible on screen if it has been manipulated using pixel graphics functions, such as `GPRINT`.
de: * Der zurückgegebene Wert stellt das aktuelle Zeichen im Textbildschirm dar.Es ist möglicherweise nicht dargestellt, was auf dem Bildschirm tatsächlich sichtbar ist, wenn er mit der Verwendung von Pixel-Grafikfunktionen, z. B. `GPRINT` bearbeitet wurde.
es: * El valor devuelto representa el carácter actual en la memoria de la pantalla de texto. Es posible que no represente lo que realmente se ve en la pantalla si se ha manipulado utilizando funciones de gráficos de píxeles, como `GPRINT`.
fr: * La valeur renvoyée représente le caractère actuel dans la mémoire de l'écran de texte. Il peut ne pas représenter ce qui est réellement visible à l'écran s'il a été manipulé à l'aide de fonctions graphiques en pixels, telles que `GPRINT`.
ja: *返される値は、テキスト画面メモリ内の現在の文字を表します。`GPRINT`などのピクセルグラフィックス関数を使用して操作された場合、画面に実際に表示されるものを表していない可能性があります。

source: Prints a single character to the screen.
de: Druckt ein einzelnes Zeichen auf dem Bildschirm.
es: Imprime un solo carácter en la pantalla.
fr: Imprime un seul caractère à l'écran.
ja: 画面に1文字を印刷します。

source: X coordinate, characters [`0` to `CSIZE(0)`]
de: X-Koordinate, Zeichen [`0` bis `CSIZE(0) `]
es: Coordenada X, caracteres [`0` a `CSIZE(0) `]
fr: Coordonnée X, caractères [`0` à `CSIZE(0)`]
ja: X座標、文字[`0`から`CSIZE(0） `]

source: Y coordinate, characters [`0` to `CSIZE(1)`]
de: Y-Koordinate, Zeichen [`0` bis `CSIZE(1) `]
es: Coordenada Y, caracteres [`0` a `CSIZE(1) `]
fr: Coordonnée Y, caractères [`0` à `CSIZE(1)`]
ja: Y座標、文字[`0`から`CSIZE(1） `]

source: character [`0` to `255`]
de: Zeichen [`0` bis `255`]
es: carácter [`0` a `255`]
fr: caractère [`0` à `255`]
ja: 文字[`0`から`255`]

source: This command does nothing if the coordinates are outside the screen limits.
de: Dieser Befehl führt nichts aus, wenn die Koordinaten außerhalb der Bildschirmgrenzen liegen.
es: Este comando no hace nada si las coordenadas están fuera de los límites de la pantalla.
fr: Cette commande ne fait rien si les coordonnées sont en dehors des limites de l'écran.
ja: 座標が画面の制限外にある場合、このコマンドは何もしません。

source: Scrolls the text screen contents in the given direction.
de: Scrollt den Inhalt des Textbildschirms in die angegebene Richtg.
es: Desplaza el contenido de la pantalla de texto en la dirección indicada.
fr: Fait défiler le contenu de l'écran de texte dans la direction donnée.
ja: テキスト画面の内容を指定された方向にスクロールします。

source: start of the screen region, X coordinate, characters [`0` to `CSIZE(0)-1`]
de: Beginn des Bildschirmbereichs, X-Koordinate, Zeichen [`0` bis` CSIZE(0) -1`]
es: inicio de la región de la pantalla, coordenada X, caracteres [`0` a `CSIZE (0)-1`]
fr: début de la zone d'écran, coordonnée X, caractères [`0` à `CSIZE(0)-1`]
ja: 画面領域の開始、X座標、文字[`0`から`CSIZE(0)-1`]
