Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: WARNING: This command will erase any files stored on the formatted file system, including system files and the saved configuration, if any.
de: WARNUNG: Mit diesem Befehl werden alle im formatierten Dateisystem gespeicherten Dateien gelöscht, einschließlich der Systemdateien und der gespeicherten Konfiguration, falls vorhanden.
es: ADVERTENCIA: Este comando borrará todos los archivos almacenados en el sistema de archivos formateado, incluidos los archivos del sistema y la configuración guardada, si corresponde.
fr: AVERTISSEMENT: cette commande effacera tous les fichiers stockés sur le système de fichiers formaté, y compris les fichiers système et la configuration enregistrée, le cas échéant.
ja: 警告：このコマンドは、システムファイルや保存された構成（存在する場合）など、フォーマットされたファイルシステムに保存されているすべてのファイルを消去します。

source: IMPORTANT: Formatting the SD card file system does not currently work.
de: WICHTIG: Das Formatieren des SD-Kartendateisystems funktioniert derzeit nicht.
es: IMPORTANTE: el formateo del sistema de archivos de la tarjeta SD no funciona actualmente.
fr: IMPORTANT: le formatage du système de fichiers de la carte SD ne fonctionne pas actuellement.
ja: 重要：現在、SDカードファイルシステムのフォーマットは機能しません。

source: SD card formatting is currently broken; use another device to format SD cards for use with the BASIC Engine.
de: Die Formatierung der SD-Karte ist derzeit fehlerhaft. Verwenden Sie ein anderes Gerät, um SD-Karten für die Verwendung mit der BASIC Engine zu formatieren.
es: El formateo de la tarjeta SD no funciona actualmente; utilice otro dispositivo para formatear tarjetas SD para su uso con el motor BASIC.
fr: Le formatage de la carte SD est actuellement cassé; utilisez un autre appareil pour formater les cartes SD à utiliser avec le moteur BASIC.
ja: SDカードのフォーマットは現在壊れています。別のデバイスを使用して、BASICエンジンで使用するSDカードをフォーマットします。

source: Returns dimensions and component count of an image file.
de: Gibt die Abmessungen und die Anzahl der Komponenten einer Bilddatei zurück.
es: Devuelve las dimensiones y el recuento de componentes de un archivo de imagen.
fr: Renvoie les dimensions et le nombre de composants d'un fichier image.
ja: 画像ファイルのサイズとコンポーネント数を返します。

source: Returns the width in pixels in `RET(0)`, the height in `RET(1)` and the number of components in `RET(2)`.
de: Gibt die Breite in Pixel in `RET(0)`, die Höhe in `RET(1)` und die Anzahl der Komponenten in `RET(2)` zurück.
es: Devuelve el ancho en píxeles en `RET(0)`, la altura en `RET(1)` y el número de componentes en `RET(2)`.
fr: Renvoie la largeur en pixels dans `RET(0)`, la hauteur dans `RET(1)` et le nombre de composants dans `RET(2)`.
ja: 幅をピクセル単位で `RET(0)`に、高さを `RET(1)`に、コンポーネントの数を `RET(2)`に返します。

source: This command does not work with PCX files.
de: Dieser Befehl funktioniert nicht mit PCX-Dateien.
es: Este comando no funciona con archivos PCX.
fr: Cette commande ne fonctionne pas avec les fichiers PCX.
ja: このコマンドはPCXファイルでは機能しません。

source: Get the state of the game controller(s) and cursor pad.
de: Holt sich den Status der Gamecontroller und des Cursor-Pads.
es: Obtenga el estado de los dispositivos de juego y el teclado del cursor.
fr: Obtenez l'état du (des) contrôleur (s) de jeu et du curseur.
ja: ゲームコントローラとカーソルパッドの状態を取得します。

source: `PAD()` can be used to query actual game controllers, or a "virtual" controller simulated with cursor and letter keys on the keyboard.
de: `PAD()` kann verwendet werden, um tatsächliche Gamecontroller oder einen "virtuellen" Controller abzufragen, der mit Cursor- und Buchstabentasten auf der Tastatur simuliert wird.
es: `PAD()` se puede usar para consultar controladores de juegos reales, o un controlador "virtual" simulado con teclas de cursor y letras en el teclado.
fr: `PAD()` peut être utilisé pour interroger des contrôleurs de jeu réels, ou un contrôleur "virtuel" simulé avec des touches de curseur et de lettre sur le clavier.
ja: `PAD()`を使用して、実際のゲームコントローラー、またはキーボードのカーソルキーと文字キーでシミュレートされた「仮想」コントローラーを照会できます。

source: The special controller number `0` returns the combined state of all (real and virtual) controllers, making it easier to write programs that work with and without a game controller.
de: Die spezielle Controller-Nummer `0` gibt den kombinierten Status aller (realen und virtuellen) Controller zurück und erleichtert so das Schreiben von Programmen, die mit und ohne Gamecontroller funktionieren.
es: El número de controlador especial "0" devuelve el estado combinado de todos los controladores (reales y virtuales), lo que facilita la escritura de programas que funcionen con y sin un controlador de juego.
fr: Le numéro de contrôleur spécial `0` renvoie l'état combiné de tous les contrôleurs (réels et virtuels), ce qui facilite l'écriture de programmes qui fonctionnent avec et sans contrôleur de jeu.
ja: 特別なコントローラー番号 `0`は、すべての（実数と仮想）コントローラーの結合状態を返し、ゲームコントローラーの有無にかかわらず動作するプログラムを簡単に作成できるようにします。

source: Keyboard
de: Tastatur
es: Teclado
fr: Clavier
ja: キーボード

source: kbd:[&#x25c4;] button
de: kbd:[◄]-Taste
es: kbd:botón [◄]
fr: kbd:bouton [◄]
ja: kbd:[◄]ボタン

source: kbd:[Left] key
de: kbd:[Links]-Taste
es: kbd:tecla [izquierda]
fr: kbd:touche [Gauche]

source: kbd:[&#x25bc;] button
de: kbd:[▼]-Taste
es: kbd:botón [▼]
fr: kbd:bouton [▼]
ja: kbd:[▼]ボタン

source: kbd:[&#x25ba;] button
de: kbd:[►]-Taste
es: kbd:botón [►]
fr: kbd:bouton [►]
ja: kbd:[►]ボタン

source: kbd:[&#x25b2;] button
de: kbd:[▲]-Taste
es: kbd:botón [▲]
fr: kbd:bouton [▲]
ja: kbd:[▲]ボタン

source: kbd:[&#x25a1;] button
de: kbd:[□]-Taste
es: kbd:botón [□]
fr: kbd:bouton [□]
ja: kbd:[□]ボタン

source: kbd:[Z] key
de: kbd:[Z]-Taste
es: kbd:tecla [Z]
fr: kbd:touche [Z]
ja: kbd:[Z]キー

source: kbd:[&#x2715;] button
de: kbd:[✕]-Taste
es: kbd:botón [✕]
fr: kbd:bouton [✕]
ja: kbd:[✕]ボタン

source: kbd:[X] key
de: kbd:[X]-Taste
es: kbd:tecla [X]
fr: kbd:touche [X]
ja: kbd:[X]キー

source: kbd:[S] key
de: kbd:[S]-Taste
es: kbd:tecla [S]
fr: kbd:touche [S]
ja: kbd:[S]キー

source: kbd:[&#x25b3;] button
de: kbd:[△]-Taste
es: kbd:botón [△]
fr: kbd:bouton [△]
ja: kbd:[△]ボタン

source: kbd:[A] key
de: kbd:[A]-Taste
es: kbd:tecla [A]
fr: kbd:touche [A]
ja: kbd:[A]キー

source: kbd:[R1] button
de: kbd:[R1]-Taste
es: kbd:botón [R1]
fr: kbd:bouton [R1]
ja: kbd:[R1]ボタン

source: kbd:[L1] button
de: kbd:[L1]-Taste
es: kbd:botón [L1]
fr: kbd:bouton [L1]
ja: kbd:[L1]ボタン

source: kbd:[R2] button
de: kbd:[R2]-Taste
es: kbd:botón [R2]
fr: kbd:bouton [R2]
ja: kbd:[R2]ボタン

source: kbd:[L2] button
de: kbd:[L2]-Taste
es: kbd:botón [L2]
fr: kbd:bouton [L2]
ja: kbd:[L2]ボタン

source: Depending on `state`, these bit values are set if the respective buttons are currently pressed (`0`) or newly pressed (`1`).
de: Abhängig vom `Zustand` werden diese Bitwerte gesetzt, wenn die jeweiligen Tasten aktuell gedrückt (`0`) oder neu gedrückt (`1`) werden.
es: Dependiendo del `estado`, estos valores de bit se establecen si los botones respectivos están presionados actualmente ( `0`) o si se presionan nuevamente (`1`).
fr: En fonction de `l'état`, ces valeurs de bits sont définies si les boutons respectifs sont actuellement enfoncés (`0`) ou nouvellement enfoncés (`1`).
ja: `state`に応じて、これらのビット値は、それぞれのボタンが現在押されているか（`0`）、または新しく押された（ `1`）場合に設定されます。

source: If `state` is `1`, additional values are returned:
de: Wenn `state` `1` ist, werden zusätzliche Werte zurückgegeben:
es: Si `state` es `1`, se devuelven valores adicionales:
fr: Si `state` vaut `1`, des valeurs supplémentaires sont renvoyées:
ja: `state`が`1`の場合、追加の値が返されます。

source: * `RET(1)` contains buttons that are newly released,
de: * `RET(1)` enthält neu freigegebene Schaltflächen,
es: * `RET(1)` contiene botones recién lanzados,
fr: * `RET(1)` contient des boutons nouvellement libérés,
ja: * `RET(1)`には、新しくリリースされたボタンが含まれています。

source: * `RET(2)` contains the current button state.
de: * `RET(2)` enthält den aktuellen Schaltflächenstatus.
es: * `RET(2)` contiene el estado actual del botón.
fr: * `RET(2)` contient l'état actuel du bouton.
ja: * `RET(2)`には、現在のボタンの状態が含まれます。

source: WARNING: Using `PAD()` to retrieve button events (`state` is not `0`) interacts with the event handling via `ON PAD`. It is not recommended to use both at the same time.
de: WARNUNG: Die Verwendung von `PAD()` zum Abrufen von Schaltflächenereignissen (`state` ist nicht `0`) interagiert mit der Ereignisbehandlung über `ON PAD`. Es wird nicht empfohlen, beide gleichzeitig zu verwenden.
es: ADVERTENCIA: Usar `PAD()` para recuperar los eventos de botones (`state` no es `0`) interactúa con el manejo de eventos a través de `ON PAD`. No se recomienda utilizar ambos al mismo tiempo.
fr: AVERTISSEMENT: l'utilisation de `PAD()` pour récupérer les événements de bouton (`state` n'est pas `0`) interagit avec la gestion des événements via `ON PAD`. Il n'est pas recommandé d'utiliser les deux en même temps.
ja: 警告： `PAD()`を使用してボタンイベントを取得すると（ `state`は`0`ではありません）、 `ON PAD`を介してイベント処理と相互作用します。両方を同時に使用することはお勧めしません。

source: Get the state of the specified keyboard key.
de: Ruft den Status der angegebenen Tastaturtaste ab.
es: Obtiene el estado de la tecla especificada del teclado.
fr: Obtenez l'état de la touche de clavier spécifiée.
ja: 指定されたキーボードキーの状態を取得します。

source: `1` if the key is held, `0` if it is not.
de: `1`, wenn die Taste gedrückt gehalten wird, `0`, wenn dies nicht der Fall ist.
es: `1` si la tecla se mantiene presionada, `0` si no lo está.
fr: `1` si la clé est maintenue, `0` si ce n'est pas le cas.
ja: キーが保持されている場合は`1`、保持されていない場合は`0`。

source: The key codes are detailed in the table below. Availability of each key depends on the Engine BASIC platform.
de: Die Tastencodes sind in der folgenden Tabelle aufgeführt. Die Verfügbarkeit jeder Taste hängt von der Engine BASIC-Plattform ab.
es: Los códigos de clave se detallan en la siguiente tabla. La disponibilidad de cada clave depende de la plataforma Engine BASIC.
fr: Les codes clés sont détaillés dans le tableau ci-dessous. La disponibilité de chaque clé dépend de la plate-forme Engine BASIC.
ja: キーコードの詳細を以下の表に示します。各キーの可用性は、EngineBASICプラットフォームによって異なります。

source: Notes
de: Anmerkungen
es: Notas
fr: Remarques
ja: ノート

source: kbd:[Insert]
de: kbd:[Einfügen]
es: kbd:[Insertar]
fr: kbd:[Insérer]

source: Japanese keyboard, not available on SDL
de: Japanische Tastatur, nicht auf SDL verfügbar
es: teclado japonés, no disponible en SDL
fr: Clavier japonais, non disponible sur SDL
ja: 日本語キーボード、SDLでは使用できません

source: kbd:[End]
de: kbd:[Ende]
fr: kbd:[Fin]

source: kbd:[Left Arrow]
de: kbd:[Pfeil nach links]
es: kbd:[Flecha izquierda]
fr: kbd:[Flèche gauche]

source: kbd:[Down Arrow]
de: kbd:[Pfeil nach unten]
es: kbd:[Flecha hacia abajo]
fr: kbd:[Flèche vers le bas]
ja: kbd:[下矢印]

source: kbd:[Backspace]
de: kbd:[Rücktaste]
es: kbd:[Retroceso]
fr: kbd:[Retour arrière]
ja: kbd:[バックスペース]

source: <<unclear,not well defined>>, not available on SDL
de: << Unklar, nicht gut definiert >>, nicht auf SDL verfügbar
es: << No claro, no bien definido >>, no disponible en SDL
fr: *not found*

source: Brazilian keyboard, not available on SDL
de: Brazilianische Tastatur, nicht auf SDL verfügbar
es: Teclado brasileño, no disponible en SDL
fr: Clavier brésilien, non disponible sur SDL
ja: ブラジルのキーボード、SDLでは使用できません

source: Key codes are fixed and do not change with the configured keyboard layout.
de: Tastencodes sind fest und ändern sich nicht mit dem konfigurierten Tastaturlayout.
es: Los códigos de tecla son fijos y no cambian con la distribución del teclado configurada.
fr: Les codes des touches sont fixes et ne changent pas avec la disposition de clavier configurée.
ja: キーコードは固定されており、構成されたキーボードレイアウトによって変更されません。

source: * Not all keys available on international (especially Japanese) keyboard are correctly mapped on all platforms.
de: * Nicht alle auf internationalen (insbesondere japanischen) Tastaturen verfügbaren Tasten sind auf allen Plattformen korrekt zugeordnet.
es: * No todas las teclas disponibles en el teclado internacional (especialmente japonés) están correctamente asignadas en todas las plataformas.
fr: * Toutes les touches disponibles sur le clavier international (en particulier japonais) ne sont pas correctement mappées sur toutes les plates-formes.
ja: *国際（特に日本語）キーボードで使用できるすべてのキーが、すべてのプラットフォームで正しくマッピングされているわけではありません。

source: Reads a character from the keyboard.
de: Liest ein Zeichen von der Tastatur.
es: Lee un carácter del teclado.
fr: Lit un caractère sur le clavier.
ja: キーボードから文字を読み取ります。

source: Returns either
de: Gibt entweder zurück
es: Devuelve
fr: Renvoie soit
ja: どちらかを返します

source: * an empty string if there is no keyboard input,
de: * ein leerer String, wenn keine Tastatureingabe vorhanden ist,
es: * una cadena vacía si no hay entrada de teclado,
fr: * une chaîne vide s'il n'y a pas de saisie clavier,
ja: *キーボード入力がない場合は空の文字列、

source: Value of the "up" direction for input devices.
de: Wert der Aufwärtsrichtung für Eingabegeräte.
es: Valor de la dirección "hacia arriba" para dispositivos de entrada.
fr: Valeur du sens "haut" pour les périphériques d'entrée.
ja: 入力デバイスの「上」方向の値。

source: Reads a character from the keyboard and returns its numeric value.
de: Liest ein Zeichen von der Tastatur und gibt seinen numerischen Wert zurück.
es: Lee un carácter del teclado y devuelve su valor numérico.
fr: Lit un caractère sur le clavier et renvoie sa valeur numérique.
ja: キーボードから文字を読み取り、その数値を返します。

source: port number [`0` to `7`]
de: Portnummer [`0` bis `7`]
es: número de puerto [`0` a `7`]
fr: numéro de port [`0` à `7`]
ja: ポート番号[`0`から`7`]

source: pin number [`0` to `15` (ESP8266) or `31` (H3)]
de: Pin-Nummer [`0` bis `15` (ESP8266) oder `31` (H3)]
es: número de pin [`0` a `15` (ESP8266) o `31` (H3)]
fr: numéro de broche [`0` à `15` (ESP8266) ou `31` (H3)]
ja: ピン番号[`0`から`15`（ESP8266）または `31`（H3）]

source: pin state [`0` for \"low\", anything else for \"high\"]
de: Pin-Status [`0` für \"niedrig\", alles andere für \"hoch\"]
es: estado del pin [`0` para \" bajo\", cualquier otra cosa para \" alto\"]
fr: état de la broche [`0` pour \"faible\", autre chose pour \"élevé\"]
ja: ピンの状態[「低」の場合は`0`、「高」の場合はその他]

source: * This command is only implemented on the ESP8266 and H3 platforms.
de: * Dieser Befehl ist nur auf den Plattformen ESP8266 und H3 implementiert.
es: * Este comando solo se implementa en las plataformas ESP8266 y H3.
fr: * Cette commande n'est implémentée que sur les plates-formes ESP8266 et H3.
ja: *このコマンドは、ESP8266およびH3プラットフォームでのみ実装されています。

source: * On the ESP8266 platform, `GPOUT` allows access to pins on the I2C I/O extender only.
de: * Auf der ESP8266-Plattform ermöglicht `GPOUT` nur den Zugriff auf Pins des I2C-I/O-Extenders.
es: * En la plataforma ESP8266, `GPOUT` permite el acceso a los pines en el extensor de E / S I2C únicamente.
fr: * Sur la plate-forme ESP8266, `GPOUT` permet d'accéder aux broches sur l'extension d'E / S I2C uniquement.
ja: * ESP8266プラットフォームでは、`GPOUT`は、I2C I / Oエクステンダーのピンへのアクセスのみを許可します。

source: pin number [`0` to `31`]
de: PIN-Nummer [`0` bis `31`]
es: número de pin [`0` a `31`]
fr: numéro de broche [`0` à `31`]
ja: ピン番号[`0`から`31`]

source: pin mode [`0` to `7`]
de: Pin-Modus [`0` bis `7`]
es: modo pin [`0` a `7`]
fr: mode pin [`0` à `7`]
ja: ピンモード[`0`から`7`]

source: * This command is only implemented on the H3 platform.
de: * Dieser Befehl ist nur auf der H3-Plattform implementiert.
es: * Este comando solo se implementa en la plataforma H3.
fr: * Cette commande n'est implémentée que sur la plate-forme H3.
ja: *このコマンドはH3プラットフォームでのみ実装されています。

source: * A `mode` value of `0` or `1` configures the pin as a general-purpose input or output, respectively. A value of `7` disables the pin.
de: * Ein `mode`-Wert von `0` oder `1` konfiguriert den Pin als universellen Eingang bzw. Ausgang. Ein Wert von `7` deaktiviert den Pin.
es: * Un valor de `modo` de `0` o `1` configura el pin como una entrada o salida de propósito general, respectivamente. Un valor de "7" desactiva el pin.
fr: * Une valeur `mode` de `0` ou `1` configure la broche comme entrée ou sortie à usage général, respectivement.Une valeur de `7` désactive la broche.
ja: * `mode`値が`0`または `1`の場合、ピンはそれぞれ汎用入力または出力として構成されます。`7`の値はピンを無効にします。

source: * For the functions of other modes, consult the Allwinner H3 datasheet, chapter 3.2 ("GPIO Multiplexing Functions").
de: * Informationen zu den Funktionen anderer Modi finden Sie im Allwinner H3-Datenblatt, Kapitel 3.2 ("GPIO-Multiplexing-Funktionen").
es: * Para las funciones de otros modos, consulte la hoja de datos de Allwinner H3, capítulo 3.2 ("Funciones de multiplexación GPIO").
fr: * Pour les fonctions des autres modes, consultez la fiche technique Allwinner H3, chapitre 3.2 («Fonctions de multiplexage GPIO»).
ja: *他のモードの機能については、Allwinner H3データシート、3.2（「GPIO多重化機能」）を参照してください。

source: * WARNING: Improper use of this command can cause permanent damage to the system and/or attached devices.
de: * WARNUNG: Eine unsachgemäße Verwendung dieses Befehls kann das System und / oder die angeschlossenen Geräte dauerhaft beschädigen.
es: * ADVERTENCIA: El uso inadecuado de este comando puede causar daños permanentes al sistema y / o dispositivos conectados.
fr: * AVERTISSEMENT: une utilisation incorrecte de cette commande peut causer des dommages permanents au système et / ou aux périphériques connectés.
ja: *警告：このコマンドを不適切に使用すると、システムや接続されているデバイスに恒久的な損傷を与える可能性があります。

source: Sends data to an I2C device.
de: Sendet Daten an ein I2C-Gerät.
es: Envía datos a un dispositivo I2C.
fr: Envoie des données à un périphérique I2C.
ja: I2Cデバイスにデータを送信します。

source: I2C address [`0` to `$7F`]
de: I2C-Adresse [`0` bis`$ 7F`]
es: Dirección I2C [`0` a`$ 7F`]
fr: Adresse I2C [`0` à `$ 7F`]
ja: I2Cアドレス[`0`から`$ 7F`]

source: data to be transmitted
de: zu übertragende Daten
es: datos a transmitir
fr: données à transmettre
ja: 送信するデータ

source: Status code of the transmission.
de: Statuscode der Übertragung.
es: Código de estado de la transmisión.
fr: Code d'état de la transmission.
ja: 送信のステータスコード。

source: Request data from I2C device.
de: Daten vom I2C-Gerät anfordern.
es: Solicite datos del dispositivo I2C.
fr: Demandez des données à l'appareil I2C.
ja: I2Cデバイスからデータを要求します。

source: number of bytes to be received
de: Anzahl der zu empfangenden Bytes
es: número de bytes que se recibirán
fr: nombre d'octets à recevoir
ja: 受信するバイト数

source: Returns the received data as the value of the function call.
de: Gibt die empfangenen Daten als Wert des Funktionsaufrufs zurück.
es: Devuelve los datos recibidos como el valor de la llamada a la función.
fr: Renvoie les données reçues comme valeur de l'appel de fonction.
ja: 受信したデータを関数呼び出しの値として返します。

source: If `out_data` is an empty string, no data is sent before the read request.
de: Wenn `out_data` ein leerer String ist, werden vor der Leseanforderung keine Daten gesendet.
es: Si `out_data` es una cadena vacía, no se envían datos antes de la solicitud de lectura.
fr: Si `out_data` est une chaîne vide, aucune donnée n'est envoyée avant la demande de lecture.
ja: `out_data`が空の文字列の場合、読み取り要求の前にデータは送信されません。

source: Writes a byte to the serial port.
de: Schreibt ein Byte in die serielle Schnittstelle.
es: Escribe un byte en el puerto serie.
fr: Écrit un octet sur le port série.
ja: シリアルポートにバイトを書き込みます。

source: WARNING: This command may be renamed in the future to reduce namespace pollution.
de: WARNUNG: Dieser Befehl wird möglicherweise in Zukunft umbenannt, um die Verschmutzung des Namespace zu verringern.
es: ADVERTENCIA: Es posible que se cambie el nombre de este comando en el futuro para reducir la contaminación del espacio de nombres.
fr: AVERTISSEMENT: cette commande peut être renommée à l'avenir pour réduire la pollution de l'espace de noms.
ja: 警告：このコマンドは、名前空間の汚染を減らすために、将来名前が変更される可能性があります。

source: Changes the serial port configuration.
de: Ändert die Konfiguration der seriellen Schnittstelle.
es: Cambia la configuración del puerto serie.
fr: Modifie la configuration du port série.
ja: シリアルポートの構成を変更します。

source: WARNING: This command is likely to be renamed in the future to reduce namespace pollution.
de: WARNUNG: Dieser Befehl wird wahrscheinlich in Zukunft umbenannt, um die Verschmutzung des Namespace zu verringern.
es: ADVERTENCIA: Es probable que se cambie el nombre de este comando en el futuro para reducir la contaminación del espacio de nombres.
fr: AVERTISSEMENT: cette commande sera probablement renommée à l'avenir pour réduire la pollution de l'espace de noms.
ja: 警告：このコマンドは、名前空間の汚染を減らすために、将来名前が変更される可能性があります。

source: baud rate [`0` to `921600`]
de: Baudrate [`0` bis `921600`]
es: velocidad en baudios [`0` a `921600`]
fr: vitesse de transmission [`0` à `921600`]
ja: ボーレート[`0`から`921600`]

source: serial port flags
de: Flags der seriellen Schnittstelle
es: banderas de puerto serie
fr: indicateurs de port série
ja: シリアルポートフラグ

source: The meaning of `flags` is determined by `enum` values in the Arduino core and cannot be relied on to remain stable.
de: Die Bedeutung von `flags` wird durch `enum`-Werte im Arduino-Kern bestimmt und kann nicht als stabil angesehen werden.
es: El significado de "banderas" está determinado por los valores de "enumeración" en el núcleo de Arduino y no se puede confiar en que se mantenga estable.
fr: La signification de `flags` est déterminée par les valeurs `enum` dans le noyau Arduino et ne peut pas être fiable pour rester stable.
ja: `flags`の意味は、Arduinoコアの`enum`値によって決定され、安定性を維持するために信頼することはできません。

source: pin number [`0` to `15`]
de: PIN-Nummer [`0` bis `15`]
es: número de pin [`0` a `15`]
fr: numéro de broche [`0` à `15`]
ja: ピン番号[`0`から`15`]

source: * This function is only implemented on the ESP8266 and H3 platforms.
de: * Diese Funktion ist nur auf den Plattformen ESP8266 und H3 implementiert.
es: * Esta función solo se implementa en las plataformas ESP8266 y H3.
fr: * Cette fonction n'est implémentée que sur les plates-formes ESP8266 et H3.
ja: *この機能は、ESP8266およびH3プラットフォームでのみ実装されています。

source: * On the ESP8266 platform, `GPIN()` allows access to pins on the I2C I/O extender only.
de: * Auf der ESP8266-Plattform ermöglicht `GPIN()` nur den Zugriff auf Pins auf dem I2C I/O-Extender.
es: * En la plataforma ESP8266, `GPIN()` permite el acceso a los pines en el extensor de E / S I2C únicamente.
fr: * Sur la plate-forme ESP8266, `GPIN()` permet d'accéder aux broches sur l'extension d'E / S I2C uniquement.
ja: * ESP8266プラットフォームでは、 `GPIN()`はI2C I / Oエクステンダーのピンへのアクセスのみを許可します。

source: Reads value from the analog input pin.
de: Liest den Wert vom Analogeingangspin.
es: Lee el valor del pin de entrada analógica.
fr: Lit la valeur de la broche d'entrée analogique.
ja: アナログ入力ピンから値を読み取ります。

source: Reads bytes from the serial port.
de: Liest Bytes von der seriellen Schnittstelle.
es: Lee bytes del puerto serie.
fr: Lit les octets du port série.
ja: シリアルポートからバイトを読み取ります。

source: WARNING: This function is currently useless because the serial port receive pin is used for sound output in the BASIC Engine. It may be removed in the future if it turns out that there is no viable way to support serial input.
de: WARNUNG: Diese Funktion ist derzeit unbrauchbar, da der Empfangspin der seriellen Schnittstelle für die Tonausgabe in der BASIC Engine verwendet wird. Es kann in Zukunft entfernt werden, wenn sich herausstellt, dass es keine praktikable Möglichkeit gibt, serielle Eingaben zu unterstützen.
es: ADVERTENCIA: Esta función actualmente es inútil porque el pin de recepción del puerto serie se usa para la salida de sonido en el motor BASIC. Es posible que se elimine en el futuro si resulta que no hay una forma viable de admitir la entrada en serie.
fr: AVERTISSEMENT: cette fonction est actuellement inutile car la broche de réception du port série est utilisée pour la sortie audio dans le moteur BASIC. Il peut être supprimé à l'avenir s'il s'avère qu'il n'existe aucun moyen viable de prendre en charge l'entrée série.
ja: 警告：シリアルポートの受信ピンはBASICエンジンのサウンド出力に使用されるため、この機能は現在使用できません。シリアル入力をサポートする実行可能な方法がないことが判明した場合は、将来削除される可能性があります。
