Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: * BASIC programs are saved in plain text (UTF-8) format.
de: * BASIC-Programme werden im Klartextformat (UTF-8) gespeichert.
es: * Los programas BASIC se guardan en formato de texto plano (UTF-8).
fr: * Les programmes BASIC sont sauvegardés au format texte brut (UTF-8).
ja: * BASIC プログラムは、プレーンテキスト（UTF-8）形式で保存されます。

source: Runs operating system commands.
de: Führt Betriebssystembefehle aus.
es: Ejecuta los comandos del sistema operativo.
fr: Exécute des commandes du système d'exploitation.
ja: オペレーティングシステムのコマンドを実行する。

source: command to run
de: Auszuführender Befehl
es: comando a ejecutar
fr: Commande à exécuter
ja: 実行するコマンド

source: argument to pass to the command
de: Argument zur Übergabe an den Befehl
es: argumento a pasar al comando
fr: argument à passer à la commande
ja: コマンドに渡す引数

source: Runs `command`, or an interactive shell if `command` is not specified.
de: Führt `command` aus, oder eine interaktive Shell, wenn `command` nicht angegeben ist.
es: Ejecuta `command` o un shell interactivo si no se especifica `command`.
fr: Exécute `command`, ou un shell interactif si `command` n'est pas spécifié.
ja: `command` を実行する。`command` が指定されていない場合は、対話型のシェルを実行する。

source: `command` is executed by the operating system shell if there are no `argument` parameters, allowing shell syntax constructs to be used.
de: `command` wird von der Betriebssystem-Shell ausgeführt, wenn keine `argument`-Parameter angegeben sind, so dass Shell-Syntax-Konstrukte verwendet werden können.
es: El shell del sistema operativo ejecuta `command` si no hay parámetros `argument`, lo que permite utilizar construcciones de sintaxis del shell.
fr: `command` est exécutée par le shell du système d'exploitation s'il n'y a pas de paramètres `argument`, ce qui permet d'utiliser les constructions syntaxiques du shell.
ja: 引数 `argument` がない場合、`command` はオペレーティングシステムのシェルによって実行され、シェル構文を使用できるようになります。

source: If one or more `argument` parameters are specified, the command will be executed directly.
de: Wenn ein oder mehrere `argument`-Parameter angegeben sind, wird der Befehl direkt ausgeführt.
es: Si se especifican uno o más parámetros `argument`, el comando será ejecutado directamente.
fr: Si un ou plusieurs paramètres `argument` sont spécifiés, la commande sera exécutée directement.
ja: 1つ以上の `argument` パラメータが指定された場合、コマンドは直接実行される。

source: If the `OFF` keyword is added, Engine BASIC will shut down its graphics, sound and input system to allow the executed program to use these facilities.
de: Wenn das Schlüsselwort `OFF` hinzugefügt wird, schaltet Engine BASIC sein Grafik-, Sound- und Eingabesystem ab, damit das ausgeführte Programm diese Einrichtungen nutzen kann.
es: Si se añade la palabra clave `OFF`, Engine BASIC apagará su sistema de gráficos, sonido y entrada para permitir que el programa ejecutado utilice estas facilidades.
fr: Si le mot-clé `OFF` est ajouté, l'Engine BASIC arrêtera son système graphique, sonore et d'entrée pour permettre au programme exécuté d'utiliser ces facilités.
ja: キーワード `OFF` を追加すると、Engine BASIC はグラフィック、サウンド、入力システムを停止し、実行するプログラムがこれらの機能を使用できるようにします。

source: * Commands with `argument` parameters are executed using `execvp("<command>", "<command>", "<argument">, ...)`.
de: * Befehle mit `argument`-Parametern werden mit `execvp("<command>", "<command>", "<argument">, ...)` ausgeführt.
es: * Los comandos con parámetros `argument` se ejecutan usando `execvp("<command>", "<command>", "<argument">, ...)`.
fr: * Les commandes avec des paramètres `argument` sont exécutées en utilisant `execvp("<command>", "<command>", "<argument">, ...)`.
ja: * 引数`を持つコマンドは `execvp("<command>", "<command>", "<argument">, ...)` を使って実行されます。

source: Selects a SPI device.
de: Wählt ein SPI-Gerät aus.
es: Selecciona un dispositivo SPI.
fr: Sélectionne un périphérique SPI.
ja: SPI デバイスを選択します。

source: a C source code file to compile
de: eine C-Quellcode-Datei zum Kompilieren
es: un archivo de código fuente C para compilar
fr: un fichier de code source C à compiler
ja: コンパイルするC言語のソースコード・ファイル

source: name of executable file to generate
de: Name der zu erzeugenden ausführbaren Datei
es: nombre del archivo ejecutable a generar
fr: nom du fichier exécutable à générer
ja: 生成する実行ファイル名

source: argument to pass to compiled file when run
de: Argument, das bei der Ausführung an die kompilierte Datei übergeben wird
es: argumento a pasar al archivo compilado cuando se ejecuta
fr: argument à passer au fichier compilé lors de l'exécution
ja: コンパイルしたファイルを実行する際に渡す引数

source: Compiles the given C source code files to an executable file, or to a loadable module if the `MOD` keyword is present.
de: Kompiliert die angegebenen C-Quellcode-Dateien zu einer ausführbaren Datei oder zu einem ladbaren Modul, wenn das Schlüsselwort `MOD` vorhanden ist.
es: Compila los archivos de código fuente C dados a un archivo ejecutable, o a un módulo cargable si la palabra clave `MOD` está presente.
fr: Compile les fichiers de code source C donnés en un fichier exécutable, ou en un module chargeable si le mot-clé `MOD` est présent.
ja: 与えられた C ソースコードファイルを実行ファイルにコンパイルします。`MOD` キーワードがあれば、ロード可能なモジュールにコンパイルします。

source: The compiled program or module is written to `executable$`.
de: Das kompilierte Programm oder Modul wird in `executable$` geschrieben.
es: El programa o módulo compilado está escrito a `executable$`.
fr: Le programme ou le module compilé est écrit dans `executable$`.
ja: コンパイルされたプログラムまたはモジュールは `executable$` に書き込まれる。

source: If `executable$` is not specified, the code is compiled to a temporary file and immediately executed or loaded. For regular programs, any `argument$` parameters will be passed to the program.
de: Wenn `executable$` nicht angegeben ist, wird der Code in eine temporäre Datei kompiliert und sofort ausgeführt oder geladen. Bei regulären Programmen werden alle `argument$` Parameter an das Programm übergeben.
es: Si no se especifica `executable$`, el código se compila en un archivo temporal y se ejecuta o carga inmediatamente. Para los programas regulares, cualquier parámetro `argument$` será pasado al programa.
fr: Si `executable$` n'est pas spécifié, le code est compilé dans un fichier temporaire et immédiatement exécuté ou chargé. Pour les programmes réguliers, tous les paramètres `argument$` seront passés au programme.
ja: `executable$` が指定されない場合は、一時ファイルにコンパイルされ、直ちに実行またはロードされます。通常のプログラムでは、任意の `argument$` パラメータがプログラムに渡される。

source: Register contents.
de: Registerinhalt.
es: Contenido del registro.
fr: Contenu du registre.
ja: レジスタの内容です。

source: * Unlike its counterparts in BASIC implementations with single-byte strings, this function may return values larger than 255.
de: * Im Gegensatz zu ihren Gegenstücken in BASIC-Implementierungen mit Einzelbyte-Strings kann diese Funktion Werte zurückgeben, die größer als 255 sind.
es: * A diferencia de sus contrapartes en implementaciones BASIC con cadenas de un solo byte, esta función puede devolver valores mayores que 255.
fr: * Contrairement à ses homologues des implémentations BASIC avec des chaînes à un octet, cette fonction peut renvoyer des valeurs supérieures à 255.

source: tone cycle period in samples [`0` (off) to `480`/`512`/`2048`]
de: Tonzyklusperiode in Samples [`0` (aus) bis `480`/`512`/`2048`]
es: período del ciclo de tono en muestras [`0` (apagado) a `480`/`512`/`2048`]
fr: période de cycle de tonalité en échantillons [`0` (off) à `480`/`512`/`2048`]

source: The maximum value for `period` varies depending on the platform:
de: Der Maximalwert für `period` variiert je nach Plattform:
es: El valor máximo de `period` varía según la plataforma:
fr: La valeur maximale de `period` varie en fonction de la plateforme :

source: Sets the TV norm to NTSC (`0`), PAL (`1`) or PAL60 (`2`).
de: Setzt die TV-Norm auf NTSC (`0`), PAL (`1`) oder PAL60 (`2`).
es: Establece la norma de TV en NTSC (`0`), PAL (`1`) o PAL60 (`2`).
fr: Règle la norme TV sur NTSC (`0`), PAL (`1`) ou PAL60 (`2`).

source: WARNING: This configuration option does not make much sense; the available TV norm depends on the installed color burst crystal and is automatically detected; PAL60 mode is not currently implemented.
de: ACHTUNG: Diese Konfigurationsoption macht wenig Sinn; die verfügbare TV-Norm hängt vom installierten Farbburst-Kristall ab und wird automatisch erkannt; Der PAL60-Modus ist derzeit nicht implementiert.
es: ADVERTENCIA: Esta opción de configuración no tiene mucho sentido; la norma de TV disponible depende del cristal de ráfaga de color instalado y se detecta automáticamente; El modo PAL60 no está implementado actualmente.
fr: AVERTISSEMENT : Cette option de configuration n'a pas beaucoup de sens ; la norme TV disponible dépend du cristal d'éclatement de couleur installé et est automatiquement détectée ; Le mode PAL60 n’est actuellement pas implémenté.

source: The semantics of this option are therefore likely to change in the future.
de: Die Semantik dieser Option dürfte sich daher in Zukunft ändern.
es: Por tanto, es probable que la semántica de esta opción cambie en el futuro.
fr: La sémantique de cette option est donc susceptible de changer dans le futur.

source: * `1`: Keyboard layout
de: * `1`: Tastaturlayout
es: * `1`: Distribución del teclado
fr: * `1` : disposition du clavier

source: Four different keyboard layouts are supported:
de: Es werden vier verschiedene Tastaturlayouts unterstützt:
es: Se admiten cuatro diseños de teclado diferentes:
fr: Quatre configurations de clavier différentes sont prises en charge :

source: `0` (Japanese), `1` (US English, default), `2` (German), `3` (French) and `4` (Spanish).
de: `0` (Japanisch), `1` (US-Englisch, Standard), `2` (Deutsch), `3` (Französisch) und `4` (Spanisch).
es: `0` (japonés), `1` (inglés estadounidense, predeterminado), `2` (alemán), `3` (francés) y `4` (español).
fr: `0` (japonais), `1` (anglais américain, par défaut), `2` (allemand), `3` (français) et `4` (espagnol).

source: Sets the video output to progressive (`0`) or interlaced (`1`). A change in this option will become effective on the next screen mode change.
de: Stellt die Videoausgabe auf progressiv (`0`) oder interlaced (`1`) ein. Eine Änderung dieser Option wird bei der nächsten Änderung des Bildschirmmodus wirksam.
es: Establece la salida de vídeo en progresiva (`0`) o entrelazada (`1`). Un cambio en esta opción se hará efectivo en el siguiente cambio de modo de pantalla.
fr: Règle la sortie vidéo sur progressive (`0`) ou entrelacée (`1`). Une modification de cette option deviendra effective lors du prochain changement de mode d’écran.

source: WARNING: The intention of this option is to provide an interlaced signal to TVs that do not handle a progressive signal well. So far, no displays have turned up that require it, so it may be removed and/or replaced with a different option in future releases.
de: WARNUNG: Der Zweck dieser Option besteht darin, Fernsehgeräten, die ein progressives Signal nicht gut verarbeiten, ein Interlaced-Signal bereitzustellen. Bisher sind keine Displays aufgetaucht, die dies erfordern. Daher kann es sein, dass es in zukünftigen Versionen entfernt und/oder durch eine andere Option ersetzt wird.
es: ADVERTENCIA: La intención de esta opción es proporcionar una señal entrelazada a televisores que no manejan bien una señal progresiva. Hasta ahora, no ha aparecido ninguna pantalla que lo requiera, por lo que es posible que se elimine y/o se reemplace con una opción diferente en futuras versiones.
fr: AVERTISSEMENT : le but de cette option est de fournir un signal entrelacé aux téléviseurs qui ne gèrent pas bien un signal progressif. Jusqu'à présent, aucun écran ne l'exigeant, il pourrait donc être supprimé et/ou remplacé par une option différente dans les versions futures.

source: * `3`: Luminance low-pass filter
de: * `3`: Luminanz-Tiefpassfilter
es: * `3`: Filtro de paso bajo de luminancia
fr: * `3` : Filtre passe-bas de luminance

source: This option enables (`1`) or disables (`0`, default) the video luminance low-pass filter. The recommended setting depends on the properties of the display device used.
de: Diese Option aktiviert (`1`) oder deaktiviert (`0`, Standard) den Video-Luminanz-Tiefpassfilter. Die empfohlene Einstellung hängt von den Eigenschaften des verwendeten Anzeigegeräts ab.
es: Esta opción habilita (`1`) o deshabilita (`0`, predeterminado) el filtro de paso bajo de luminancia del video. La configuración recomendada depende de las propiedades del dispositivo de visualización utilizado.
fr: Cette option active (`1`) ou désactive (`0`, par défaut) le filtre passe-bas de luminance vidéo. Le paramètre recommandé dépend des propriétés du périphérique d'affichage utilisé.

source: Many recent TVs are able to handle high resolutions well; with such devices, it is recommended to turn the low-pass filter off to achieve a more crisp display.
de: Viele neuere Fernseher kommen mit hohen Auflösungen gut zurecht; Bei solchen Geräten empfiehlt es sich, den Tiefpassfilter auszuschalten, um eine schärfere Darstellung zu erreichen.
es: Muchos televisores recientes pueden soportar bien resoluciones altas; con dichos dispositivos, se recomienda desactivar el filtro de paso bajo para lograr una visualización más nítida.
fr: De nombreux téléviseurs récents sont capables de bien gérer les hautes résolutions ; avec de tels appareils, il est recommandé de désactiver le filtre passe-bas pour obtenir un affichage plus net.

source: On other (usually older) TVs, high-resolution images may cause excessive color artifacting (a "rainbow" effect) or flicker; with such devices, it is recommended to turn the low-pass filter on to reduce these effects, at the expense of sharpness.
de: Auf anderen (normalerweise älteren) Fernsehgeräten können hochauflösende Bilder übermäßige Farbartefakte (einen „Regenbogeneffekt“) oder Flimmern verursachen; Bei solchen Geräten empfiehlt es sich, den Tiefpassfilter einzuschalten, um diese Effekte auf Kosten der Schärfe zu reduzieren.
es: En otros televisores (normalmente más antiguos), las imágenes de alta resolución pueden provocar una alteración excesiva del color (un efecto de "arco iris") o parpadeo; con tales dispositivos, se recomienda activar el filtro de paso bajo para reducir estos efectos, a expensas de la nitidez.
fr: Sur d'autres téléviseurs (généralement plus anciens), les images haute résolution peuvent provoquer des artefacts de couleurs excessifs (un effet « arc-en-ciel ») ou un scintillement ; avec de tels appareils, il est recommandé d'activer le filtre passe-bas pour réduire ces effets, au détriment de la netteté.

source: * `4`: Power-on screen mode [`1` (default) to `10`]
de: * `4`: Einschaltbildschirmmodus [`1` (Standard) bis `10`]
fr: * `4` : mode écran de mise sous tension [`1` (par défaut) à `10`]

source: Sets the screen mode the system defaults to at power-on.
de: Legt den Bildschirmmodus fest, den das System beim Einschalten standardmäßig verwendet.
es: Establece el modo de pantalla que el sistema utiliza de forma predeterminada al encenderse.
fr: Définit le mode d'écran par défaut du système à la mise sous tension.

source: * `5`: Power-on screen font [`0` (default) to `{NUM_FONTS_m1}`]
de: * `5`: Schriftart für den Einschaltbildschirm [`0` (Standard) bis `{NUM_FONTS_m1}`]
fr: * `5` : police de l'écran de mise sous tension [`0` (par défaut) à `{NUM_FONTS_m1}`]

source: Sets the screen font the system defaults to at power-on.
de: Legt die Bildschirmschriftart fest, die das System beim Einschalten standardmäßig verwendet.
es: Establece la fuente de pantalla que el sistema utiliza de forma predeterminada al encenderse.
fr: Définit la police d'écran utilisée par défaut par le système à la mise sous tension.

source: * `6`: Power-on cursor color [`0` to `255`]
de: * `6`: Farbe des Cursors beim Einschalten [`0` bis `255`]
fr: * `6` : Couleur du curseur à la mise sous tension [`0` à `255`]

source: Sets the cursor color the system defaults to at power-on.
de: Legt die Cursorfarbe fest, die das System beim Einschalten standardmäßig verwendet.
es: Establece el color del cursor que el sistema utiliza de forma predeterminada al encenderse.
fr: Définit la couleur du curseur par défaut du système à la mise sous tension.

source: * `7`: Beeper sound volume [`0` to `15` (default)]
de: * `7`: Lautstärke des Piepsers [`0` bis `15` (Standard)]
es: * `7`: Volumen del sonido del pitido [`0` a `15` (predeterminado)]
fr: * `7` : Volume sonore du bipeur [`0` à `15` (par défaut)]

source: Sets the volume of the "beeper" sound engine, which applies, among other things, to the start-up jingle.
de: Legt die Lautstärke der „Beeper“-Sound-Engine fest, die unter anderem für den Start-Jingle gilt.
es: Establece el volumen del motor de sonido "beeper", que se aplica, entre otras cosas, al jingle de inicio.
fr: Règle le volume du moteur sonore « bip », qui s'applique, entre autres, au jingle de démarrage.

source: * `8`: Screen line adjustment [`-128` to `128`, default: `0`] Adjusts the number of screen lines. A positive value adds lines, a negative value subtracts them.
de: * `8`: Bildschirmzeilenanpassung [`-128` bis `128`, Standard: `0`] Passt die Anzahl der Bildschirmzeilen an. Ein positiver Wert fügt Zeilen hinzu, ein negativer Wert subtrahiert sie.
es: * `8`: Ajuste de línea de pantalla [`-128` a `128`, predeterminado: `0`] Ajusta el número de líneas de pantalla. Un valor positivo suma líneas, un valor negativo las resta.
fr: * `8` : Ajustement des lignes d'écran [`-128` à `128`, par défaut : `0`] Ajuste le nombre de lignes d'écran. Une valeur positive ajoute des lignes, une valeur négative les soustrait.

source: This option may be useful to mitigate issues with color artifacting and flicker on some devices.
de: Diese Option kann nützlich sein, um Probleme mit Farbartefakten und Flimmern auf einigen Geräten zu mildern.
es: Esta opción puede resultar útil para mitigar problemas con artefactos de color y parpadeos en algunos dispositivos.
fr: Cette option peut être utile pour atténuer les problèmes d’artefacts de couleur et de scintillement sur certains appareils.

source: WARNING: It is not clear if this option is useful in practice, and it may be removed in future releases.
de: WARNUNG: Es ist nicht klar, ob diese Option in der Praxis nützlich ist, und sie wird möglicherweise in zukünftigen Versionen entfernt.
es: ADVERTENCIA: No está claro si esta opción es útil en la práctica y es posible que se elimine en versiones futuras.
fr: AVERTISSEMENT : il n'est pas clair si cette option est utile en pratique et elle pourrait être supprimée dans les versions futures.

source: * `9`: Keyword separation optional [`0` (default) or `1`]
de: * `9`: Schlüsselworttrennung optional [`0` (Standard) oder `1`]
es: * `9`: Separación de palabras clave opcional [`0` (predeterminado) o `1`]
fr: * `9` : séparation des mots-clés facultative [`0` (par défaut) ou `1`]

source: Controls if BASIC keywords need to be separated from other language elements containing alphanumeric characters with a space (`0`), or if they can be adjacent to those like in traditional BASIC dialects (`1`).
de: Legt fest, ob BASIC-Schlüsselwörter von anderen Sprachelementen, die alphanumerische Zeichen enthalten, durch ein Leerzeichen (`0`) getrennt werden müssen oder ob sie, wie in traditionellen BASIC-Dialekten, an diese angrenzen können (`1`).
es: Controla si las palabras clave BASIC deben separarse de otros elementos del idioma que contienen caracteres alfanuméricos con un espacio (`0`), o si pueden ser adyacentes a aquellos como en los dialectos BASIC tradicionales (`1`).
fr: Contrôle si les mots-clés BASIC doivent être séparés des autres éléments du langage contenant des caractères alphanumériques avec un espace (`0`), ou s'ils peuvent être adjacents à ceux comme dans les dialectes BASIC traditionnels (`1`).

source: * `10`: Physical screen mode (H3 platform only) [`0` (default) to `6`]
de: * `10`: Physischer Bildschirmmodus (nur H3-Plattform) [`0` (Standard) bis `6`]
es: * `10`: Modo de pantalla física (solo plataforma H3) [`0` (predeterminado) a `6`]
fr: * `10` : mode d'écran physique (plateforme H3 uniquement) [`0` (par défaut) à `6`]

source: Sets the physical screen resolution:
de: Legt die physische Bildschirmauflösung fest:
es: Establece la resolución de la pantalla física:
fr: Définit la résolution physique de l'écran :

source: (1024x768 DVI), `4` (800x600 DVI), `5` (640x480 DVI) or `6`
de: (1024x768 DVI), `4` (800x600 DVI), `5` (640x480 DVI) oder `6`.
es: (1024x768 DVI), `4` (800x600 DVI), `5` (640x480 DVI) o `6`
fr: (1024 x 768 DVI), `4` (800 x 600 DVI), `5` (640 x 480 DVI) ou `6`

source: It is necessary to save the configuration and reboot the system for this option to take effect.
de: Damit diese Option wirksam wird, müssen Sie die Konfiguration speichern und das System neu starten.
es: Es necesario guardar la configuración y reiniciar el sistema para que esta opción surta efecto.
fr: Il est nécessaire de sauvegarder la configuration et de redémarrer le système pour que cette option prenne effet.

source: * `11`: Language
de: * `11`: Sprache
es: * `11`: Idioma
fr: * `11` : Langue

source: The following languages are supported for system messages:
de: Die folgenden Sprachen werden für Systemmeldungen unterstützt:
es: Los siguientes idiomas son compatibles con los mensajes del sistema:
fr: Les langues suivantes sont prises en charge pour les messages système :

source: `0` (US English, default), `1` (German), `2` (French), `3` (Spanish), `4` (Japanese).
de: `0` (US-Englisch, Standard), `1` (Deutsch), `2` (Französisch), `3` (Spanisch), `4` (Japanisch).
es: `0` (inglés estadounidense, predeterminado), `1` (alemán), `2` (francés), `3` (español), `4` (japonés).
fr: `0` (anglais américain, par défaut), `1` (allemand), `2` (français), `3` (espagnol), `4` (japonais).

source: * `12`: Start screen recording immediately.
de: * `12`: Bildschirmaufnahme sofort starten.
es: * `12`: Iniciar la grabación de pantalla inmediatamente.
fr: * `12` : démarrez immédiatement l'enregistrement d'écran.

source: When enabled, screen recording will start as soon as Engine BASIC boots.
de: Wenn diese Option aktiviert ist, beginnt die Bildschirmaufzeichnung, sobald Engine BASIC startet.
es: Cuando está habilitado, la grabación de pantalla comenzará tan pronto como se inicie Engine BASIC.
fr: Lorsqu'il est activé, l'enregistrement d'écran démarre dès le démarrage d'Engine BASIC.

source: (Only available on platforms that support screen recording.)
de: (Nur auf Plattformen verfügbar, die Bildschirmaufzeichnung unterstützen.)
es: (Solo disponible en plataformas que admiten la grabación de pantalla).
fr: (Uniquement disponible sur les plates-formes prenant en charge l'enregistrement d'écran.)

source: `0` enabled, `1` disabled.
de: `0` aktiviert, `1` deaktiviert.
es: `0` habilitado, `1` deshabilitado.
fr: `0` activé, `1` désactivé.

source: Exits the top-most loop of the specified type, without regard for its loop condition, or the specified `FOR` loop if there is a `loop_variable` argument.
de: Verlässt die oberste Schleife des angegebenen Typs, ohne Berücksichtigung der Schleifenbedingung, oder die angegebene `FOR`-Schleife, wenn ein `loop_variable`-Argument vorhanden ist.
es: Sale del bucle más alto del tipo especificado, sin tener en cuenta su condición de bucle, o del bucle `FOR` especificado si hay un argumento `variable_de_bucle`.
fr: Quitte la boucle la plus haute du type spécifié, sans tenir compte de sa condition de boucle, ou la boucle `FOR` spécifiée s'il y a un argument `loop_variable`.
ja: ループ条件を無視して、指定された型の一番上のループを終了する。 `loop_variable` 引数がある場合は、指定された `FOR` ループを終了する。

source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
