Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: Sprite 2 is left of sprite 1.
de: Sprite 2 ist links von Sprite 1.
es: El Sprite 2 queda a la izquierda del Sprite 1.
fr: Le sprite 2 est à gauche du sprite 1.
ja: スプライト2はスプライト1の左側にあります。

source: Sprite 2 is below sprite 1.
de: Sprite 2 liegt unter Sprite 1.
es: El Sprite 2 está debajo del Sprite 1.
fr: Le sprite 2 est en dessous du sprite 1.
ja: スプライト2はスプライト1の下にあります。

source: Sprite 2 is right of sprite 1.
de: Sprite 2 ist rechts von Sprite 1.
es: El Sprite 2 está a la derecha del Sprite 1.
fr: Le sprite 2 est à droite du sprite 1.
ja: スプライト2はスプライト1の右側です。

source: Sprite 2 is above sprite 1.
de: Sprite 2 liegt über Sprite 1.
es: El Sprite 2 está por encima del Sprite 1.
fr: Le sprite 2 est au-dessus du sprite 1.
ja: スプライト2はスプライト1の上にあります。

source: * Collisions are only detected if both sprites are enabled.
de: * Kollisionen werden nur erkannt, wenn beide Sprites aktiviert sind.
es: * Las colisiones solo se detectan si ambos sprites están habilitados.
fr: * Les collisions ne sont détectées que si les deux sprites sont activés.
ja: *衝突は、両方のスプライトが有効になっている場合にのみ検出されます。

source: * Sprite/sprite collision detection is pixel-accurate, i.e. a collision is only detected if visible pixels of two sprites overlap.
de: * Die Sprite / Sprite-Kollisionserkennung ist pixelgenau, dh eine Kollision wird nur erkannt, wenn sich sichtbare Pixel zweier Sprites überlappen.
es: * La detección de colisiones de sprites / sprites tiene una precisión de píxeles, es decir, una colisión solo se detecta si los píxeles visibles de dos sprites se superponen.
fr: * La détection de collision sprite / sprite est précise au pixel près, c'est-à-dire qu'une collision n'est détectée que si les pixels visibles de deux sprites se chevauchent.
ja: *スプライト/スプライトの衝突検出はピクセル精度です。つまり、衝突は2つのスプライトの可視ピクセルが重なっている場合にのみ検出されます。

source: Returns the horizontal position of a given sprite.
de: Gibt die horizontale Position eines bestimmten Sprites zurück.
es: Devuelve la posición horizontal de un sprite dado.
fr: Renvoie la position horizontale d'un sprite donné.
ja: 指定されたスプライトの水平位置を返します。

source: X coordinate of sprite `spr`.
de: X-Koordinate des Sprites `spr`.
es: Coordenada X del sprite `spr`.
fr: Coordonnée X du sprite `spr`.
ja: スプライト `spr`のX座標。

source: Returns the vertical position of a given sprite.
de: Gibt die vertikale Position eines bestimmten Sprites zurück.
es: Devuelve la posición vertical de un sprite dado.
fr: Renvoie la position verticale d'un sprite donné.
ja: 指定されたスプライトの垂直位置を返します。

source: Y coordinate of sprite `spr`.
de: Y-Koordinate des Sprites `spr`.
es: Coordenada Y del sprite `spr`.
fr: Coordonnée Y du sprite `spr`.
ja: スプライト `spr`のY座標。

source: Returns the width of a given sprite.
de: Gibt die Breite eines bestimmten Sprites zurück.
es: Devuelve el ancho de un sprite dado.
fr: Renvoie la largeur d'un sprite donné.
ja: 指定されたスプライトの幅を返します。

source: Width of sprite `spr`.
de: Breite des Sprites `spr`.
es: Ancho del sprite `spr`.
fr: Largeur du sprite `spr`.
ja: スプライト `spr`の幅。

source: On platforms with rotozoom support, the function returns the dimension after transformations have been applied.
de: Auf Plattformen mit Rotozoom-Unterstützung gibt die Funktion die Dimension zurück, nachdem Transformationen angewendet wurden.
es: En plataformas con soporte de rotozoom, la función devuelve la dimensión después de que se hayan aplicado las transformaciones.
fr: Sur les plates-formes avec prise en charge de rotozoom, la fonction renvoie la dimension une fois les transformations appliquées.
ja: rotozoomをサポートするプラットフォームでは、関数は変換が適用された後にディメンションを返します。

source: When rotation and/or scale are changed, the new dimensions may not be reflected here until the next video frame is rendered.
de: Wenn Drehung und / oder Skalierung geändert werden, werden die neuen Abmessungen hier möglicherweise erst wiedergegeben,enn das nächste Videobild gerendert wird.
es: Cuando se cambia la rotación y / o la escala, es posible que las nuevas dimensiones no se reflejen aquí hasta que se procese el siguiente cuadro de video.
fr: Lorsque la rotation et / ou l'échelle sont modifiées, les nouvelles dimensions peuvent ne pas être reflétées ici jusqu'à ce que l'image vidéo suivante soit rendue.
ja: 回転やスケールが変更された場合、次のビデオフレームがレンダリングされるまで、新しい寸法がここに反映されない場合があります。

source: Returns the height of a given sprite.
de: Gibt die Höhe eines bestimmten Sprites zurück.
es: Devuelve la altura de un objeto determinado.
fr: Renvoie la hauteur d'un sprite donné.
ja: 指定されたスプライトの高さを返します。

source: Height of sprite `spr`.
de: Höhe des Sprites `spr`.
es: Altura del sprite `spr`.
fr: Hauteur du sprite `spr`.
ja: スプライト `spr`の高さ。

source: Returns the horizontal scrolling offset of a given background layer.
de: Gibt den horizontalen Scrolling-Offset einer bestimmten Hintergrundschicht zurück.
es: Devuelve el desplazamiento horizontal de una capa de fondo dada.
fr: Renvoie le décalage de défilement horizontal d'un calque d'arrière-plan donné.
ja: 与えられた背景レイヤの水平スクロールオフセットを返します。

source: X scrolling offset of background `bg`.
de: X Scrolling Offset des Hintergrunds `bg`.
es: Desplazamiento en X del fondo `bg`.
fr: Décalage de défilement X de l'arrière-plan `bg`.
ja: 背景 `bg`のXスクロールオフセット。

source: Returns the vertical scrolling offset of a given background layer.
de: Gibt den vertikalen Scrolling-Offset einer bestimmten Hintergrundschicht zurück.
es: Devuelve el desplazamiento vertical de una capa de fondo dada.
fr: Renvoie le décalage de défilement vertical d'un calque d'arrière-plan donné.
ja: 指定された背景レイヤーの垂直スクロールオフセットを返します。

source: Y scrolling offset of background `bg`.
de: Y Scrolling-Offset des Hintergrunds `BG`.
es: Desplazamiento en Y del fondo `bg`.
fr: Décalage de défilement Y de l'arrière-plan `bg`.
ja: 背景 `bg`のYスクロールオフセット。

source: Changes the color scheme.
de: Ändert das Farbschema.
es: Cambia el esquema de color.
fr: Modifie le jeu de couleurs.
ja: 配色を変更します。

source: The color scheme is a set of colors that are used to print system messages and BASIC program listings. It also contains the default foreground and background colors.
de: Das Farbschema besteht aus einer Reihe von Farben, die zum Drucken von Systemmeldungen und BASIC-Programmlisten verwendet werden. Es enthält auch die Standardfarben für Vordergrund und Hintergrund.
es: El esquema de color es un conjunto de colores que se utilizan para imprimir mensajes del sistema y listados de programas BÁSICOS. También contiene los colores de primer plano y de fondo predeterminados.
fr: Le jeu de couleurs est un ensemble de couleurs utilisées pour imprimer les messages système et les listes de programmes BASIC. Il contient également les couleurs de premier plan et d'arrière-plan par défaut.
ja: 配色は、システムメッセージとBASICプログラムリストを印刷するために使用される色のセットです。また、デフォルトの前景色と背景色も含まれています。

source: color code [`0` to `{CONFIG_COLS_m1}`]
de: Farbcode [`0` bis `{CONFIG_COLS_m1} `]
es: código de color [`0` a `{CONFIG_COLS_m1} `]
fr: code couleur [`0` à `{CONFIG_COLS_m1}`]
ja: カラーコード[`0`から`{CONFIG_COLS_m1}`]

source: red component [0 to 255]
de: rote Komponente [0 bis 255]
es: componente rojo [0 a 255]
fr: composante rouge [0 à 255]
ja: 赤い成分[0から255]

source: green component [0 to 255]
de: grüne Komponente [0 bis 255]
es: componente verde [0 a 255]
fr: composante verte [0 à 255]
ja: 緑の成分[0から255]

source: blue component [0 to 255]
de: blaue Komponente [0 bis 255]
es: componente azul [0 a 255]
fr: composant bleu [0 à 255]
ja: 青い成分[0から255]

source: Default background
de: Standardhintergrund
es: Fondo predeterminado
fr: Arrière-plan par défaut
ja: デフォルトの背景

source: Default foreground
de: Standardvordergrund
es: Primer plano predeterminado
fr: Premier plan par défaut
ja: デフォルトのフォアグラウンド

source: Syntax: BASIC keywords
de: Syntax: BASIC-Schlüsselwörter
es: Sintaxis: Palabras clave BASIC
fr: Syntaxe: mots-clés BASIC
ja: 構文：BASICキーワード

source: Syntax: line numbers
de: Syntax: Zeilennummern
es: Sintaxis: números de línea
fr: Syntaxe: numéros de ligne
ja: 構文：行番号

source: Syntax: numbers
de: Syntax: Zahlen
es: Sintaxis: números
fr: Syntaxe: nombres
ja: 構文:数字

source: Syntax: global variables
de: Syntax: globale Variablen
es: Sintaxis: variables globales
fr: Syntaxe: variables globales
ja: 構文：グローバル変数

source: Syntax: local variables and arguments
de: Syntax: lokale Variablen und Argumente
es: Sintaxis: variables y argumentos locales
fr: Syntaxe: variables locales et arguments
ja: 構文：ローカル変数と引数

source: Syntax: operands
de: Syntax: Operanden
es: Sintaxis: operandos
fr: Syntaxe: opérandes
ja: 構文：オペランド

source: Syntax: string constants
de: Syntax: String-Konstanten
es: Sintaxis: constantes de cadena
fr: Syntaxe: constantes de chaîne
ja: 構文：文字列定数

source: Syntax: procedure names
de: Syntax: Prozedurnamen
es: Sintaxis: nombres de procedimientos
fr: Syntaxe: noms de procédure
ja: 構文：プロシージャ名

source: Syntax: comments
de: Syntax: Kommentare
es: Sintaxis: comentarios
fr: Syntaxe: commentaires
ja: 構文：コメント

source: Default border color
de: Standardrandfarbe
es: Color de borde predeterminado
fr: Couleur de bordure par défaut
ja: デフォルトの境界線の色

source: * Unlike the `COLOR` command, `CONFIG COLOR` requires the colors to be given in RGB format; this is to ensure that the color scheme works with all YUV colorspaces.
de: * Im Gegensatz zum Befehl `COLOR` müssen für `CONFIG COLOR` die Farben im RGB-Format angegeben werden. Dies soll sicherstellen, dass das Farbschema mit allen YUV-Farbräumen funktioniert.
es: * A diferencia del comando `COLOR`, `CONFIG COLOR` requiere que los colores se den en formato RGB; esto es para asegurar que el esquema de color funcione con todos los espacios de color YUV.
fr: * Contrairement à la commande `COLOR`,` CONFIG COLOR` nécessite que les couleurs soient données au format RVB; cela permet de garantir que la palette de couleurs fonctionne avec tous les espaces de couleurs YUV.
ja: * `COLOR`コマンドとは異なり、`CONFIG COLOR`では色をRGB形式で指定する必要があります。これは、配色がすべてのYUVカラースペースで機能することを保証するためです。

source: * To set the current color scheme as the default, use `SAVE CONFIG`.
de: * Um das aktuelle Farbschema als Standard festzulegen, verwenden Sie `SAVE CONFIG`.
es: * Para establecer el esquema de color actual como predeterminado, use `SAVE CONFIG`.
fr: * Pour définir le jeu de couleurs actuel par défaut, utilisez `SAVE CONFIG`.
ja: *現在の配色をデフォルトとして設定するには、`SAVECONFIG`を使用します。

source: The default border color is not used.
de: Die Standardrahmenfarbe wird nicht verwendet.
es: No se utiliza el color de borde predeterminado.
fr: La couleur de bordure par défaut n'est pas utilisée.
ja: デフォルトの境界線の色は使用されません。

source: Changes configuration options.
de: Ändert die Konfigurationsoptionen.
es: Cambia las opciones de configuración.
fr: Modifie les options de configuration.
ja: 構成オプションを変更します。

source: option value
de: Optionswert
es: valor de la opción
fr: valeur d'option
ja: オプション値

source: The following options exist:
de: Folgende Optionen stehen zur Verfügung:
es: Existen las siguientes opciones:
fr: Les options suivantes existent:
ja: 次のオプションが存在します。

source: * `0`: TV norm + Sets the TV norm to NTSC (`0`), PAL (`1`) or PAL60 (`2`). + WARNING: This configuration option does not make much sense; the available TV norm depends on the installed color burst crystal and is automatically detected; PAL60 mode is not currently implemented. + The semantics of this option are therefore likely to change in the future.
de: * `0`: TV-Norm + Setzt die TV-Norm auf NTSC (`0`), PAL (`1`) oder PAL60 (` 2`). + WARNUNG: Diese Konfigurationsoption ist wenig sinnvoll. Die verfügbare TV-Norm hängt vom installierten Farbburstkristall ab und wird automatisch erkannt. Der PAL60-Modus ist derzeit nicht implementiert. + Die Semantik dieser Option wird sich daher wahrscheinlich in Zukunft ändern.
es: * `0`: Norma de TV + Establece la norma de TV en NTSC (`0`), PAL (`1`) o PAL60 (`2`). + ADVERTENCIA: Esta opción de configuración no tiene mucho sentido; la norma de TV disponible depende del cristal de ráfaga de color instalado y se detecta automáticamente; El modo PAL60 no está implementado actualmente. + Por tanto, es probable que la semántica de esta opción cambie en el futuro.
fr: * `0` : Norme TV + Règle la norme TV sur NTSC (`0`), PAL (`1`) ou PAL60 (`2`). + ATTENTION : Cette option de configuration n'a pas beaucoup de sens ; la norme TV disponible dépend du cristal de rafale de couleur installé et est automatiquement détectée ; Le mode PAL60 n'est actuellement pas implémenté. + La sémantique de cette option est donc susceptible de changer dans le futur.
ja: * `0`：TVノルム+ TVノルムをNTSC（`0`）、PAL （`1`）、またはPAL60（`2`）に設定します。+警告：この構成オプションはあまり意味がありません。利用可能なTV基準は、インストールされているカラーバーストクリスタルによって異なり、自動的に検出されます。PAL60モードは現在実装されていません。+したがって、このオプションのセマンティクスは将来変更される可能性があります。

source: * `1`: Keyboard layout + Four different keyboard layouts are supported: + `0` (Japanese), `1` (US English, default), `2` (German), `3` (French) and `4` (Spanish).
de: * `1`: Tastaturlayout + Es werden vier verschiedene Tastaturlayouts unterstützt: + `0` (Japanisch), `1` (US-Englisch, Standard), `2` (Deutsch), `3` (Französisch) und `4` (Spanisch).
es: * `1`: Diseño de teclado + Se admiten cuatro diseños de teclado diferentes: + `0` (japonés), `1` (inglés de EE. UU., Predeterminado), `2` (alemán), `3` (francés) y `4` (Español).
fr: * `1`: Disposition du clavier + Quatre dispositions de clavier différentes sont prises en charge: + `0` (japonais), `1` (anglais américain, par défaut), `2` (allemand), `3` (français) et `4` (Espanol).
ja: * `1`：キーボードレイアウト+ 4つの異なるキーボードレイアウトがサポートされています：+ `0`（日本語）、 `1`（米国英語、デフォルト）、`2`（ドイツ語）、 `3`（フランス語）、`4` （スペイン語）。

source: * `2`: Interlacing + Sets the video output to progressive (`0`) or interlaced (`1`). A change in this option will become effective on the next screen mode change. + WARNING: The intention of this option is to provide an interlaced signal to TVs that do not handle a progressive signal well. So far, no displays have turned up that require it, so it may be removed and/or replaced with a different option in future releases.
de: * `2`: Interlacing + Setzt die Videoausgabe auf progressiv (`0`) oder interlaced (`1`). Eine Änderung dieser Option wird bei der nächsten Änderung des Bildschirmmodus wirksam. + WARNUNG: Mit dieser Option soll ein Interlaced-Signal für Fernsehgeräte bereitgestellt werden, die ein progressives Signal nicht gut verarbeiten. Bisher sind keine Anzeigen aufgetaucht, die dies erfordern. Daher kann es in zukünftigen Versionen entfernt und / oder durch eine andere Option ersetzt werden.
es: * `2`: Entrelazado + Establece la salida de vídeo en progresivo (`0`) o entrelazado (`1`). Un cambio en esta opción se hará efectivo en el próximo cambio de modo de pantalla. + ADVERTENCIA: La intención de esta opción es proporcionar una señal entrelazada a televisores que no manejan bien una señal progresiva. Hasta ahora, no ha aparecido ninguna pantalla que lo requiera, por lo que puede ser eliminado y / o reemplazado con una opción diferente en versiones futuras.
fr: * `2`: Entrelacement + Règle la sortie vidéo sur progressive (`0`) ou entrelacée (`1`). Un changement dans cette option deviendra effectif au prochain changement de mode d'écran. + AVERTISSEMENT: le but de cette option est de fournir un signal entrelacé aux téléviseurs qui ne gèrent pas bien un signal progressif. Jusqu'à présent, aucun affichage ne le nécessite, il peut donc être supprimé et / ou remplacé par une option différente dans les versions futures.
ja: * `2`：インターレース+ビデオ出力をプログレッシブ（`0`）またはインターレース（`1`）に設定します。このオプションの変更は、次の画面モードの変更時に有効になります。+警告：このオプションの目的は、プログレッシブ信号を適切に処理しないテレビにインターレース信号を提供することです。これまでのところ、それを必要とするディスプレイは表示されていないため、将来のリリースで削除したり、別のオプションに置き換えたりする可能性があります。

source: * `3`: Luminance low-pass filter + This option enables (`1`) or disables (`0`, default) the video luminance low-pass filter. The recommended setting depends on the properties of the display device used. + Many recent TVs are able to handle high resolutions well; with such devices, it is recommended to turn the low-pass filter off to achieve a more crisp display. + On other (usually older) TVs, high-resolution images may cause excessive color artifacting (a "rainbow" effect) or flicker; with such devices, it is recommended to turn the low-pass filter on to reduce these effects, at the expense of sharpness.
de: * `3`: Luminanz-Tiefpassfilter + Diese Option aktiviert (`1`) oder deaktiviert (`0`, Standard) den Videoluminanz-Tiefpassfilter. Die empfohlene Einstellung hängt von den Eigenschaften des verwendeten Anzeigegeräts ab. + Viele neuere Fernsehgeräte können mit hohen Auflösungen gut umgehen. Bei solchen Geräten wird empfohlen, den Tiefpassfilter auszuschalten, um eine klarere Anzeige zu erzielen. + Auf anderen (normalerweise älteren) Fernsehgeräten können hochauflösende Bilder übermäßige Farbartefakte (ein "Regenbogen"-Effekt) oder Flimmern verursachen. Bei solchen Geräten wird empfohlen, den Tiefpassfilter einzuschalten, um diese Effekte auf Kosten der Schärfe zu verringern.
es: * `3`: Filtro de paso bajo de luminancia + Esta opción habilita (`1`) o deshabilita (`0`, predeterminado) el filtro de paso bajo de luminancia de video. La configuración recomendada depende de las propiedades del dispositivo de visualización utilizado. + Muchos televisores recientes pueden manejar bien altas resoluciones; con estos dispositivos, se recomienda apagar el filtro de paso bajo para lograr una visualización más nítida. + En otros televisores (por lo general más antiguos), las imágenes de alta resolución pueden provocar una alteración excesiva del color (un efecto de "arco iris") o parpadeo; con estos dispositivos, se recomienda activar el filtro de paso bajo para reducir estos efectos, a expensas de la nitidez.
fr: * `3`: Filtre passe-bas de luminance + Cette option active (`1`) ou désactive (`0`, par défaut) le filtre passe-bas de luminance vidéo. Le paramètre recommandé dépend des propriétés du périphérique d'affichage utilisé. + De nombreux téléviseurs récents sont capables de bien gérer les résolutions élevées; avec de tels appareils, il est recommandé de désactiver le filtre passe-bas pour obtenir un affichage plus net. + Sur d'autres téléviseurs (généralement plus anciens), les images haute résolution peuvent provoquer des artefacts de couleur excessifs (un effet `arc-en-ciel`) ou un scintillement; avec de tels appareils, il est recommandé d'activer le filtre passe-bas pour réduire ces effets, au détriment de la netteté.
ja: * `3`：輝度ローパスフィルター+このオプションは、ビデオ輝度ローパスフィルターを有効（`1`）または無効（ `0`、デフォルト）にします。推奨される設定は、使用するディスプレイデバイスのプロパティによって異なります。+最近のテレビの多くは、高解像度をうまく処理できます。このようなデバイスでは、より鮮明な表示を実現するために、ローパスフィルターをオフにすることをお勧めします。+他の（通常は古い）テレビでは、高解像度の画像が過度の色のアーティファクト（「虹」効果）またはちらつきを引き起こす可能性があります。このようなデバイスでは、シャープネスを犠牲にして、これらの影響を減らすためにローパスフィルターをオンにすることをお勧めします。

source: * `4`: Power-on screen mode [`1` (default) to `10`] + Sets the screen mode the system defaults to at power-on.
de: * `4`: Bildschirmmodus beim Einschalten [`1` (Standard) auf `10`] + Legt den Bildschirmmodus fest, den das System beim Einschalten standardmäßig verwendet.
es: * `4`: Modo de pantalla de encendido [`1` (predeterminado) a `10`] + Establece el modo de pantalla que el sistema tiene por defecto al encender.
fr: * `4`: Mode écran de mise sous tension [`1` (par défaut) à `10`] + Définit le mode d'écran sur lequel le système est par défaut à la mise sous tension.
ja: * `4`：電源投入時の画面モード[`1`（デフォルト）を `10`] +電源投入時のシステムのデフォルトの画面モードを設定します。

source: * `5`: Power-on screen font [`0` (default) to `{NUM_FONTS_m1}`] + Sets the screen font the system defaults to at power-on.
de: * `5`: Einschalt-Bildschirmschrift [`0` (Standard) auf `{NUM_FONTS_m1}`] + Legt die Bildschirmschrift fest, die das System beim Einschalten standardmäßig verwendet.
es: * `5`: Fuente de la pantalla de encendido [`0` (predeterminado) a `{NUM_FONTS_m1}`] + Establece la fuente de pantalla que el sistema tiene por defecto al encender.
fr: * `5`: Police de l'écran à la mise sous tension [`0` (par défaut) à `{NUM_FONTS_m1}`] + Définit la police de l'écran que le système utilise par défaut à la mise sous tension.
ja: * `5`：電源投入時の画面フォント[`0`（デフォルト）を `{NUM_FONTS_m1}`] +電源投入時にシステムがデフォルトで設定する画面フォントを設定します。

source: * `6`: Power-on cursor color [`0` to `255`] + Sets the cursor color the system defaults to at power-on.
de: * `6`: Cursorfarbe beim Einschalten [`0` bis `255`] + Legt die Cursorfarbe fest, die das System beim Einschalten standardmäßig verwendet.
es: * `6`: Color del cursor de encendido [`0` a `255`] + Establece el color del cursor que el sistema tiene por defecto al encender.
fr: * `6`: Couleur du curseur à la mise sous tension [`0` à `255`] + Définit la couleur du curseur par défaut du système à la mise sous tension.
ja: * `6`：電源投入時のカーソルの色[`0`から`255`] +電源投入時にシステムがデフォルトで設定するカーソルの色を設定します。

source: * `7`: Beeper sound volume [`0` to `15` (default)] + Sets the volume of the "beeper" sound engine, which applies, among other things, to the start-up jingle.
de: * `7`: Beeper-Lautstärke [`0` bis `15` (Standard)] + Stellt die Lautstärke der" Beeper "-Sound-Engine ein, die unter anderem für den Start-Jingle gilt.
es: * `7`: Volumen del sonido del zumbador [`0` a `15` (predeterminado)] + Establece el volumen del motor de sonido del" zumbador ", que se aplica, entre otras cosas, al tintineo de inicio.
fr: * `7`: Volume du bip sonore [`0` à `15` (par défaut)] + Règle le volume du moteur sonore" bip ", qui s'applique, entre autres, au jingle de démarrage.
ja: * `7`：ブザーの音量[`0`から`15`（デフォルト）] +起動時のジングルなどに適用される「ブザー」サウンドエンジンの音量を設定します。

source: * `8`: Screen line adjustment [`-128` to `128`, default: `0`] Adjusts the number of screen lines. A positive value adds lines, a negative value subtracts them. + This option may be useful to mitigate issues with color artifacting and flicker on some devices. + WARNING: It is not clear if this option is useful in practice, and it may be removed in future releases.
de: * `8`: Einstellung der Bildschirmzeilen [`-128` bis `128`, Standard: `0`] Stellt die Anzahl der Bildschirmzeilen ein. Ein positiver Wert addiert Linien, ein negativer Wert subtrahiert sie. + Diese Option kann nützlich sein, um Probleme mit Farbartefakten und Flimmern auf einigen Geräten zu verringern. + WARNUNG: Es ist nicht klar, ob diese Option in der Praxis nützlich ist, und sie wird möglicherweise in zukünftigen Versionen entfernt.
es: * `8`: Ajuste de la línea de la pantalla [`-128` a `128`, predeterminado:` 0`] Ajusta el número de líneas de la pantalla. Un valor positivo suma líneas, un valor negativo las resta. + Esta opción puede ser útil para mitigar problemas con artefactos de color y parpadeo en algunos dispositivos. + ADVERTENCIA: No está claro si esta opción es útil en la práctica y puede eliminarse en futuras versiones.
fr: * `8`: Réglage de la ligne d'écran [`-128` à `128`, par défaut: `0`] Règle le nombre de lignes d'écran. Une valeur positive ajoute des lignes, une valeur négative les soustrait. + Cette option peut être utile pour atténuer les problèmes d'artefact de couleur et de scintillement sur certains appareils. + AVERTISSEMENT: il n'est pas clair si cette option est utile dans la pratique, et elle pourrait être supprimée dans les versions futures.
ja: * `8`：画面の行調整[`-128`から `128`、デフォルト：`0`]画面の行数を調整します。正の値は線を追加し、負の値は線を減算します。 + このオプションは、一部のデバイスでの色のアーティファクトやちらつきの問題を軽減するのに役立つ場合があります。 + 警告：このオプションが実際に役立つかどうかは明確ではなく、将来のリリースで削除される可能性があります。

source: * `9`: Keyword separation optional [`0` or `1` (default)] + Controls if BASIC keywords need to be separated from other language elements containing alphanumeric characters with a space (`1`), or if they can be adjacent to those like in traditional BASIC dialects (`0`).
de: * `9`: Schlüsselworttrennung optional [`0` oder `1` (Standard)] + Steuert, ob BASIC-Schlüsselwörter von anderen Sprachelementen mit alphanumerischen Zeichen mit einem Leerzeichen (`1`) getrennt werden müssen oder ob dies möglich ist neben denen wie in traditionellen BASIC-Dialekten (`0`).
