Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: * `addr` must be mapped writable and must allow byte-wise access.
de: * `addr` muss beschreibbar zugeordnet sein und byteweisen Zugriff ermöglichen.
es: * `addr` debe ser mapeado escribible y debe permitir el acceso en forma de bytes.
fr: * `addr` doit être mappé en écriture et doit permettre un accès par octet.
ja: * `addr`は書き込み可能にマップされ、バイト単位のアクセスを許可する必要があります。

source: A random fractional number between 0 and 1. A specific value of `mod` will always yield the same random number.
de: Eine zufällige Bruchzahl zwischen 0 und 1. Ein bestimmter Wert von `mod` ergibt immer die gleiche Zufallszahl.

source: A random fractional number between 0 and 1. A specific value of `mod` will always yield the same random number.
de: Eine zufällige Bruchzahl zwischen 0 und 1. Ein bestimmter Wert von `mod` ergibt immer die gleiche Zufallszahl.
es: Un número fraccionario aleatorio entre 0 y 1. Un valor específico de `mod` siempre producirá el mismo número aleatorio.
fr: Un nombre fractionnaire aléatoire entre 0 et 1. Une valeur spécifique de `mod` donnera toujours le même nombre aléatoire.

source: * Programs are saved without line numbers if `LINE OFF` is specified.
de: * Programme werden ohne Zeilennummern gespeichert, wenn `LINE OFF` angegeben ist.
es: * Los programas se guardan sin números de línea si se especifica `LINE OFF`.
fr: * Les programmes sont enregistrés sans numéros de ligne si `LINE OFF` est spécifié.

source: * Programs are saved with line numbers if `LINE ON` is specified.
de: * Programme werden mit Zeilennummern gespeichert, wenn `LINE ON` angegeben ist.
es: * Los programas se guardan con números de línea si se especifica `LINE ON`.
fr: * Les programmes sont enregistrés avec les numéros de ligne si `LINE ON` est spécifié.

source: * If neither `LINE OFF` nor `LINE ON` are specified, line numbers are included if any were present when the program was loaded into memory. If a program has been entered entirely in direct mode, it will be saved with line numbers.
de: * Wenn weder „LINE OFF“ noch „LINE ON“ angegeben sind, werden Zeilennummern einbezogen, sofern diese vorhanden waren, als das Programm in den Speicher geladen wurde. Wurde ein Programm vollständig im Direktmodus eingegeben, wird es mit Zeilennummern gespeichert.
es: * Si no se especifican `LINE OFF` ni `LINE ON`, se incluyen los números de línea si alguno estaba presente cuando el programa se cargó en la memoria. Si un programa se ha ingresado completamente en modo directo, se guardará con números de línea.
fr: * Si ni `LINE OFF` ni `LINE ON` ne sont spécifiés, les numéros de ligne sont inclus s'ils étaient présents lorsque le programme a été chargé en mémoire. Si un programme a été saisi entièrement en mode direct, il sera sauvegardé avec les numéros de ligne.

source: Slightly smaller than mode 1; helpful if the display does not show the entirety of mode 1.
de: Etwas kleiner als Modus 1; hilfreich, wenn das Display nicht den gesamten Modus 1 anzeigt.
es: Ligeramente más pequeño que el modo 1; útil si la pantalla no muestra todo el modo 1.
fr: Légèrement plus petit que le mode 1 ; utile si l’écran n’affiche pas l’intégralité du mode 1.

source: The maximum value for `second` is 61 and not 59 to accommodate a leap second.
de: Der Maximalwert für `second` beträgt 61 und nicht 59, um eine Schaltsekunde zu ermöglichen.
es: El valor máximo para `second` es 61 y no 59 para dar cabida a un segundo intercalar.
fr: La valeur maximale pour `second` est de 61 et non de 59 pour permettre une seconde intercalaire.

source: * `command`-only commands are executed using `execl("/bin/sh", "sh", ...)`.
de: * Befehle, die nur aus `command` bestehen, werden mit `execl("/bin/sh", "sh", ...)` ausgeführt.
es: * Los comandos de solo `command` se ejecutan usando `execl("/bin/sh", "sh", ...)`.
fr: * Les commandes `command`-seulement sont exécutées en utilisant `execl("/bin/sh", "sh", ...)`.

source: Major device number
de: Hauptgerätenummer
es: Número de dispositivo mayor
fr: Numéro d'appareil majeur

source: Minor device number
de: Nebengerätenummer
es: Número de dispositivo menor
fr: Numéro de périphérique mineur
ja: マイナーデバイス番号

source: system type; `0` for original (ESP8266), `1` for Shuttle (ESP32), `2` for NG (H3 bare-metal), `3` for LT (Linux-based)
de: Systemtyp; `0` für Original (ESP8266), `1` für Shuttle (ESP32), `2` für NG (H3 Bare-Metal), `3` für LT (Linux-basiert)
es: tipo de sistema; `0` para original (ESP8266), `1` para Shuttle (ESP32), `2` para NG (H3 bare-metal), `3` para LT (basado en Linux)
fr: Type de système; `0` pour l'original (ESP8266), `1` pour Shuttle (ESP32), `2` pour NG (H3 bare-metal), `3` pour LT (basé sur Linux)

source: ASCII code
es: código ASCII
fr: Code ASCII

source: * `11`: Language + The following languages are supported for system messages: + `0` (US English, default), `1` (German), `2` (French), `3` (Spanish).
es: * `11`: Idioma + Los siguientes idiomas son compatibles con los mensajes del sistema: + `0` (inglés de EE. UU., Predeterminado), `1` (alemán), `2` (francés), `3` (español).
fr: * `11`: Langue + Les langues suivantes sont prises en charge pour les messages système: + `0` (anglais américain, par défaut), `1` (allemand), `2` (français), `3` (espagnol).

source: Joystick/joypad Controller
es: Joystick / controlador de joypad
fr: Contrôleur de joystick / joypad
ja: ジョイスティック/ジョイパッドコントローラー

source: kbd:[Start] button
es: kbd:botón [Inicio]
fr: kbd:bouton [Démarrer]
ja: kbd:[スタート]ボタン

source: kbd:[Select] button
es: kbd:botón [Seleccionar]
fr: kbd:bouton [Sélectionner]

source: kbd:[NumLock]
es: kbd:[Bloq Num]
fr: kbd:[Verr Num]

source: kbd:[Home]
es: kbd:[Inicio]
fr: kbd:[Accueil]
ja: kbd:[ホーム]

source: kbd:[Enter]
es: kbd:[Entrar]
fr: kbd:[Entrée]

source: Modulus operator.
es: Operador de módulo.
fr: Opérateur de module.
ja: モジュラス演算子

source: Unicode codepoint
es: Punto de código Unicode
fr: Point de code Unicode
ja: Unicodeコードポイント

source: Compiles and, optionally, loads or runs C programs.
es: Compila y, opcionalmente, carga o ejecuta programas C.
fr: Compile et, éventuellement, charge ou exécute des programmes C.
ja: Cプログラムをコンパイルし、オプションでロードまたは実行します。

source: * DOS: 2048
fr: *OS : 2048

source: * `0`: TV norm
es: * `0`: norma de televisión
fr: * `0` : norme TV

source: * `2`: Interlacing
es: * `2`: Entrelazado
fr: * `2` : Entrelacement

source: `0` (1920x1080 HDMI), `1` (1280x1024 DVI), `2` (1280x720 HDMI), `3`
fr: `0` (HDMI 1920 x 1080), `1` (DVI 1280 x 1024), `2` (HDMI 1280 x 720), `3`

source: (1920x1200 HDMI).
fr: (HDMI 1920 x 1200).

source: tile width, pixels [`8` (default) to `255`]
fr: largeur des tuiles, pixels [`8` (par défaut) à `255`]

source: tile height, pixels [`8` (default) to `255`]
fr: hauteur des tuiles, pixels [`8` (par défaut) à `255`]

source: * Redirection will automatically be reset if a file redirected to is closed (either explicitly or implicitly, by opening a new file using the currently used file number), or when returning to the command prompt.
fr: * La redirection sera automatiquement réinitialisée si un fichier redirigé vers est fermé (soit explicitement, soit implicitement, en ouvrant un nouveau fichier en utilisant le numéro de fichier actuellement utilisé), ou lors du retour à l'invite de commande.

source: * If `-1` is used as `file_num`, redirection is turned off.
fr: * Si `-1` est utilisé comme `file_num`, la redirection est désactivée.

source: Returns the current file number for screen I/O redirection to a file.
fr: Renvoie le numéro de fichier actuel pour la redirection des E/S d'écran vers un fichier.

source: `0` for OUTPUT, `1` for INPUT
fr: `0` pour OUTPUT (sortie), `1` pour INPUT (entrée)

source: File number, or `-1` for screen output
fr: Numéro de fichier, ou `-1` pour la sortie à l'écran

source: * `13`: Name of audio device to be used.
fr: * `13` : Nom du périphérique audio à utiliser.

source: When set to "default" (which is, unsurprisingly, the default), an appropriate audio device will be chosen automatically. Otherwise, the specified audio device will be used. To find out what audio devices are available you can use the `SYS$(1, index)` function.
fr: Lorsqu'il est défini sur « default » (qui est, sans surprise, la valeur par défaut), un périphérique audio approprié sera choisi automatiquement. Sinon, le périphérique audio spécifié sera utilisé. Pour savoir quels périphériques audio sont disponibles, vous pouvez utiliser la fonction `SYS$(1, index)`.

source: number of frames to be skipped [`0` (default) to `59`]
fr: nombre d'images à ignorer [`0` (par défaut) à `59`]

source: system type; `0` for original (ESP8266), `1` for Shuttle (ESP32), `2` for NG (H3 bare-metal), `3` for LT (Linux/SDL-based), `4` for RX (Linux/bare-metal hybrid), `5` for Windows, `6` for MacOS.
fr: Type de système; `0` pour l'original (ESP8266), `1` pour Shuttle (ESP32), `2` pour NG (H3 bare-metal), `3` pour LT (Linux/SDL), `4` pour RX (Linux /hybride bare-metal), `5` pour Windows, `6` pour MacOS.

source: number of the subitem to be retrieved
fr: numéro du sous-élément à récupérer

source: The following internal information can be retrieved using `SYS$()`:
fr: Les informations internes suivantes peuvent être récupérées à l'aide de `SYS$()` :

source: audio device currently used
fr: périphérique audio actuellement utilisé

source: name of the audio device `index`
fr: nom du périphérique audio `index`

source: * The audio device names provided are only meaningful on LT platforms. Other platforms always return the string "default".
fr: * Les noms de périphériques audio fournis n'ont de sens que sur les plateformes LT. Les autres plateformes renvoient toujours la chaîne « default ».

source: CODES
es: CODIGOS
ja: コード

source: kbd:[Pause]
es: kbd:[Pausa]

source: * `CHR$(0)` returns an empty string.
ja: * `CHR$(0)`は空の文字列を返します。

source: kbd:[App]
ja: kbd:[アプリ]

source: kbd:[Henkan]
ja: kbd:[ヘンカン]

source: kbd:[Muhenkan]
ja: kbd:[ムヘンカン]

source: kbd:[Tab]
ja: kbd:[タブ]

source: HP 100 LX font, 6x8 pixels (default)
ja: HP 100 LXフォント、6x8ピクセル（デフォルト）

source: Loads a TrueType font from a file and activates it.
ja: ファイルからTrueTypeフォントをロードし、アクティブ化します。

source: font width
ja: フォント幅

source: font height
ja: フォントの高さ

source: Returns the font index of the loaded font in `RET(0)`.
ja: ロードされたフォントのフォントインデックスを `RET(0)`に返します。
