Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: Checks for available bytes on the serial port.
de: Überprüft die serielle Schnittstelle auf verfügbare Bytes.
es: Comprueba los bytes disponibles en el puerto serie.
fr: Vérifie les octets disponibles sur le port série.
ja: シリアルポートで使用可能なバイトをチェックします。

source: Number of bytes available to read.
de: Anzahl der zum Lesen verfügbaren Bytes.
es: Número de bytes disponibles para leer.
fr: Nombre d'octets disponibles en lecture.
ja: 読み取ることができるバイト数。

source: Sends data to an SPI device.
de: Sendet Daten an ein SPI-Gerät.
es: Envía datos a un dispositivo SPI.
fr: Envoie des données à un appareil SPI.
ja: SPIデバイスにデータを送信します。

source: Configures the SPI controller.
de: Konfiguriert den SPI-Controller.
es: Configura el controlador SPI.
fr: Configure le contrôleur SPI.
ja: SPIコントローラーを構成します。

source: data bit order [`0` = LSB first, `1` = MSB first]
de: Datenbitreihenfolge [`0` = LSB zuerst, `1` = MSB zuerst]
es: orden de bits de datos [`0` = LSB primero, `1` = MSB primero]
fr: Ordre des bits de données [`0` = LSB en premier, `1` = MSB en premier]
ja: データビット順序[`0` = LSBファースト、`1` = MSBファースト]

source: transfer frequency in Hz
de: Übertragungsfrequenz in Hz
es: frecuencia de transferencia en Hz
fr: fréquence de transfert en Hz
ja: 転送周波数（Hz）

source: SPI mode [`0` to `3`]
de: SPI-Modus [`0` bis `3`]
es: Modo SPI [`0` a `3`]
fr: Mode SPI [`0` à `3`]
ja: SPIモード[`0`から`3`]

source: Send and receive data to and from an SPI device.
de: Senden und Empfangen von Daten zu und von einem SPI-Gerät.
es: Envíe y reciba datos desde y hacia un dispositivo SPI.
fr: Envoyez et recevez des données vers et depuis un appareil SPI.
ja: SPIデバイスとの間でデータを送受信します。

source: Returns a string containing the received data that is of the same length as out$.
de: Gibt einen String zurück, der die empfangenen Daten enthält und dieselbe Länge wie out$ hat.
es: Devuelve una cadena que contiene los datos recibidos que tienen la misma longitud que out$.
fr: Renvoie une chaîne contenant les données reçues de même longueur que out$.
ja: out$と同じ長さの受信データを含む文字列を返します。

source: Returns the sine of a specified angle.
de: Gibt den Sinus eines bestimmten Winkels zurück.
es: Devuelve el seno de un ángulo especificado.
fr: Renvoie le sinus d'un angle spécifié.
ja: 指定された角度の正弦を返します。

source: an angle expressed in radians
de: ein Winkel im Bogenmaß
es: un ángulo expresado en radianes
fr: un angle exprimé en radians
ja: ラジアンで表される角度

source: Sine of `angle`.
de: Sinus von `Winkel`.
es: Seno de "ángulo".
fr: Sinus de `angle`.
ja: 「角度」の正弦

source: Returns the cosine of a specified angle.
de: Gibt den Cosinus eines bestimmten Winkels zurück.
es: Devuelve el coseno de un ángulo especificado.
fr: Renvoie le cosinus d'un angle spécifié.
ja: 指定された角度のコサインを返します。

source: Cosine of `angle`.
de: Kosinus von `Winkel`.
es: Coseno de "ángulo".
fr: Cosinus de `angle`.
ja: 「角度」の余弦

source: Returns _e_ raised to a specified power, where _e_ is the base of natural logarithms.
de: Gibt _e_ zurück, das auf eine bestimmte Potenz angehoben wurde, wobei _e_ die Basis natürlicher Logarithmen ist.
es: Devuelve _e_ elevado a una potencia especificada, donde _e_ es la base de los logaritmos naturales.
fr: Renvoie _e_ élevé à une puissance spécifiée, où _e_ est la base des logarithmes naturels.
ja: _e_を指定された累乗で返します。ここで、_e_は自然対数の底です。

source: Exponential value of `pow`.
de: Exponentialwert von `pow`.
es: Valor exponencial de "pow".
fr: Valeur exponentielle de `pow`.
ja: `pow`の指数値。

source: Arc tangent function.
de: Arcustangensfunktion.
es: Función arco tangente.
fr: Fonction tangente d'arc.
ja: アークタンジェント関数。

source: Arc tangent function of two variables.
de: Arcustangensfunktion zweier Variablen.
es: Función arco tangente de dos variables.
fr: Arc tangente fonction de deux variables.
ja: 2つの変数のアークタンジェント関数。

source: Calculates the principal value of the arc tangent of `y`/`x`, using the signs of the two arguments to determine the quadrant of the result.
de: Berechnet den Hauptwert der Bogen-Tangente von `y` / `x` unter Verwendung der Vorzeichen der beiden Argumente, um den Quadranten des Ergebnisses zu bestimmen.
es: Calcula el valor principal del arco tangente de `y` /` x`, usando los signos de los dos argumentos para determinar el cuadrante del resultado.
fr: Calcule la valeur principale de l'arc tangent de `y` / `x`, en utilisant les signes des deux arguments pour déterminer le quadrant du résultat.
ja: 結果の象限を決定するために2つの引数の符号を使用して、`y`/`x`の円弧接線の主値を計算します。

source: Arc tangent of `y`/`x`.
de: Arcustangens von `y` / `x`.
es: Arco tangente de `y` /` x`.
fr: Arc tangente de `y` / `x`.
ja: `y` /` x`の円弧接線。

source: Square root function.
de: Quadratwurzelfunktion.
es: Función de raíz cuadrada.
fr: Fonction racine carrée.
ja: 平方根関数。

source: any numeric expression larger than or equal to `0`
de: jeder numerische Ausdruck, der größer oder gleich `0` ist
es: cualquier expresión numérica mayor o igual a `0`
fr: toute expression numérique supérieure ou égale à `0`
ja: `0`以上の数値式

source: The nonnegative square root of `num`.
de: Die nichtnegative Quadratwurzel von `num`.
es: La raíz cuadrada no negativa de `num`.
fr: La racine carrée non négative de `num`.
ja: `num`の非負の平方根。

source: Tangent of `angle`.
de: Tangens von `Winkel`.
es: Tangente del "ángulo".
fr: Tangente de "angle".
ja: 「角度」の接線。

source: Returns the natural logarithm of a numeric expression.
de: Gibt den natürlichen Logarithmus eines numerischen Ausdrucks zurück.
es: Devuelve el logaritmo natural de una expresión numérica.
fr: Renvoie le logarithme naturel d'une expression numérique.
ja: 数式の自然対数を返します。

source: The natural logarithm of `num`.
de: Der natürliche Logarithmus von `num`.
es: El logaritmo natural de "num".
fr: Le logarithme naturel de `num`.
ja: `num`の自然対数。

source: Returns the largest integer less than or equal to a numeric expression.
de: Gibt die größte Ganzzahl zurück, die kleiner oder gleich einem numerischen Ausdruck ist.
es: Devuelve el entero más grande menor o igual que una expresión numérica.
fr: Renvoie le plus grand entier inférieur ou égal à une expression numérique.
ja: 数式以下の最大の整数を返します。

source: `num` rounded down to the nearest integer.
de: `num` auf die nächste ganze Zahl abgerundet.
es: `num` redondeado hacia abajo al número entero más cercano.
fr: `num` arrondi à l'entier inférieur le plus proche.
ja: `num`は最も近い整数に切り捨てられます。

source: Returns a value indicating the sign of a numeric expression.
de: Gibt einen Wert zurück, der das Vorzeichen eines numerischen Ausdrucks angibt.
es: Devuelve un valor que indica el signo de una expresión numérica.
fr: Renvoie une valeur indiquant le signe d'une expression numérique.
ja: 数式の符号を示す値を返します。

source: `1` if the expression is positive, `0` if it is zero, or `-1` if it is negative.
de: `1`, wenn der Ausdruck positiv ist, `0`, wenn er Null ist, oder `-1`, wenn er negativ ist.
es: `1` si la expresión es positiva, `0` si es cero o `-1` si es negativa.
fr: `1` si l'expression est positive, `0` si elle est égale à zéro ou `-1` si elle est négative.
ja: 式が正の場合は`1`、ゼロの場合は`0`、負の場合は「-1」。

source: Negation operator.
de: Negationsoperator.
es: Operador de negación.
fr: Opérateur de négation.
ja: 否定演算子。

source: The negative of `a`.
de: Das Negativ von `a`.
es: El negativo de "a".
fr: Le négatif de `a`.
ja: `a`の負数。

source: Identity operator.
de: Identitätsoperator.
es: Operador de identidad.
fr: Opérateur d'identité.
ja: 恒等演算子。

source: This operator serves decorative purposes only.
de: Dieser Operator dient nur dekorativen Zwecken.
es: Este operador solo tiene fines decorativos.
fr: Cet opérateur sert uniquement à des fins décoratives.
ja: このオペレーターは装飾目的でのみ機能します。

source: Multiplication operator.
de: Multiplikationsoperator.
es: Operador de multiplicación.
fr: Opérateur de multiplication.
ja: 乗算演算子。

source: Product of `a` and `b`.
de: Produkt von `a` und `b`.
es: Producto de `a` y `b`.
fr: Produit de `a` et `b`.
ja: `a`と`b`の積。

source: Quotient of `a` and `b`.
de: Quotient von `a` und `b`.
es: Cociente de `a` y `b`.
fr: Quotient de `a` et `b`.
ja: `a`と`b`の商。

source: Remainder of division of `a` and `b`.
de: Rest der Division von `a` und `b`.
es: Resto de la división de `a` y `b`.
fr: Reste de la division de `a` et `b`.
ja: `a`と`b`の除算の余り。

source: Bit-shift operator, left.
de: Bit-Shift-Operator, links.
es: Operador de cambio de bits, izquierda.
fr: Opérateur de décalage de bits, à gauche.
ja: ビットシフト演算子、左。

source: `a` converted to an unsigned integer and shifted left by `b` bits.
de: `a` wird in eine vorzeichenlose Ganzzahl konvertiert und um `b` Bits nach links verschoben.
es: `a` convertido en un entero sin signo y desplazado a la izquierda en bits` b`.
fr: `a` converti en un entier non signé et décalé vers la gauche de `b` bits.
ja: `a` を符号なし整数に変換し、`b` ビットだけ左にシフトする。

source: Bit-shift operator, right.
de: Bit-Shift-Operator, rechts.
es: Operador de cambio de bits, a la derecha.
fr: Opérateur de décalage de bits, à droite.
ja: ビットシフト演算子、右。

source: `a` converted to an unsigned integer and shifted right by `b` bits.
de: `a` wird in eine vorzeichenlose Ganzzahl konvertiert und um `b` Bits nach rechts verschoben.
es: `a` convertido en un entero sin signo y desplazado a la derecha en bits` b`.
fr: `a` converti en un entier non signé et décalé vers la droite de `b` bits.
ja: `a` は符号なし整数に変換され、`b` ビットだけ右にシフトされる。

source: Numeric addition operator.
de: Operator für numerische Additionen.
es: Operador de suma numérico.
fr: Opérateur d'addition numérique.
ja: 数値加算演算子。

source: Sum of `a` and `b`.
de: Summe von `a` und `b`.
es: Suma de `a` y `b`.
fr: Somme de `a` et `b`.
ja: `a`と`b`の合計。

source: Numeric subtraction operator.
de: Numerischer Subtraktionsoperator.
es: Operador de resta numérico.
fr: Opérateur de soustraction numérique.
ja: 数値減算演算子。

source: Equality operator.
de: Gleichheitsoperator.
es: Operador de igualdad.
fr: Opérateur d'égalité.
ja: 等式演算子。

source: `-1` if `a` and `b` are equal, `0` otherwise.
de: `-1` wenn` a` und` b` gleich sind, sonst `0`.
es: `-1` si `a` y `b` son iguales, `0` en caso contrario.
fr: `-1` si `a` et `b` sont égaux, `0` dans le cas contraire.
ja: `a`と`b`が等しい場合は `-1`、そうでない場合は`0`。

source: `-1` if `a` and `b` are not equal, `0` otherwise.
de: `-1`, wenn `a` und `b` nicht gleich sind, andernfalls `0`.
es: `-1` si `a` y `b` no son iguales, `0` en caso contrario.
fr: `-1` si `a` et `b` ne sont pas égaux, `0` dans le cas contraire.
ja: `a`と`b`が等しくない場合は `-1`、そうでない場合は`0`。

source: Less-than operator.
de: Weniger als Operator.
es: Operador menor que.
fr: Opérateur inférieur à.
ja: より小さい演算子。

source: `-1` if `a` is less than `b`, `0` otherwise.
de: `-1`, wenn `a` kleiner als `b` ist, andernfalls `0`.
es: `-1` si` a` es menor que `b`, `0` en caso contrario.
fr: `-1` si `a` est inférieur à `b`, `0` dans le cas contraire.
ja: `a`が`b`より小さい場合は `-1`、それ以外の場合は`0`。

source: `-1` if `a` is less than or equal to `b`, `0` otherwise.
de: `-1`, wenn `a` kleiner oder gleich `b` ist, andernfalls `0`.
es: `-1` si` a` es menor o igual que `b`, `0` en caso contrario.
fr: `-1` si `a` est inférieur ou égal à `b`, `0` dans le cas contraire.
ja: `a`が`b`以下の場合は `-1`、それ以外の場合は`0`。

source: Greater-than operator.
de: Größer als Operator.
es: Operador mayor que.
fr: Opérateur supérieur à.
ja: 大なり演算子。

source: `-1` if `a` is greater than `b`, `0` otherwise.
de: `-1`, wenn `a` größer als `b` ist, andernfalls `0`.
es: `-1` si` a` es mayor que `b`, `0` en caso contrario.
fr: `-1` si `a` est supérieur à `b`, `0` dans le cas contraire.
ja: `a`が`b`より大きい場合は `-1`、それ以外の場合は`0`。

source: Greater-than-or-equal operator.
de: Größer als oder gleich Operator.
es: Operador mayor o igual.
fr: Opérateur supérieur ou égal.

source: `-1` if `a` is greater than or equal to `b`, `0` otherwise.
de: `-1`, wenn `a` größer oder gleich `b` ist, andernfalls `0`.
es: `-1` si` a` es mayor o igual que `b`, `0` en caso contrario.
fr: `-1` si `a` est supérieur ou égal à `b`, `0` dans le cas contraire.
ja: `a`が`b`以上の場合は `-1`、それ以外の場合は`0`。

source: Bitwise inversion operator.
de: Bitweiser Inversionsoperator.
es: Operador de inversión bit a bit.
fr: Opérateur d'inversion au niveau du bit.
ja: ビットごとの反転演算子。

source: Bitwise inversion of `a`.
de: Bitweise Inversion von `a`.
es: Inversión bit a bit de "a".
fr: Inversion au niveau du bit de `a`.
ja: `a`のビット単位の反転。

source: Like most BASIC implementations, Engine BASIC does not have a dedicated "logical NOT" operator; instead, the bitwise operator is used.
de: Wie die meisten BASIC-Implementierungen verfügt Engine BASIC nicht über einen dedizierten "logischen NOT"-Operator. Stattdessen wird der bitweise Operator verwendet.
es: Como la mayoría de las implementaciones BASIC, Engine BASIC no tiene un operador "NOT lógico" dedicado; en su lugar, se utiliza el operador bit a bit.
fr: Comme la plupart des implémentations BASIC, Engine BASIC n'a pas d'opérateur "NON logique" dédié; à la place, l'opérateur au niveau du bit est utilisé.
ja: ほとんどのBASIC実装と同様に、EngineBASICには専用の「論理NOT」演算子がありません。代わりに、ビット演算子が使用されます。

source: Bitwise AND operator.
de: Bitweiser UND-Operator.
es: Operador AND bit a bit.
fr: Opérateur AND au niveau du bit.
ja: ビットごとのAND演算子。

source: Bitwise conjunction of `a` and `b`.
de: Bitweise Konjunktion von `a` und `b`.
es: Conjunción bit a bit de `a` y `b`.
fr: Conjonction au niveau du bit de `a` et `b`.
ja: `a`と`b`のビット単位の接続詞。

source: Like most BASIC implementations, Engine BASIC does not have a dedicated "logical AND" operator; instead, the bitwise operator is used.
de: Wie die meisten BASIC-Implementierungen verfügt Engine BASIC nicht über einen dedizierten "logischen UND"-Operator. Stattdessen wird der bitweise Operator verwendet.
es: Como la mayoría de las implementaciones de BASIC, Engine BASIC no tiene un operador "Y lógico" dedicado; en su lugar, se utiliza el operador bit a bit.
fr: Comme la plupart des implémentations BASIC, Engine BASIC n'a pas d'opérateur "AND logique" dédié; à la place, l'opérateur au niveau du bit est utilisé.
ja: ほとんどのBASIC実装と同様に、EngineBASICには専用の「論理AND」演算子がありません。代わりに、ビット演算子が使用されます。

source: Bitwise OR operator.
de: Bitweiser ODER-Operator.
es: Operador OR bit a bit.
fr: Opérateur OR au niveau du bit.
ja: ビットごとのOR演算子。

source: Bitwise inclusive disjunction of `a` and `b`.
de: Bitweise inklusive Disjunktion von `a` und `b`.
es: Disyunción inclusiva bit a bit de `a` y `b`.
fr: Disjonction inclusive au niveau du bit de `a` et `b`.
ja: `a`と`b`のビット単位の論理和。

source: Like most BASIC implementations, Engine BASIC does not have a dedicated "logical OR" operator; instead, the bitwise operator is used.
de: Wie die meisten BASIC-Implementierungen verfügt Engine BASIC nicht über einen dedizierten "logischen ODER"-Operator. Stattdessen wird der bitweise Operator verwendet.
es: Como la mayoría de las implementaciones BASIC, Engine BASIC no tiene un operador "lógico OR" dedicado; en su lugar, se utiliza el operador bit a bit.
fr: Comme la plupart des implémentations BASIC, Engine BASIC n'a pas d'opérateur "OR logique" dédié; à la place, l'opérateur au niveau du bit est utilisé.
ja: ほとんどのBASIC実装と同様に、EngineBASICには専用の「論理OR」演算子がありません。代わりに、ビット演算子が使用されます。

source: Bitwise exclusive-OR operator.
de: Bitweiser Exklusiv-ODER-Operator.
es: Operador OR exclusivo bit a bit.
fr: Opérateur OU exclusif au niveau du bit.
ja: ビット単位の排他的論理和演算子。

source: Bitwise exclusive disjunction of `a` and `b`.
de: Bitweise exklusive Disjunktion von `a` und `b`.
es: Disyunción exclusiva bit a bit de `a` y `b`.
fr: Disjonction exclusive au niveau du bit de `a` et `b`.
ja: `a`と`b`のビット単位の排他的論理和。

source: Plays a piece of music in Music Macro Language (MML) using the wavetable synthesizer.
de: Spielt mit dem Wavetable-Synthesizer ein Musikstück in Music Macro Language (MML) ab.
es: Reproduce una pieza musical en Music Macro Language (MML) utilizando el sintetizador de tabla de ondas.
fr: Lit un morceau de musique en Music Macro Language (MML) à l'aide du synthétiseur de table d'ondes.
ja: ウェーブテーブルシンセサイザーを使用して、Music Macro Language（MML）で音楽を再生します。

source: sound channel [`0` to `{MML_CHANNELS_m1}`, default: `0`]
de: Tonkanal [`0` bis `{MML_CHANNELS_m1} `, Standard: `0`]
es: canal de sonido [`0` a `{MML_CHANNELS_m1} `, predeterminado: `0`]
fr: canal audio [`0` à `{MML_CHANNELS_m1}`, par défaut: `0`]
ja: サウンドチャネル[`0`から`{MML_CHANNELS_m1}`、デフォルト：`0`]

source: score in MML format
de: Partitur im MML-Format
es: puntuación en formato MML
fr: partition au format MML
ja: MML形式の楽譜

source: * Fails silently if the synthesizer could not be initialized.
de: * Schlägt stillschweigend fehl, wenn der Synthesizer nicht initialisiert werden konnte.
es: * Falla silenciosamente si el sintetizador no se pudo inicializar.
fr: * Échoue silencieusement si le synthétiseur n'a pas pu être initialisé.
ja: *シンセサイザーを初期化できなかった場合、サイレントに失敗します。

source: Speaks the given text.
de: Spricht den angegebenen Text.
es: Habla el texto dado.
fr: Dit le texte donné.
ja: 与えられたテキストを話します。

source: text to be spoken
de: zu sprechender Text
es: texto para ser hablado
fr: texte à prononcer
ja: 話されるテキスト

source: `text$` is assumed to be in English.
de: Es wird angenommen, dass `text$` auf Englisch ist.
es: Se supone que `text$` está en inglés.
fr: `text$` est supposé être en anglais.
ja: `text$`は英語であると想定されています。

source: `SAY` cannot be used concurrently with the wavetable synthesizer because they use different sample rates.
de: `SAY` kann nicht gleichzeitig mit dem Wavetable-Synthesizer verwendet werden, da sie unterschiedliche Abtastraten verwenden.
es: `SAY` no se puede usar simultáneamente con el sintetizador de tabla de ondas porque usan diferentes frecuencias de muestreo.
fr: `SAY` ne peut pas être utilisé simultanément avec le synthétiseur de table d'ondes car ils utilisent des fréquences d'échantillonnage différentes.

source: * Does not support phonetic input.
de: * Unterstützt keine phonetische Eingabe.
es: * No admite entrada fonética.
fr: * Ne prend pas en charge l'entrée phonétique.
ja: *音声入力はサポートしていません。

source: * No possibility to change synthesizer parameters.
de: * Keine Möglichkeit, Synthesizer-Parameter zu ändern.
es: * No hay posibilidad de cambiar los parámetros del sintetizador.
fr: * Aucune possibilité de modifier les paramètres du synthétiseur.
ja: *シンセサイザーのパラメーターを変更することはできません。

source: Checks if a sound is playing a on wavetable synthesizer channel.
de: Überprüft, ob ein Sound auf einem Wavetable-Synthesizer-Kanal abgespielt wird.
es: Comprueba si se está reproduciendo un sonido en un canal de sintetizador de tabla de ondas.
fr: Vérifie si un son est lu sur un canal de synthétiseur à table d'ondes.
ja: サウンドがウェーブテーブルシンセサイザーチャンネルで再生されているかどうかを確認します。

source: sound channel [`0` to `{MML_CHANNELS_m1}`, or `-1` to check all channels]
de: Tonkanal [`0` bis `{MML_CHANNELS_m1} `oder`-1`, um alle Kanäle zu überprüfen]
es: canal de sonido [`0` a `{MML_CHANNELS_m1} `, o `-1` para comprobar todos los canales]
fr: canal audio [`0` à `{MML_CHANNELS_m1}`, ou`-1` pour vérifier tous les canaux]
ja: サウンドチャンネル [`0` から `{MML_CHANNELS_m1}` まで、または `-1` で全チャンネルをチェック] 。

source: `1` if sound is playing, `0` otherwise.
de: `1` wenn Ton abgespielt wird, sonst `0`.
es: `1` si se reproduce sonido, `0` en caso contrario.
fr: `1` si le son est en cours de lecture, `0` dans le cas contraire.
ja: サウンドが再生されている場合は`1`、それ以外の場合は`0`。

source: Returns the name of the specified wavetable synthesizer instrument.
de: Gibt den Namen des angegebenen Wavetable-Synthesizer-Instruments zurück.
es: Devuelve el nombre del instrumento sintetizador de tabla de ondas especificado.
fr: Renvoie le nom de l'instrument synthétiseur de table d'ondes spécifié.
ja: 指定されたウェーブテーブルシンセサイザーインストゥルメントの名前を返します。

source: instrument number
de: Instrumentennummer
es: número de instrumento
fr: numéro d'instrument
ja: 楽器番号

source: Instrument name.
de: Instrumentenname.
es: Nombre del instrumento.
fr: Nom de l'instrument.
ja: 楽器名。

source: If an instrument is not defined in the current sound font, an empty string is returned.
de: Wenn ein Instrument nicht in der aktuellen Klangschrift definiert ist, wird ein leerer String zurückgegeben.
es: Si un instrumento no está definido en la fuente de sonido actual, se devuelve una cadena vacía.
fr: Si un instrument n'est pas défini dans la police sonore actuelle, une chaîne vide est renvoyée.
ja: 楽器が現在のサウンドフォントで定義されていない場合は、空の文字列が返されます。

source: tone cycle period in samples [`0` (off) to `320`/`160`]
de: Tonzyklusperiode in Samples [`0` (aus) bis `320` / `160`]
es: período de ciclo de tono en muestras [`0` (desactivado) a `320` / `160`]
fr: période de cycle de tonalité en échantillons [`0` (désactivé) à `320` / `160`]
ja: トーンサイクル周期（サンプル数） [`0` (オフ) から `320`/`160` まで].

source: tone volume [`0` to `15`, default: as set in system configuration]
de: Tonlautstärke [`0` bis `15`, Standard: wie in der Systemkonfiguration eingestellt]
es: volumen de tono [`0` a `15`, predeterminado: como se establece en la configuración del sistema]
fr: volume de la tonalité [`0` à `15`, par défaut: tel que défini dans la configuration du système]
ja: トーンボリューム[`0`から`15`、デフォルト：システム構成で設定されたとおり]

source: Sets the sound font to be used by the wavetable synthesizer.
de: Legt die Sound-Schriftart fest, die vom Wavetable-Synthesizer verwendet werden soll.
es: Establece la fuente de sonido que utilizará el sintetizador de tabla de ondas.
fr: Définit la police sonore à utiliser par le synthétiseur de table d'ondes.
ja: ウェーブテーブルシンセサイザーで使用するサウンドフォントを設定します。

source: name of the SF2 sound font file
de: Name der SF2-Soundschriftdatei
es: nombre del archivo de fuente de sonido SF2
fr: nom du fichier de police sonore SF2
ja: SF2サウンドフォントファイルの名前

source: The default sound font name is `1mgm.sf2`.
de: Der Standardname für die Soundschrift lautet `1mgm.sf2`.
es: El nombre de fuente de sonido predeterminado es `1mgm.sf2`.
fr: Le nom de la police sonore par défaut est `1mgm.sf2`.
ja: デフォルトのサウンドフォント名は `1mgm.sf2`です。

source: Generates a sound using the wavetable synthesizer.
de: Erzeugt einen Ton mit dem Wavetable Synthesizer.
es: Genera un sonido usando el sintetizador de tabla de ondas.
fr: Génère un son à l'aide du synthétiseur à table d'ondes.
ja: ウェーブテーブルシンセサイザーを使用してサウンドを生成します。

source: sound channel [`0` to `{MML_CHANNELS_m1}`]
de: Tonkanal [`0` bis `{MML_CHANNELS_m1} `]
es: canal de sonido [`0` a `{MML_CHANNELS_m1} `]
fr: canal audio [`0` à `{MML_CHANNELS_m1}`]
ja: サウンドチャンネル [`0`から`{MML_CHANNELS_m1}`]

source: note duration, milliseconds [default: `1000`]
de: Notendauer, Millisekunden [Standard: `1000`]
es: duración de la nota, milisegundos [predeterminado: `1000`]
fr: durée de la note, millisecondes [par défaut: `1000`]
ja: 音符の長さ、ミリ秒 [デフォルト: `1000`].

source: time in milliseconds
de: Zeit in Millisekunden
es: tiempo en milisegundos
fr: temps en millisecondes
ja: ミリ秒単位の時間

source: Read a byte of data from an address in memory.
de: Liest ein Datenbyte von einer Adresse im Speicher.
es: Leer un byte de datos de una dirección en la memoria.
fr: Lire un octet de données à partir d'une adress en mémoire.
ja: メモリ内のアドレスから1バイトのデータを読み取ります。

source: memory address
de: Speicheradresse
es: dirección de memoria
fr: adresse mémoire
ja: メモリアドレス

source: Content of memory address.
de: Inhalt der Speicheradresse.
es: Contenido de la dirección de memoria.
fr: Contenu de l'adresse mémoire.
ja: メモリアドレスの内容。

source: Memory at `addr` must allow byte-wise access.
de: Der Speicher bei `addr` muss den byteweisen Zugriff ermöglichen.
es: La memoria en `addr` debe permitir el acceso por bytes.
fr: La mémoire à `addr` doit permettre un accès octet par octet.
ja: `addr`のメモリは、バイト単位のアクセスを許可する必要があります。

source: Sanity checks for `addr` are insufficient.
de: Die Sanitätsprüfungen für `addr` sind unzureichend.
es: Las comprobaciones de cordura para "addr" son insuficientes.
fr: Les contrôles d'intégrité pour `addr` sont insuffisants.
ja: `addr`の健全性チェックは不十分です。
