Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: Returns a random number.
de: Gibt eine Zufallszahl zurück.
es: Devuelve un número aleatorio.
fr: Renvoie un nombre aléatoire.
ja: 乱数を返します。

source: modifier determining the type of random number to generate
de: Modifikator, der den Typ der zu generierenden Zufallszahl bestimmt
es: modificador que determina el tipo de número aleatorio a generar
fr: modificateur déterminant le type de nombre aléatoire à générer
ja: 生成する乱数のタイプを決定する修飾子

source: A random number of the selected type.
de: Eine Zufallszahl des ausgewählten Typs.
es: Un número aleatorio del tipo seleccionado.
fr: Un nombre aléatoire du type sélectionné.
ja: 選択したタイプの乱数。

source: The following types of random numbers are generated depending on the value of `mod`:
de: Die folgenden Arten von Zufallszahlen werden abhängig vom Wert von `mod` generiert:
es: Los siguientes tipos de números aleatorios se generan según el valor de `mod`:
fr: Les types de nombres aléatoires suivants sont générés en fonction de la valeur de `mod`:
ja: `mod`の値に応じて、次のタイプの乱数が生成されます。

source: a random integer number between 0 and 2147483647
de: eine zufällige Ganzzahl zwischen 0 und 2147483647
es: un número entero aleatorio entre 0 y 2147483647
fr: un nombre entier aléatoire compris entre 0 et 2147483647
ja: 0から2147483647までのランダムな整数

source: `mod` between 0 and 1
de: `mod` zwischen 0 und 1
es: `mod` entre 0 y 1
fr: `mod` entre 0 et 1
ja: 0と1の間の`mod`

source: a random fractional number between 0 and 1
de: eine zufällige Bruchzahl zwischen 0 und 1
es: un número fraccionario aleatorio entre 0 y 1
fr: un nombre fractionnaire aléatoire entre 0 et 1
ja: 0から1の間のランダムな小数数

source: A random fractional number between 0 and 1. A specific value of `mod` will always yield the same random number.
de: Eine zufällige Bruchzahl zwischen 0 und 1. Ein bestimmter Wert von `mod` ergibt immer die gleiche Zufallszahl.
es: Un número fraccionario aleatorio entre 0 y 1. Un valor específico de "mod" siempre producirá el mismo número aleatorio.
fr: Un nombre fractionnaire aléatoire entre 0 et 1. Une valeur spécifique de `mod` produira toujours le même nombre aléatoire.
ja: 0から1までの乱数。`mod`の特定の値は、常に同じ乱数を生成します。

source: Define a procedure or function.
de: Definiert eine Prozedur oder Funktion.
es: Definir un procedimiento o función.
fr: Définir une procédure ou une fonction.
ja: プロシージャまたは関数を定義します。

source: procedure name
de: Prozedurname
es: nombre del procedimiento
fr: nom de la procédure
ja: プロシージャ名

source: name of a numeric argument variable
de: Name einer numerischen Argumentvariablen
es: nombre de una variable de argumento numérico
fr: nom d'une variable d'argument numérique
ja: 数値引数変数の名前

source: name of a string argument variable
de: Name einer String-Argumentvariablen
es: nombre de una variable de argumento de cadena
fr: nom d'une variable d'argument de chaîne
ja: 文字列引数変数の名前

source: `PROC` defines a procedure or function that can be called using `CALL` or `FN`. If a procedure or function has arguments, they can be referenced as local variables using the `@` sigil.
de: `PROC` definiert eine Prozedur oder Funktion, die mit `CALL` oder `FN` aufgerufen werden kann. Wenn eine Prozedur oder Funktion Argumente enthält, können sie mit dem Siegel `@` als lokale Variablen referenziert werden.
es: `PROC` define un procedimiento o función que se puede llamar usando `CALL` o `FN`. Si un procedimiento o función tiene argumentos, se puede hacer referencia a ellos como variables locales usando el sigilo `@`.
fr: `PROC` définit une procédure ou une fonction qui peut être appelée en utilisant `CALL` ou `FN`. Si une procédure ou une fonction a des arguments, ils peuvent être référencés en tant que variables locales en utilisant le sigil `@`.
ja: `PROC`は、`CALL`または `FN`を使用して呼び出すことができるプロシージャまたは関数を定義します。プロシージャまたは関数に引数がある場合、それらは `@`シジルを使用してローカル変数として参照できます。

source: Within a procedure or function, any numeric or string variable prefixed with the `@` sigil will be treated as a local variable that is valid only within the scope of the procedure. Setting such a variable will not affect global variables or local variables in other procedures.
de: Innerhalb einer Prozedur oder Funktion wird jede numerische Variable oder Stringvariable, der das @-Zeichen vorangestellt ist, als lokale Variable behandelt, die nur im Rahmen der Prozedur gültig ist. Das Festlegen einer solchen Variablen wirkt sich nicht auf globale oder lokale Variablen in anderen Prozeduren aus.
es: Dentro de un procedimiento o función, cualquier variable numérica o de cadena con el prefijo "@" será tratada como una variable local que es válida solo dentro del alcance del procedimiento. Establecer una variable de este tipo no afectará a las variables globales ni a las variables locales en otros procedimientos.
fr: Dans une procédure ou une fonction, toute variable numérique ou chaîne précédée du sigil `@` sera traitée comme une variable locale valide uniquement dans le cadre de la procédure. La définition d'une telle variable n'affectera pas les variables globales ou locales dans d'autres procédures.
ja: プロシージャまたは関数内では、 `@`シジルが前に付いた数値変数または文字列変数は、プロシージャのスコープ内でのみ有効なローカル変数として扱われます。このような変数を設定しても、他の手順のグローバル変数やローカル変数には影響しません。

source: Procedures can only be called using `CALL` or `FN`. If a `PROC` instruction is encountered during normal program flow, an error is generated.
de: Prozeduren können nur mit `CALL` oder `FN` aufgerufen werden. Wenn während des normalen Programmablaufs ein PROC-Befehl auftritt, wird ein Fehler generiert.
es: Los procedimientos solo se pueden llamar usando `CALL` o `FN`. Si se encuentra una instrucción `PROC` durante el flujo normal del programa, se genera un error.
fr: Les procédures ne peuvent être appelées qu'en utilisant `CALL` ou `FN`. Si une instruction `PROC` est rencontrée pendant le déroulement normal du programme, une erreur est générée.
ja: プロシージャは、 `CALL`または`FN`を使用してのみ呼び出すことができます。通常のプログラムフロー中に `PROC`命令が検出されると、エラーが生成されます。

source: It is not currently possible to use complex data types (arrays and lists) as local variables or arguments.
de: Es ist derzeit nicht möglich, komplexe Datentypen (Arrays und Listen) als lokale Variablen oder Argumente zu verwenden.
es: Actualmente no es posible utilizar tipos de datos complejos (matrices y listas) como variables o argumentos locales.
fr: Il n'est actuellement pas possible d'utiliser des types de données complexes (tableaux et listes) comme variables ou arguments locaux.
ja: 現在、複雑なデータ型（配列とリスト）をローカル変数または引数として使用することはできません。

source: Specifies values to be read by subsequent `READ` instructions.
de: Gibt Werte an, die durch nachfolgende `READ`-Anweisungen gelesen werden sollen.
es: Especifica los valores que se leerán en las siguientes instrucciones "READ".
fr: Spécifie les valeurs à lire par les instructions `READ` suivantes.
ja: 後続の `READ`命令によって読み取られる値を指定します。

source: a numeric or string expression
de: ein numerischer oder String-Ausdruck
es: una expresión numérica o de cadena
fr: une expression numérique ou chaîne
ja: 数値式または文字列式

source: When a DATA instruction is executed, nothing happens.
de: Wenn ein DATA-Befehl ausgeführt wird, passiert nichts.
es: Cuando se ejecuta una instrucción DATA, no sucede nada.
fr: Lorsqu'une instruction DATA est exécutée, rien ne se passe.
ja: DATA命令を実行しても、何も起こりません。

source: numeric or string variable
de: Numerische oder String-Variable
es: variable numérica o de cadena
fr: variable numérique ou chaîne
ja: 数値変数または文字列変数

source: Sets the data pointer to a given location.
de: Setzt den Datenzeiger auf eine bestimmte Position.
es: Establece el puntero de datos en una ubicación determinada.
fr: Définit le pointeur de données sur un emplacement donné.
ja: データポインタを特定の場所に設定します。

source: Runs the progam in memory.
de: Führt das Programm im Speicher aus.
es: Ejecuta el programa en la memoria.
fr: Exécute le programme en mémoire.
ja: プログラムをメモリ内で実行します。

source: If a file name is given, that program will be loaded to memory first. If a line number is given, execution will begin at the specified line. Otherwise, execution will start at the first line.
de: Wenn ein Dateiname angegeben wird, wird dieses Programm zuerst in den Speicher geladen. Wenn eine Zeilennummer angegeben wird, beginnt die Ausführung an der angegebenen Zeile. Andernfalls beginnt die Ausführung in der ersten Zeile.
es: Si se proporciona un nombre de archivo, ese programa se cargará primero en la memoria. Si se proporciona un número de línea, la ejecución comenzará en la línea especificada. De lo contrario, la ejecución comenzará en la primera línea.
fr: Si un nom de fichier est donné, ce programme sera d'abord chargé en mémoire. Si un numéro de ligne est donné, l'exécution commencera à la ligne spécifiée. Sinon, l'exécution commencera à la première ligne.
ja: ファイル名を指定すると、そのプログラムが最初にメモリにロードされます。行番号が指定されている場合、実行は指定された行から開始されます。それ以外の場合、実行は最初の行から開始されます。

source: name of the BASIC program to be loaded and run
de: Name des BASIC-Programms, das geladen und ausgeführt werden soll
es: nombre del programa BASIC que se cargará y ejecutará
fr: nom du programme BASIC à charger et exécuter
ja: ロードして実行するBASICプログラムの名前

source: line number at which execution will start [default: first line]
de: Zeilennummer, bei der die Ausführung beginnt [Standard: erste Zeile]
es: número de línea en el que comenzará la ejecución [predeterminado: primera línea]
fr: numéro de ligne à partir duquel l'exécution commencera [par défaut: première ligne]
ja: 実行を開始する行番号[デフォルト：最初の行]

source: `RUN` behaves slightly differently when executed from within a program than when used in direct mode.
de: `RUN` verhält sich bei Ausführung innerhalb eines Programms etwas anders als bei Verwendung im Direktmodus.
es: `RUN` se comporta de forma ligeramente diferente cuando se ejecuta desde dentro de un programa que cuando se usa en modo directo.
fr: `RUN` se comporte légèrement différemment lorsqu'il est exécuté à partir d'un programme et lorsqu'il est utilisé en mode direct.
ja: `RUN`は、プログラム内から実行した場合とダイレクトモードで使用した場合とでは動作が少し異なります。

source: In direct mode, `RUN` clears all variables, whereas within a program, it does not. The purpose of this is to allow a program to restart itself with all loop and subroutine stacks cleared, but with the variables still intact.
de: Im Direktmodus löscht `RUN` alle Variablen, während dies innerhalb eines Programms nicht der Fall ist. Dies dient dazu, einem Programm zu ermöglichen, sich selbst neu zu starten, wobei alle Schleifen- und Unterprogrammstapel gelöscht sind, die Variablen jedoch noch intakt sind.
es: En el modo directo, `RUN` borra todas las variables, mientras que dentro de un programa, no lo hace. El propósito de esto es permitir que un programa se reinicie con todas las pilas de bucles y subrutinas borradas, pero con las variables aún intactas.
fr: En mode direct, `RUN` efface toutes les variables, alors que dans un programme, ce n'est pas le cas. Le but de ceci est de permettre à un programme de se redémarrer avec toutes les piles de boucles et de sous-programmes effacées, mais avec les variables toujours intactes.
ja: ダイレクトモードでは、 `RUN`はすべての変数をクリアしますが、プログラム内ではクリアしません。これの目的は、すべてのループスタックとサブルーチンスタックをクリアした状態でプログラムを再起動できるようにすることですが、変数はそのままです。

source: * The syntax `RUN file$` does not work from within a program. Use `CHAIN` instead.
de: * Die Syntax `RUN file$` funktioniert nicht innerhalb eines Programms. Verwenden Sie stattdessen `CHAIN`.
es: * La sintaxis `RUN file$` no funciona desde dentro de un programa. Utilice `CHAIN` en su lugar.
fr: * La syntaxe `RUN file$` ne fonctionne pas à partir d'un programme. Utilisez `CHAIN` à la place.
ja: *構文 `RUN file$`は、プログラム内からは機能しません。代わりに `CHAIN`を使用してください。

source: Renumber BASIC program in memory.
de: BASIC-Programm im Speicher neu nummerieren.
es: Renumerar el programa BÁSICO en la memoria.
fr: Renuméroter le programme BASIC en mémoire.
ja: メモリ内のBASICプログラムの番号を付け直します。

source: line number increment [min `0`, default: `10`]
de: Zeilennummerninkrement [min `0`, Standard: `10`]
es: incremento de número de línea [min `0`, predeterminado: `10`]
fr: incrément du numéro de ligne [min `0`, par défaut: `10`]
ja: 行番号の増分[最小 `0`、デフォルト：`10`]

source: Saves the BASIC program in memory to a file.
de: Speichert das BASIC-Programm im Speicher in einer Datei.
es: Guarda el programa BASIC en la memoria en un archivo.
fr: Enregistre le programme BASIC en mémoire dans un fichier.
ja: メモリ内のBASICプログラムをファイルに保存します。

source: name of file to be saved
de: Name der zu speichernden Datei
es: nombre del archivo a guardar
fr: nom du fichier à enregistrer
ja: 保存するファイルの名前

source: BASIC programs are saved in plain text (UTF-8) format.
de: BASIC-Programme werden im UTF-8-Format (Nur-Text) gespeichert.
es: Los programas BÁSICOS se guardan en formato de texto sin formato (UTF-8).
fr: Les programmes BASIC sont enregistrés au format texte brut (UTF-8).
ja: BASICプログラムは、プレーンテキスト（UTF-8）形式で保存されます。

source: Delete specified line(s) from the BASIC program in memory.
de: Löscht die angegebenen Zeilen aus dem BASIC-Programm im Speicher.
es: Elimine las líneas especificadas del programa BÁSICO en la memoria.
fr: Supprimez la ou les lignes spécifiées du programme BASIC en mémoire.
ja: メモリ内のBASICプログラムから指定された行を削除します。

source: a range of BASIC program lines
de: eine Reihe von BASIC-Programmzeilen
es: una gama de líneas de programa BÁSICAS
fr: une gamme de lignes de programme BASIC
ja: 一連のBASICプログラム行

source: Clears the current text window.
de: Löscht das aktuelle Textfenster.
es: Borra la ventana de texto actual.
fr: Efface la fenêtre de texte actuelle.
ja: 現在のテキストウィンドウをクリアします。

source: Returns one of the numeric return values of the last function call.
de: Gibt einen der numerischen Rückgabewerte des letzten Funktionsaufrufs zurück.
es: Devuelve uno de los valores devueltos numéricos de la última llamada a la función.
fr: Renvoie l'une des valeurs de retour numériques du dernier appel de fonction.
ja: 最後の関数呼び出しの数値戻り値の1つを返します。

source: number of the numeric return value [`0` to `{MAX_RETVALS_m1}`]
de: Nummer des numerischen Rückgabewerts [`0` bis `{MAX_RETVALS_m1} `]
es: número del valor de retorno numérico [`0` a `{MAX_RETVALS_m1} `]
fr: numéro de la valeur de retour numérique [`0` à `{MAX_RETVALS_m1}`]
ja: 数値戻り値の数[`0`から`{MAX_RETVALS_m1}`]

source: Requested return value.
de: Angeforderter Rückgabewert.
es: Valor de devolución solicitado.
fr: Valeur de retour demandée.
ja: 要求された戻り値。

source: Returns a numeric argument passed to a procedure.
de: Gibt ein numerisches Argument zurück, das an eine Prozedur übergeben wurde.
es: Devuelve un argumento numérico pasado a un procedimiento.
fr: Renvoie un argument numérique passé à une procédure.
ja: プロシージャに渡された数値引数を返します。

source: number of the numeric argument
de: Nummer des numerischen Arguments
es: número del argumento numérico
fr: numéro de l'argument numérique
ja: 数値引数の数

source: Argument value.
de: Argumentwert.
es: Valor de argumento.
fr: Valeur de l'argument.
ja: 引数値。

source: An error is generated if no numeric arguments have been passed, `num` is equal to or larger than `ARGC(0)`, or the function is evaluated outside a procedure.
de: Ein Fehler wird generiert, wenn keine numerischen Argumente übergeben wurden, `num` gleich oder größer als `ARGC(0)` ist oder die Funktion außerhalb einer Prozedur ausgewertet wird.
es: Se genera un error si no se han pasado argumentos numéricos, `num` es igual o mayor que `ARGC(0) `, o la función se evalúa fuera de un procedimiento.
fr: Une erreur est générée si aucun argument numérique n'a été passé, `num` est égal ou supérieur à `ARGC(0)`, ou si la fonction est évaluée en dehors d'une procédure.
ja: 数値引数が渡されなかった場合、 `num`が`ARGC(0)`以上の場合、または関数がプロシージャの外部で評価された場合、エラーが生成されます。

source: Returns a string argument passed to a procedure.
de: Gibt ein Stringargument zurück, das an eine Prozedur übergeben wurde.
es: Devuelve un argumento de cadena pasado a un procedimiento.
fr: Renvoie un argument de chaîne passé à une procédure.
ja: プロシージャに渡された文字列引数を返します。

source: number of the string argument
de: Nummer des String-Arguments
es: número del argumento de cadena
fr: numéro de l'argument chaîne
ja: 文字列引数の数

source: An error is generated if no string arguments have been passed, `num` is equal to or larger than `ARGC(1)`, or the function is evaluated outside a procedure.
de: Ein Fehler wird generiert, wenn keine Stringargumente übergeben wurden, `num` gleich oder größer als `ARGC(1)` ist oder die Funktion außerhalb einer Prozedur ausgewertet wird.
es: Se genera un error si no se han pasado argumentos de cadena, `num` es igual o mayor que `ARGC(1) `, o la función se evalúa fuera de un procedimiento.
fr: Une erreur est générée si aucun argument de chaîne n'a été passé, `num` est égal ou supérieur à `ARGC(1)`, ou si la fonction est évaluée en dehors d'une procédure.
ja: 文字列引数が渡されなかった場合、 `num`が`ARGC(1) `以上の場合、または関数がプロシージャの外部で評価された場合、エラーが生成されます。

source: Returns the argument count for numeric and string variables passed to a procedure.
de: Gibt die Argumentanzahl für numerische Variablen und Stringvariablen zurück, die an eine Prozedur übergeben wurden.
es: Devuelve el recuento de argumentos para las variables numéricas y de cadena pasadas a un procedimiento.
fr: Renvoie le nombre d'arguments pour les variables numériques et chaîne transmises à une procédure.
ja: プロシージャに渡される数値変数と文字列変数の引数数を返します。

source: type of argument [`0` for numeric, `1` for string]
de: Argumentyp [`0 'für numerisch, `1' für String]
es: tipo de argumento [`0` para numérico, `1` para cadena]
fr: type d'argument [`0` pour numérique, `1` pour chaîne]
ja: 引数のタイプ[数値の場合は `0`、文字列の場合は`1`]

source: Argument count.
de: Anzahl der Argumente.
es: Recuento de argumentos.
fr: Nombre d'arguments.
ja: 引数の数。

source: Returns `0` if called outside a procedure.
de: Gibt `0` zurück, wenn es außerhalb einer Prozedur aufgerufen wird.
es: Devuelve "0" si se llama fuera de un procedimiento.
fr: Renvoie `0` s'il est appelé en dehors d'une procédure.
ja: プロシージャの外部で呼び出された場合は `0`を返します。

source: Returns a string containing the hexadecimal representation of a number.
de: Gibt einen String zurück, der die hexadezimale Darstellung einer Zahl enthält.
es: Devuelve una cadena que contiene la representación hexadecimal de un número.
fr: Renvoie une chaîne contenant la représentation hexadécimale d'un nombre.
ja: 数値の16進表現を含む文字列を返します。

source: numeric expression
de: numerischer Ausdruck
es: expresión numérica
fr: expression numérique
ja: 数字式

source: Hexadecimal number as text.
de: Hexadezimalzahl als Text.
es: Número hexadecimal como texto.
fr: Nombre hexadécimal sous forme de texte.
ja: テキストとしての16進数。

source: Returns a string containing the binary representation of a number.
de: Gibt einen String zurück, der die binäre Darstellung einer Zahl enthält.
es: Devuelve una cadena que contiene la representación binaria de un número.
fr: Renvoie une chaîne contenant la représentation binaire d'un nombre.
ja: 数値のバイナリ表現を含む文字列を返します。

source: Binary number as text.
de: Binärzahl als Text.
es: Número binario como texto.
fr: Nombre binaire sous forme de texte.
ja: テキストとしての2進数。

source: Numbers are converted to an unsigned 32-bit value first.
de: Zahlen werden zuerst in einen vorzeichenlosen 32-Bit-Wert konvertiert.
es: Los números se convierten primero a un valor de 32 bits sin signo.
fr: Les nombres sont d'abord convertis en une valeur 32 bits non signée.
ja: 数値は最初に符号なし32ビット値に変換されます。

source: Re-maps a value from one range to another
de: Ordnet einen Wert von einem Bereich einem anderen neu zu
es: Re-mapea un valor de un rango a otro
fr: Remappe une valeur d'une plage à une autre
ja: ある範囲から別の範囲に値を再マップします

source: value to be re-mapped
de: Wert, der neu zugeordnet werden soll
es: valor para ser re-asignado
fr: valeur à remapper
ja: 再マッピングされる値

source: lower bound of the value's current range
de: Untergrenze des aktuellen Wertebereichs
es: límite inferior del rango actual del valor
fr: limite inférieure de la plage actuelle de la valeur
ja: 値の現在の範囲の下限

source: upper bound of the value's current range
de: Obergrenze des aktuellen Wertebereichs
es: límite superior del rango actual del valor
fr: limite supérieure de la plage actuelle de la valeur
ja: 値の現在の範囲の上限

source: lower bound of the value's target range
de: Untergrenze des Zielbereichs des Werts
es: límite inferior del rango objetivo del valor
fr: limite inférieure de la plage cible de la valeur
ja: 値のターゲット範囲の下限

source: upper bound of the value's target range
de: Obergrenze des Zielbereichs des Werts
es: límite superior del rango objetivo del valor
fr: limite supérieure de la plage cible de la valeur
ja: 値のターゲット範囲の上限

source: Re-mapped value.
de: Neu zugeordneter Wert.
es: Valor reasignado.
fr: Valeur remappée.
ja: 再マップされた値。

source: Restricts `value` to the range `l1`-`h1`, which is arbitrary.
de: Beschränkt `value` auf den Bereich `l1`-`h1`, der beliebig ist.
es: Restringe `value` al rango` l1`-`h1`, que es arbitrario.
fr: Restreint `value` à la plage `l1`-`h1`, ce qui est arbitraire.
ja: `value`を`l1`-`h1`の範囲に制限します。これは任意です。

source: Returns the ASCII code for the first character in a string expression.
de: Gibt den ASCII-Code für das erste Zeichen in einem Stringausdruck zurück.
es: Devuelve el código ASCII del primer carácter de una expresión de cadena.
fr: Renvoie le code ASCII du premier caractère d'une expression de chaîne.

source: string expression
de: String-Ausdruck
es: expresión de cadena
fr: expression de chaîne
ja: 文字列式

source: ASCII code of the first character.
de: ASCII-Code des ersten Zeichens.
es: Código ASCII del primer carácter.
fr: Code ASCII du premier caractère.

source: Generates an error if `s$` is empty.
de: Erzeugt einen Fehler, wenn `s$` leer ist.
es: Genera un error si `s$` está vacío.
fr: Génère une erreur si `s$` est vide.
ja: `s$`が空の場合、エラーを生成します。

source: Prints data to the current output device (usually the screen) or to a given file.
de: Druckt Daten auf das aktuelle Ausgabegerät (normalerweise den Bildschirm) oder in eine bestimmte Datei.
es: Imprime datos en el dispositivo de salida actual (generalmente la pantalla) o en un archivo determinado.
fr: Imprime les données sur le périphérique de sortie actuel (généralement l'écran) ou dans un fichier donné.
ja: 現在の出力デバイス（通常は画面）または特定のファイルにデータを印刷します。

source: list of expressions specifying what to print
de: Liste der Ausdrücke, die angeben, was gedruckt werden soll
es: lista de expresiones que especifican qué imprimir
fr: liste d'expressions spécifiant ce qu'il faut imprimer
ja: 印刷するものを指定する式のリスト

source: The following types of expressions can be used in a `PRINT` command expressions list:
de: Die folgenden Arten von Ausdrücken können in einer PRINT-Befehlsausdrucksliste verwendet werden:
es: Los siguientes tipos de expresiones se pueden usar en una lista de expresiones de comando `PRINT`:
fr: Les types d'expressions suivants peuvent être utilisés dans une liste d'expressions de commande `PRINT`:
ja: `PRINT`コマンド式リストでは、次のタイプの式を使用できます。

source: * Numeric expressions
de: * Numerische Ausdrücke
es: * Expresiones numéricas
fr: * Expressions numériques
ja: * 数値式

source: * String expressions
de: * String-Ausdrücke
es: * Expresiones de cadena
fr: * Expressions de chaîne
ja: *文字列式

source: * `TAB(num)` (inserts spaces until the cursor is at or beyond the column `num`)
de: * `TAB(num)` (fügt Leerzeichen ein, bis sich der Cursor auf oder hinter der Spalte `num` befindet)
es: * `TAB(num)` (inserta espacios hasta que el cursor está en o más allá de la columna `num`)
fr: * `TAB(num)` (insère des espaces jusqu'à ce que le curseur soit au niveau ou au-delà de la colonne `num`)
ja: * `TAB（num）`（カーソルが列 `num`以上になるまでスペースを挿入します）
