Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: start of the screen region, Y coordinate, characters [`0` to `CSIZE(1)-1`]
de: Beginn des Bildschirmbereichs, Y-Koordinate, Zeichen [`0` bis` CSIZE(1) -1`]
es: inicio de la región de la pantalla, coordenada Y, caracteres [`0` a `CSIZE (1)-1`]
fr: début de la zone d'écran, coordonnée Y, caractères [`0` à `CSIZE(1)-1`]
ja: 画面領域の開始、Y座標、文字[`0`から`CSIZE(1)-1`]

source: end of the screen region, X coordinate, characters [`x1+1` to `CSIZE(0)-1`]
de: Ende des Bildschirmbereichs, X-Koordinate, Zeichen [`x1 + 1` bis` CSIZE(0) -1`]
es: final de la región de la pantalla, coordenada X, caracteres [`x1 + 1` a `CSIZE(0)-1`]
fr: fin de la zone d'écran, coordonnée X, caractères [`x1 + 1` à `CSIZE(0)-1`]
ja: 画面領域の終わり、X座標、文字[`x1 + 1`から`CSIZE(0)-1`]

source: end of the screen region, Y coordinate, characters [`y1+1` to `CSIZE(1)-1`]
de: Ende des Bildschirmbereichs, Y-Koordinate, Zeichen [`y1 + 1` bis` CSIZE(1) -1`]
es: final de la región de la pantalla, coordenada Y, caracteres [`y1 + 1` a `CSIZE(1)-1`]
fr: fin de la zone d'écran, coordonnée Y, caractères [`y1 + 1` à `CSIZE(1)-1`]
ja: 画面領域の終わり、Y座標、文字[`y1 + 1`から`CSIZE(1)-1`]

source: direction
de: Richtung
es: dirección
ja: 方向

source: Valid values for `direction` are:
de: Gültige Werte für `Richtung` sind:
es: Los valores válidos para "dirección" son:
fr: Les valeurs valides pour `direction` sont:
ja: `direction`の有効な値は次のとおりです。

source: left
de: links
es: izquierda
fr: la gauche
ja: 左

source: Colors are lost when scrolling.
de: Beim Scrollen gehen Farben verloren.
es: Los colores se pierden al desplazarse.
fr: Les couleurs sont perdues lors du défilement.
ja: スクロール時に色が失われます。

source: start of the screen region, X coordinate, pixels [`0` to `PSIZE(0)-1`]
de: Beginn des Bildschirmbereichs, X-Koordinate, Pixel [`0` bis `PSIZE(0)-1`]
es: inicio de la región de la pantalla, coordenada X, píxeles [`0` a `PSIZE(0) -1`]
fr: début de la zone d'écran, coordonnée X, pixels [`0` à `PSIZE(0)-1`]
ja: 画面領域の開始、X座標、ピクセル[`0`から`PSIZE(0)-1`]

source: start of the screen region, Y coordinate, pixels [`0` to `PSIZE(2)-1`]
de: Beginn des Bildschirmbereichs, Y-Koordinate, Pixel [`0` bis `PSIZE(2)-1`]
es: inicio de la región de la pantalla, coordenada Y, píxeles [`0` a `PSIZE(2) -1`]
fr: début de la zone d'écran, coordonnée Y, pixels [`0` à `PSIZE(2)-1`]
ja: 画面領域の開始、Y座標、ピクセル[`0`から`PSIZE(2)-1`]

source: end of the screen region, X coordinate, pixels [`x1+1` to `PSIZE(0)-1`]
de: Ende des Bildschirmbereichs, X-Koordinate, Pixel [`x1 + 1` bis` PSIZE(0) -1`]
es: final de la región de la pantalla, coordenada X, píxeles [`x1 + 1` a `PSIZE (0)-1`]
fr: fin de la zone d'écran, coordonnée X, pixels [`x1 + 1` à `PSIZE(0)-1`]
ja: 画面領域の終わり、X座標、ピクセル[`x1 + 1`から`PSIZE(0)-1`]

source: end of the screen region, Y coordinate, pixels [`y1+1` to `PSIZE(2)-1`]
de: Ende des Bildschirmbereichs, Y-Koordinate, Pixel [`y1 + 1` bis` PSIZE(2) -1`]
es: final de la región de la pantalla, coordenada Y, píxeles [`y1 + 1` a `PSIZE (2)-1`]
fr: fin de la zone d'écran, coordonnée Y, pixels [`y1 + 1` à `PSIZE(2)-1`]
ja: 画面領域の終わり、Y座標、ピクセル[`y1 + 1`から`PSIZE(2)-1`]

source: up
de: oben
es: arriba
fr: en haut
ja: アップ

source: Returns the color of the pixel at the given coordinates.
de: Gibt die Farbe des Pixels an den angegebenen Koordinaten zurück.
es: Devuelve el color del píxel en las coordenadas dadas.
fr: Renvoie la couleur du pixel aux coordonnées données.
ja: 指定された座標でのピクセルの色を返します。

source: X coordinate, pixels [`0` to `PSIZE(0)-1`]
de: X-Koordinate, Pixel [`0` bis `PSIZE(0)-1`]
es: Coordenada X, píxeles [`0` a `PSIZE(0)-1`]
fr: Coordonnée X, pixels [`0` à `PSIZE(0)-1`]
ja: X座標、ピクセル[`0`から`PSIZE(0)-1`]

source: Y coordinate, pixels [`0` to `PSIZE(2)-1`]
de: Y-Koordinate, Pixel [`0` bis `PSIZE(2)-1`]
es: Coordenada Y, píxeles [`0` a `PSIZE(2)-1`]
fr: Coordonnée Y, pixels [`0` à `PSIZE(2)-1`]
ja: Y座標、ピクセル[`0`から`PSIZE(2)-1`]

source: Pixel color [`0` to `255`]
de: Pixelfarbe [`0` bis `255`]
es: Color de píxel [`0` a `255`]
fr: Couleur du pixel [`0` à `255`]
ja: ピクセルカラー[`0`から`255`]

source: If the coordinates exceed the dimensions of the pixel memory area, `0` will be returned.
de: Wenn die Koordinaten die Abmessungen des Pixelspeicherbereichs überschreiten, wird `0` zurückgegeben.
es: Si las coordenadas exceden las dimensiones del área de memoria de píxeles, se devolverá "0".
fr: Si les coordonnées dépassent les dimensions de la zone de mémoire de pixels, `0` sera renvoyé.
ja: 座標がピクセルメモリ領域の寸法を超える場合、 `0`が返されます。

source: Prints a string of characters at the specified pixel position.
de: Druckt einen String an der angegebenen Pixelposition.
es: Imprime una cadena de caracteres en la posición de píxel especificada.
fr: Imprime une chaîne de caractères à la position de pixel spécifiée.
ja: 指定されたピクセル位置に文字列を出力します。

source: `GPRINT` allows printing characters outside the fixed text grid, including off-screen pixel memory.
de: `GPRINT` ermöglicht das Drucken von Zeichen außerhalb des festen Textgitters, einschließlich des Pixelspeichers außerhalb des Bildschirms.
es: `GPRINT` permite imprimir caracteres fuera de la cuadrícula de texto fija, incluida la memoria de píxeles fuera de la pantalla.
fr: `GPRINT` permet d'imprimer des caractères en dehors de la grille de texte fixe, y compris la mémoire de pixels hors écran.
ja: `GPRINT`を使用すると、画面外のピクセルメモリなど、固定テキストグリッドの外側に文字を印刷できます。

source: start point, X coordinate, pixels [`0` to `PSIZE(0)-1`]
de: Startpunkt, X-Koordinate, Pixel [`0` bis `PSIZE(0)-1`]
es: punto de inicio, coordenada X, píxeles [`0` a `PSIZE(0)-1`]
fr: point de départ, coordonnée X, pixels [`0` à `PSIZE(0)-1`]
ja: 始点、X座標、ピクセル[`0`から`PSIZE(0)-1`]

source: start point, Y coordinate, pixels [`0` to `PSIZE(2)-1`]
de: Startpunkt, Y-Koordinate, Pixel [`0` bis `PSIZE(2)-1`]
es: punto de inicio, coordenada Y, píxeles [`0` a `PSIZE(2)-1`]
fr: point de départ, coordonnée Y, pixels [`0` à `PSIZE(2)-1`]
ja: 始点、Y座標、ピクセル[`0`から`PSIZE(2)-1`]

source: `PRINT`-format list of expressions specifying what to draw
de: Liste der Ausdrücke im `PRINT`-Format, die angeben, was gezeichnet werden soll
es: Lista de expresiones en formato `PRINT` que especifican qué dibujar
fr: Liste d'expressions au format `PRINT` spécifiant ce qu'il faut dessiner
ja: 何を描くかを指定する `PRINT` 形式の式リスト

source: * The expression list functions as it does in the `PRINT` command.
de: * Die Ausdrucksliste funktioniert wie im Befehl `PRINT`.
es: * La lista de expresiones funciona como lo hace en el comando `PRINT`.
fr: * La liste d'expressions fonctionne comme dans la commande `PRINT`.
ja: * 式リストは、`PRINT`コマンドと同じように機能します。

source: * The "new line" character that is generally appended at the end of a `PRINT` command is drawn literally by `GPRINT`, showing up as a funny character at the end of the drawn text. This can be avoided by appending a semicolon (`;`) to the print parameters.
de: * Das Zeichen "Neue Zeile", das normalerweise am Ende eines `PRINT` -Befehls angehängt wird, wird buchstäblich von `GPRINT` gezeichnet und am Ende des gezeichneten Textes als lustiges Zeichen angezeigt. Dies kann vermieden werden, indem ein Semikolon (`;`) an die Druckparameter angehängt wird.
es: * El carácter de "nueva línea" que generalmente se agrega al final de un comando `PRINT` se dibuja literalmente con `GPRINT`, y se muestra como un personaje divertido al final del texto dibujado. Esto se puede evitar agregando un punto y coma (`;`) a los parámetros de impresión.
fr: * Le caractère "nouvelle ligne" qui est généralement ajouté à la fin d'une commande `PRINT` est dessiné littéralement par` GPRINT`, apparaissant comme un caractère amusant à la fin du texte dessiné. Cela peut être évité en ajoutant un point-virgule (`;`) aux paramètres d'impression.
ja: *`PRINT`コマンドの最後に通常追加される「改行」文字は、文字通り`GPRINT`によって描画され、描画されたテキストの最後に面白い文字として表示されます。これは、印刷パラメータにセミコロン（ `;`）を追加することで回避できます。

source: Draws a pixel.
de: Zeichnet ein Pixel.
es: Dibuja un píxel.
fr: Dessine un pixel.
ja: ピクセルを描画します。

source: Draws a line.
de: Zeichnet eine Linie.
es: Dibuja una línea.
fr: Dessine une ligne.
ja: 線を引きます。

source: Coordinates that exceed the valid pixel memory area will be clamped. This can change the slope of the line and is not the behavior one would expect.
de: Koordinaten, die den gültigen Pixelspeicherbereich überschreiten, werden geklemmt. Dies kann die Steigung der Linie verändern und ist nicht das Verhalten, das man erwarten würde.
es: Las coordenadas que superen el área de memoria píxel válida serán sujetadas. Esto puede cambiar la pendiente de la línea y no es el comportamiento que uno esperaría.
fr: Les coordonnées qui dépassent la zone de mémoire des pixels valides seront bridées. Cela peut modifier la pente de la ligne et n'est pas le comportement auquel on pourrait s'attendre.
ja: 有効なピクセルメモリ領域を超える座標はクランプされます。これは線の傾きを変える可能性があり、期待される動作ではありません。

source: Draws a circle.
de: Zeichnet einen Kreis.
es: Dibuja un círculo.
fr: Dessine un cercle.
ja: 円を描きます。

source: X coordinate of the circle's center [`0` to `PSIZE(0)-1`]
de: X-Koordinate des Kreismittelpunkts [`0` bis `PSIZE(0)-1`]
es: Coordenada X del centro del círculo [`0` a `PSIZE(0)-1`]
fr: Coordonnée X du centre du cercle [`0` à `PSIZE(0)-1`]
ja: 円の中心のX座標[`0`から`PSIZE(0)-1`]

source: Y coordinate of the circle's center [`0` to `PSIZE(2)-1`]
de: Y-Koordinate des Kreismittelpunkts [`0` bis `PSIZE(2)-1`]
es: Coordenada Y del centro del círculo [`0` a `PSIZE(2)-1`]
fr: Coordonnée Y du centre du cercle [`0` à `PSIZE(2)-1`]
ja: 円の中心のY座標[`0`から`PSIZE(2)-1`]

source: circle's radius
de: Kreisradius
es: radio del círculo
fr: rayon du cercle
ja: 円の半径

source: color of the circle's outline [range depends on color space]
de: Farbe des Kreisumrisses [Bereich hängt vom Farbraum ab]
es: color del contorno del círculo [el rango depende del espacio de color]
fr: couleur du contour du cercle [la plage dépend de l'espace colorimétrique]
ja: 円の輪郭の色[範囲は色空間によって異なります]

source: color of the circle's body [range depends on color space, `-1` for an unfilled circle]
de: Farbe des Kreiskörpers [Bereich hängt vom Farbraum ab, `-1` für einen ungefüllten Kreis]
es: color del cuerpo del círculo [el rango depende del espacio de color, `-1` para un círculo sin relleno]
fr: couleur du corps du cercle [la plage dépend de l'espace colorimétrique, `-1` pour un cercle vide]
ja: 円の本体の色[範囲は色空間によって異なります。塗りつぶされていない円の場合は `-1`]

source: * `fill_color` cannot be omitted.
de: * `fill_color` kann nicht weggelassen werden.
es: * `fill_color` no se puede omitir.
fr: * `fill_color` ne peut pas être omis.
ja: * `fill_color`は省略できません。

source: Draws a rectangle.
de: Zeichnet ein Rechteck.
es: Dibuja un rectángulo.
fr: Dessine un rectangle.
ja: 長方形を描画します。

source: Copies a rectangular area of pixel memory to another area.
de: Kopiert einen rechteckigen Bereich des Pixelspeichers in einen anderen Bereich.
es: Copia un área rectangular de la memoria de píxeles en otra área.
fr: Copie une zone rectangulaire de la mémoire de pixels dans une autre zone.
ja: ピクセルメモリの長方形の領域を別の領域にコピーします。

source: source area, X coordinate [`0` to `PSIZE(0)-1`]
de: Quellbereich, X-Koordinate [`0` bis `PSIZE(0)-1`]
es: área de origen, coordenada X [`0` a `PSIZE(0)-1`]
fr: zone source, coordonnée X [`0` à `PSIZE(0)-1`]
ja: ソースエリア、X座標[`0`から`PSIZE(0)-1`]

source: source area, Y coordinate [`0` to `PSIZE(2)-1`]
de: Quellbereich, Y-Koordinate [`0` bis `PSIZE(2)-1`]
es: área de origen, coordenada Y [`0` a `PSIZE(2)-1`]
fr: zone source, coordonnée Y [`0` à `PSIZE(2)-1`]
ja: ソースエリア、Y座標[`0`から`PSIZE(2)-1`]

source: destination area, X coordinate [`0` to `PSIZE(0)-1`]
de: Zielbereich, X-Koordinate [`0` bis `PSIZE(0)-1`]
es: área de destino, coordenada X [`0` a `PSIZE(0)-1`]
fr: zone de destination, coordonnée X [`0` à `PSIZE(0)-1`]
ja: 宛先領域、X座標[`0`から`PSIZE(0)-1`]

source: destination area, Y coordinate [`0` to `PSIZE(2)-1`]
de: Zielbereich, Y-Koordinate [`0` bis `PSIZE(2)-1`]
es: área de destino, coordenada Y [`0` a `PSIZE(2)-1`]
fr: zone de destination, coordonnée Y [`0` à `PSIZE(2)-1`]
ja: 宛先エリア、Y座標[`0`から`PSIZE(2)-1`]

source: area width [`0` to `PSIZE(0)-x`]
de: Flächenbreite [`0` bis `PSIZE(0)-x`]
es: ancho del área [`0` a `PSIZE(0)-x`]
fr: largeur de la zone [`0` à `PSIZE(0)-x`]
ja: エリア幅[`0`から`PSIZE(0)-x`]

source: area height [`0` to `PSIZE(2)-y`]
de: Flächenhöhe [`0` bis `PSIZE(2)-y`]
es: altura del área [`0` a `PSIZE(2)-y`]
fr: hauteur de la zone [`0` à `PSIZE(2)-y`]
ja: エリアの高さ[`0`から`PSIZE(2)-y`]

source: By default an opaque blit is performed, ignoring the alpha channel of the source area. To enable alpha-blending, `ALPHA` must be appended at the end.
de: Standardmäßig wird ein undurchsichtiger Blit ausgeführt, wobei der Alphakanal des Quellbereichs ignoriert wird. Um das Alpha-Blending zu aktivieren, muss am Ende `ALPHA` angehängt werden.
es: De forma predeterminada, se realiza un blit opaco, ignorando el canal alfa del área fuente. Para habilitar la combinación alfa, se debe agregar "ALPHA" al final.
fr: Par défaut, un blit opaque est effectué, en ignorant le canal alpha de la zone source. Pour activer le mélange alpha, `ALPHA` doit être ajouté à la fin.
ja: デフォルトでは、ソース領域のアルファチャンネルを無視した不透明なブリットが実行されます。アルファブレンディングを有効にするには、末尾に `ALPHA` を追加する必要があります。

source: Reads values specified in `DATA` instructions and assigns them to variables.
de: Liest die in den `DATA`-Anweisungen angegebenen Werte und weist sie Variablen zu.
es: Lee los valores especificados en las instrucciones `DATA` y los asigna a variables.
fr: Lit les valeurs spécifiées dans les instructions `DATA` et les assigne à des variables.
ja: `DATA`命令で指定された値を読み取り、それらを変数に割り当てます。

source: Data is read from the element that follows the current "data pointer". The data pointer points to the beginning of the program initially. With every element read it is forwarded to the next one. It can be set directly with the `RESTORE` command.
de: Daten werden aus dem Element gelesen, das dem aktuellen "Datenzeiger" folgt. Der Datenzeiger zeigt zunächst auf den Programmanfang. Nach jedem gelesenen Element wird er zum nächsten weitergeleitet. Er kann direkt mit dem Befehl `RESTORE` gesetzt werden.
es: Los datos se leen del elemento que sigue al "puntero de datos" actual. El puntero de datos apunta al comienzo del programa inicialmente. Con cada elemento leído, se reenvía al siguiente. Se puede configurar directamente con el comando `RESTORE`.
fr: Les données sont lues à partir de l'élément qui suit le "pointeur de données" actuel. Le pointeur de données pointe initialement vers le début du programme. Avec chaque élément lu, il est transmis au suivant. Il peut être défini directement avec la commande `RESTORE`.
ja: データは、現在の「データポインタ」に続く要素から読み込まれます。データポインタは、最初はプログラムの先頭を指している。データを読み込むたびに、次の要素に転送されます。これは、`RESTORE`コマンドで直接設定することができます。

source: a label or line number [default: start of program]
de: ein Label oder eine Zeilennummer [Standard: Programmstart]
es: una etiqueta o número de línea [predeterminado: inicio del programa]
fr: une étiquette ou un numéro de ligne [par défaut: démarrage du programme]
ja: ラベルまたは行番号[デフォルト：プログラムの開始]

source: new line number to start at [min `0`, default: `10`]
de: neue Anfangszeilennummer [min `0`, Standard:` 10`]
es: nuevo número de línea para comenzar en [min `0`, predeterminado: `10`]
fr: nouveau numéro de ligne pour commencer à [min `0`, par défaut: `10`]

source: Computed branches (`GOTO` and `GOSUB` commands with variable arguments) cannot be renumbered correctly.
de: Berechnete Verzweigungen (Befehle `GOTO` und `GOSUB` mit variablen Argumenten) können nicht korrekt neu nummeriert werden.
es: Las ramas calculadas (comandos `GOTO` y `GOSUB` con argumentos variables) no se pueden volver a numerar correctamente.
fr: Les branches calculées (commandes `GOTO` et` GOSUB` avec des arguments variables) ne peuvent pas être renumérotées correctement.
ja: 計算されたブランチ（可変引数を持つ `GOTO`および`GOSUB`コマンド）は正しく番号を付け直すことができません。

source: WARNING: Do not confuse with `REMOVE`, which deletes files.
de: WARNUNG: Verwechseln Sie es nicht mit `REMOVE`, das Dateien löscht werden.
es: ADVERTENCIA: No confunda con "REMOVE", que elimina archivos.
fr: AVERTISSEMENT: ne pas confondre avec `REMOVE`, qui supprime les fichiers.
ja: 警告：ファイルを削除する `REMOVE`と混同しないでください。

source: * Using `DELETE` does not affect variables.
de: * Die Verwendung von `DELETE` wirkt sich nicht auf Variablen aus.
es: * El uso de `DELETE` no afecta a las variables.
fr: * L'utilisation de `DELETE` n'affecte pas les variables.
ja: * `DELETE`を使用しても変数には影響しません。

source: * When called from a running program, execution will continue at the next program line, i.e. instructions following `DELETE` on the same line are disregarded.
de: * Beim Aufruf von einem laufenden Programm wird die Ausführung in der nächsten Programmzeile fortgesetzt, dh Anweisungen nach `DELETE` in derselben Zeile werden nicht berücksichtigt.
es: * Cuando se llama desde un programa en ejecución, la ejecución continuará en la siguiente línea del programa, es decir, se ignoran las instrucciones que siguen a "DELETE" en la misma línea.
fr: * Lorsqu'elle est appelée depuis un programme en cours d'exécution, l'exécution se poursuit à la ligne de programme suivante, c'est-à-dire que les instructions suivant `DELETE` sur la même ligne ne sont pas prises en compte.
ja: *実行中のプログラムから呼び出されると、実行は次のプログラム行から続行されます。つまり、同じ行の `DELETE`に続く命令は無視されます。

source: file number to be printed to [`0` to `{MAX_USER_FILES_m1}`, default: current output device]
de: Dateinummer, in die gedruckt werden soll, [`0` bis `{MAX_USER_FILES_m1}`, Standard: aktuelles Ausgabegerät]
es: número de archivo que se imprimirá en [`0` a `{MAX_USER_FILES_m1} `, predeterminado: dispositivo de salida actual]
fr: Numéro de fichier à imprimé sur [`0` à {{max_user_files_m1}`, par défaut: périphérique de sortie actuel]
ja: 印刷するファイル番号[`0`〜`{MAX_USER_FILES_m1}`、デフォルト：現在の出力デバイス]

source: left of pixel memory section, pixels [`0` (default) to `PSIZE(0)-1`]
de: linke Seite des Pixelspeicherabschnitts, Pixel [`0` (Standard) bis `PSIZE(0)-1`]
es: izquierda de la sección de memoria de píxeles, píxeles [`0 '(predeterminado) a` psize (0)-1`]
fr: gauche de la section de la mémoire de pixels, pixels [`0` (par défaut) à `PSIZE(0)-1`]
ja: ピクセルメモリセクションの左側、ピクセル[`0`（デフォルト）から`PSIZE(0)-1`]

source: top of pixel memory section, pixels [`0` (default) to `PSIZE(2)-1`]
de: Oberseite des Pixelspeicherabschnitts, Pixel [`0` (Standard) bis `PSIZE(2)-1`]
es: parte superior de la sección de memoria de píxeles, píxeles [`0` (predeterminado) a `PSIZE(2)-1`]
fr: haut de la section de mémoire de pixels, pixels [`0` (par défaut) à `PSIZE (2)-1`]
ja: ピクセルメモリセクションの上部、ピクセル[`0`（デフォルト）から`PSIZE(2)-1`]

source: If the scaling factor for a dimension is `-1`, it will be resized to the screen size. If it is `-2`, it will be resized so that the aspect ratio is preserved.
de: Wenn der Skalierungsfaktor für eine Dimension `-1` ist, wird die Größe auf die Bildschirmgröße angepasst. Wenn er `-2` ist, wird die Größe geändert, so dass das Seitenverhältnis erhalten bleibt.
es: Si el factor de escala para una dimensión es "-1", se cambiará de tamaño al tamaño de la pantalla. Si es "-2", se cambiará el tamaño para que se conserve la relación de aspecto.
fr: Si le facteur de mise à l'échelle d'une dimension est `-1`, il sera redimensionné à la taille de l'écran. S'il vaut "-2", il sera redimensionné afin que le rapport hauteur / largeur soit préservé.
ja: 寸法の倍率が`-1`の場合、画面サイズにサイズ変更されます。`-2`の場合、アスペクト比が維持されるようにサイズが変更されます。

source: If you specify the `FONT` parameter, `LOAD` will convert the program from the single-byte encoding for that font to UTF-8. Use this to load programs written for the BASIC Engine ESP8266 platform on next-generation systems.
de: Wenn Sie den Parameter `FONT` angeben, konvertiert `LOAD` das Programm von der Einzelbyte-Codierung für diese Schriftart in UTF-8. Verwenden Sie diese Option, um Programme auf Systemen der nächsten Generation zu laden, die für die BASIC Engine ESP8266-Plattform geschrieben wurden.
es: Si especifica el parámetro `FONT`, `LOAD` convertirá el programa de la codificación de un solo byte para esa fuente a UTF-8. Use esto para cargar programas escritos para la plataforma BASIC Engine ESP8266 en sistemas de próxima generación.
fr: Si vous spécifiez le paramètre `FONT`,` LOAD` convertira le programme du codage à un octet pour cette police en UTF-8. Utilisez cette option pour charger des programmes écrits pour la plate-forme BASIC Engine ESP8266 sur des systèmes de nouvelle génération.
ja: `FONT`パラメータを指定すると、`LOAD`はプログラムをそのフォントのシングルバイトエンコーディングからUTF-8に変換します。これを使用して、BASIC Engine ESP8266プラットフォーム用に作成されたプログラムを次世代システムにロードします。

source: Value of the "down" direction for input devices.
de: Wert der Richtung "runter" für Eingabegeräte.
es: Valor de la dirección "hacia abajo" para dispositivos de entrada.
fr: Valeur de la direction "vers le bas" pour les périphériques d'entrée.
ja: 入力デバイスの「下」方向の値。

source: String inequality operator.
de: String-Ungleichheitsoperator.
es: Operador de desigualdad de cadenas.
fr: Opérateur d'inégalité de chaîne.
ja: 文字列不等式演算子。

source: String less-than operator.
de: String-kleiner-als-Operator.
es: Operador de cadena menor que.
fr: Opérateur de chaîne inférieur à.
ja: 文字列の小なり演算子。

source: String greater-than operator.
de: String-größer-als-Operator.
es: Operador de cadena mayor que.
fr: Opérateur de chaîne supérieur à.
ja: 大なり記号の文字列。

source: Branches to a specified line or label.
de: Verzweigt zu einer bestimmten Zeile oder Label.
es: Se ramifica a una línea o etiqueta específica.
fr: Se branche sur une ligne ou une étiquette spécifiée.
ja: 指定された行またはラベルに分岐します。

source: `GOSUB` puts the current position in the program on a stack and then jumps to the given location. It is then possible to return to the instruction after the `GOSUB` command by using `RETURN`.
de: `GOSUB` legt die aktuelle Position im Programm auf einen Stapel und springt dann zur angegebenen Position. Es ist dann möglich, mit `RETURN` zur Anweisung nach dem `GOSUB`-Befehl zurückzukehren.
es: `GOSUB` coloca la posición actual en el programa en una pila y luego salta a la ubicación dada. Entonces es posible volver a la instrucción después del comando `GOSUB` usando `RETURN`.
fr: `GOSUB` met la position actuelle dans le programme sur une pile puis saute à l'emplacement donné. Il est alors possible de revenir à l'instruction après la commande `GOSUB` en utilisant` RETURN`.
ja: `GOSUB`は、プログラム内の現在の位置をスタックに置き、指定された場所にジャンプします。その後、 `RETURN`を使用して`GOSUB`コマンドの後に命令に戻ることができます。

source: Defines an event handler triggered by the end of the current MML pattern.
de: Definiert einen Ereignishandler, der durch das Ende des aktuellen MML-Patterns ausgelöst wird.
es: Define un controlador de eventos desencadenado por el final del patrón MML actual.
fr: Définit un gestionnaire d'événements déclenché à la fin du motif MML actuel.
ja: 現在のMMLパターンの終了によってトリガーされるイベントハンドラーを定義します。

source: The event handler will receive the number of the channel that has ended as a numeric argument.
de: Der Ereignishandler erhält die Nummer des Kanals, der zu Ende ging, als numerisches Argument.
es: El manejador de eventos recibirá el número del canal que ha finalizado como un argumento numérico.
fr: Le gestionnaire d'événements recevra le numéro du canal qui s'est terminé sous la forme d'un argument numérique.
ja: イベントハンドラーは、終了したチャネルの番号を数値引数として受け取ります。

source: a line number or a label
de: eine Zeilennummer oder ein Label
es: un número de línea o una etiqueta
fr: un numéro de ligne ou une étiquette
ja: 行番号またはラベル
