Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: `CONT` can be used to resume a program run that has been interrupted by kbd:[Ctrl+C] or by the `STOP` command. It will reset text window and tiled background layouts if they have been automatically adjusted when the program was interrupted.
de: `CONT` kann verwendet werden, um einen Programmlauf fortzusetzen, der durch kbd:[Strg + C] oder durch den Befehl `STOP` unterbrochen wurde. Das Textfenster und die gekachelten Hintergrundlayouts werden zurückgesetzt, wenn sie automatisch angepasst wurden, als das Programm unterbrochen wurde.
es: `CONT` puede usarse para reanudar la ejecución de un programa que ha sido interrumpido por kbd:[Ctrl + C] o por el comando `STOP`. Restablecerá la ventana de texto y los diseños de fondo en mosaico si se han ajustado automáticamente cuando se interrumpió el programa.
fr: `CONT` peut être utilisé pour reprendre l'exécution d'un programme qui a été interrompu par kbd:[Ctrl + C] ou par la commande `STOP`. Il réinitialisera la fenêtre de texte et les dispositions d'arrière-plan en mosaïque si elles ont été automatiquement ajustées lorsque le programme a été interrompu.
ja: `CONT`は、kbd:[Ctrl + C]または`STOP`コマンドによって中断されたプログラムの実行を再開するために使用できます。プログラムが中断されたときに自動的に調整された場合、テキストウィンドウとタイル状の背景レイアウトがリセットされます。

source: Defines a tiled background's properties.
de: Definiert die Eigenschaften eines gekachelten Hintergrunds.
es: Define las propiedades de un fondo en mosaico.
fr: Définit les propriétés d'un arrière-plan en mosaïque.
ja: タイル状の背景のプロパティを定義します。

source: Using `BG`, you can define a tiled background's map and tile size, tile set, window size and position, and priority, as well as turn it on or off.
de: Mit `BG` können Sie die Karte und die Kachelgröße, den Kachelsatz, die Fenstergröße und -position sowie die Priorität eines gekachelten Hintergrunds definieren sowie ein- oder ausschalten.
es: Usando `BG`, puede definir un mapa de fondo en mosaico y tamaño de mosaico, conjunto de mosaicos, tamaño y posición de la ventana y prioridad, así como activarlo o desactivarlo.
fr: En utilisant `BG`, vous pouvez définir la carte et la taille de la tuile d'un arrière-plan en mosaïque, le jeu de tuiles, la taille et la position de la fenêtre, et la priorité, ainsi que l'activer ou la désactiver.
ja: `BG`を使用すると、タイル状の背景のマップとタイルサイズ、タイルセット、ウィンドウサイズと位置、優先度を定義したり、オンまたはオフにしたりできます。

source: `BG OFF` turns off all backgrounds.
de: `BG OFF` schaltet alle Hintergründe aus.
es: `BG OFF` desactiva todos los fondos.
fr: `BG OFF` désactive tous les arrière-plans.
ja: `BG OFF`は、すべての背景をオフにします。

source: background map width, in tiles
de: Hintergrundkartenbreite in Kacheln
es: ancho del mapa de fondo, en mosaicos
fr: largeur de la carte d'arrière-plan, en tuiles
ja: 背景マップの幅、タイル単位

source: background map height, in tiles
de: Hintergrundkartenhöhe in Kacheln
es: altura del mapa de fondo, en mosaicos
fr: hauteur de la carte d'arrière-plan, en tuiles
ja: 背景マップの高さ、タイル単位

source: tile set X coordinate, pixels [`0` to `PSIZE(0)-1`]
de: Kachelsatz X-Koordinate, Pixel [`0` bis `PSIZE(0)-1`]
fr: ensemble de tuiles coordonnée X, pixels [`0` à `PSIZE(0)-1`]
ja: タイルセットX座標、ピクセル[`0`から`PSIZE(0)-1`]

source: tile set Y coordinate, pixels [`0` to `PSIZE(2)-1`]
de: Kachelsatz Y-Koordinate, Pixel [`0` bis `PSIZE(2)-1`]
es: conjunto de mosaicos coordenada Y, píxeles [`0` a `PSIZE(2)-1`]
fr: ensemble de tuiles coordonnée Y, pixels [`0` à `PSIZE(2)-1`]
ja: タイルセットY座標、ピクセル[`0`から`PSIZE(2)-1`]

source: tile width, pixels [`8` (default) to `32`]
de: Kachelbreite, Pixel [`8` (Standard) bis `32`]
es: ancho de mosaico, píxeles [`8` (predeterminado) a `32`]
fr: largeur de la tuile, pixels [`8` (par défaut) à `32`]
ja: タイル幅、ピクセル[`8`（デフォルト）から`32`]

source: tile height, pixels [`8` (default) to `32`]
de: Kachelhöhe, Pixel [`8` (Standard) bis `32`]
es: altura del mosaico, píxeles [`8` (predeterminado) a `32`]
fr: hauteur de la tuile, pixels [`8` (par défaut) à `32`]
ja: タイルの高さ、ピクセル[`8`（デフォルト）から`32`]

source: window X coordinate, pixels [`0` (default) to `PSIZE(0)-1`]
de: Fenster X-Koordinate, Pixel [`0` (Standard) bis `PSIZE(0)-1`]
es: coordenada X de la ventana, píxeles [`0` (predeterminado) a `PSIZE(0)-1`]
fr: Coordonnée X de la fenêtre, pixels [`0` (par défaut) à `PSIZE(0)-1`]
ja: ウィンドウのX座標、ピクセル[`0`（デフォルト）から`PSIZE(0)-1`]

source: window Y coordinate, pixels [`0` (default) to `PSIZE(1)-1`]
de: Fenster Y-Koordinate, Pixel [`0` (Standard) bis `PSIZE(1)-1`]
es: coordenadas de ventana Y, píxeles [`0 '(predeterminado) a `PSIZE(1)-1`]
fr: coordonnée Y de la fenêtre, pixels [`0` (par défaut) à `PSIZE(1)-1`]
ja: ウィンドウのY座標、ピクセル[`0`（デフォルト）から`PSIZE(1)-1`]

source: window width, pixels [`9` to `PSIZE(0)-wx` (default)]
de: Fensterbreite, Pixel [`9` bis `PSIZE(0)-wx` (Standard)]
es: ancho de ventana, píxeles [`9` a `PSIZE(0)-wx` (predeterminado)]
fr: largeur de la fenêtre, pixels [`9` à `PSIZE(0)-wx` (par défaut)]
ja: ウィンドウ幅、ピクセル[`9`から`PSIZE(0)-wx`（デフォルト）]

source: window height, pixels [`0` to `PSIZE(1)-wy` (default)]
de: Fensterhöhe, Pixel [`0` bis `PSIZE(1)-wy` (Standard)]
es: altura de la ventana, píxeles [`0` a `PSIZE(1)-wy` (predeterminado)]
fr: hauteur de la fenêtre, pixels [`0` à `PSIZE(1)-wy` (par défaut)]
ja: ウィンドウの高さ、ピクセル[`0`から`PSIZE(1)-wy`（デフォルト）]

source: * The `BG` command's attributes can be specified in any order, but it is usually a good idea to place the `ON` attribute at the end if used.
de: * Die Attribute des Befehls `BG` können in beliebiger Reihenfolge angegeben werden. In der Regel empfiehlt es sich jedoch, das Attribut `ON` am Ende zu platzieren, wenn es verwendet wird.
es: * Los atributos del comando `BG` se pueden especificar en cualquier orden, pero generalmente es una buena idea colocar el atributo `ON` al final si se usa.
fr: * Les attributs de la commande `BG` peuvent être spécifiés dans n'importe quel ordre, mais c'est généralement une bonne idée de placer l'attribut` ON` à la fin s'il est utilisé.
ja: * `BG`コマンドの属性は任意の順序で指定できますが、使用する場合は通常、最後に`ON`属性を配置することをお勧めします。

source: * A background cannot be turned on unless at least the `TILES` attribute is set. In order to get sensible output, it will probably be necessary to specify the `PATTERN` attribute as well.
de: * Ein Hintergrund kann nur aktiviert werden, wenn mindestens das Attribut `TILES` festgelegt ist. Um eine sinnvolle Ausgabe zu erhalten, muss wahrscheinlich auch das Attribut `PATTERN` angegeben werden.
es: * No se puede activar un fondo a menos que se establezca al menos el atributo `TILES`. Para obtener resultados razonables, probablemente también sea necesario especificar el atributo `PATTERN`.
fr: * Un arrière-plan ne peut être activé que si au moins l'attribut `TILES` est défini. Afin d'obtenir une sortie raisonnable, il sera probablement nécessaire de spécifier également l'attribut `PATTERN`.
ja: *少なくとも `TILES`属性が設定されていない限り、バックグラウンドをオンにすることはできません。賢明な出力を得るには、おそらく `PATTERN`属性も指定する必要があります。

source: If a background cannot be turned on, no error is generated.
de: Wenn ein Hintergrund nicht aktiviert werden kann, wird kein Fehler generiert.
es: Si no se puede activar un fondo, no se genera ningún error.
fr: Si un arrière-plan ne peut pas être activé, aucune erreur n'est générée.
ja: バックグラウンドをオンにできない場合、エラーは生成されません。

source: Loads a background map from a file.
de: Lädt eine Hintergrundkarte aus einer Datei.
es: Carga un mapa de fondo desde un archivo.
fr: Charge une carte d'arrière-plan à partir d'un fichier.
ja: ファイルから背景マップをロードします。

source: background number. [`0` to `{MAX_BG_m1}`]
de: Hintergrundnummer. [`0` bis `{MAX_BG_m1} `]
es: número de fondo. [`0` a `{MAX_BG_m1} `]
fr: numéro de fond. [`0` à `{MAX_BG_m1}`]
ja: 背景番号。[`0`から`{MAX_BG_m1}`]

source: name of background map file
de: Name der Hintergrundkartendatei
es: nombre del archivo de mapa de fondo
fr: nom du fichier de carte d'arrière-plan
ja: 背景マップファイルの名前

source: Saves a background map to a file.
de: Speichert eine Hintergrundkarte in einer Datei.
es: Guarda un mapa de fondo en un archivo.
fr: Enregistre une carte d'arrière-plan dans un fichier.
ja: 背景マップをファイルに保存します。

source: Does not check if the specified background is properly defined.
de: Überprüft nicht, ob der angegebene Hintergrund richtig definiert ist.
es: No comprueba si el fondo especificado está definido correctamente.
fr: Ne vérifie pas si l'arrière-plan spécifié est correctement défini.
ja: 指定された背景が正しく定義されているかどうかをチェックしません。

source: Scrolls a tiled background.
de: Scrollt einen gekachelten Hintergrund.
es: Desplaza un fondo de mosaico.
fr: Fait défiler un arrière-plan en mosaïque.
ja: タイル状の背景をスクロールします。

source: top/left corner offset horizontal, pixels
de: Versatz der oberen / linken Ecke horizontal, Pixel
es: Desplazamiento horizontal de la esquina superior / izquierda, píxeles
fr: décalage du coin supérieur / gauche horizontal, pixels
ja: 上/左隅のオフセット水平、ピクセル

source: top/left corner offset vertical, pixels
de: Versatz der oberen / linken Ecke vertikal, Pixel
es: Desplazamiento vertical de la esquina superior / izquierda, píxeles
fr: Offset de coin supérieur / gauche Vertical, Pixels
ja: 上/左隅のオフセット垂直、ピクセル

source: There are no restrictions on the coordinates that can be used; backgrounds maps wrap around if the display window extends beyond the map boundaries.
de: Es gibt keine Einschränkungen für die Koordinaten, die verwendet werden können. Hintergrundkarten werden umbrochen, wenn sich das Anzeigefenster über die Kartengrenzen hinaus erstreckt.
es: No hay restricciones sobre las coordenadas que se pueden utilizar; los mapas de fondo se envuelven si la ventana de visualización se extiende más allá de los límites del mapa.
fr: Il n'y a aucune restriction sur les coordonnées qui peuvent être utilisées; les cartes de fond s'enroulent si la fenêtre d'affichage s'étend au-delà des limites de la carte.
ja: 使用できる座標に制限はありません。表示ウィンドウがマップの境界を超えている場合、背景マップは折り返されます。

source: Defines a sprite's properties.
de: Definiert die Eigenschaften eines Sprites.
es: Define las propiedades de un sprite.
fr: Définit les propriétés d'un sprite.
ja: スプライトのプロパティを定義します。

source: Using `SPRITE`, you can define a sprite's appearance, size, animation frame, color key, prority, special effects, and turn it on and off.
de: Mit `SPRITE` können Sie das Erscheinungsbild, die Größe, den Animationsrahmen, den Farbschlüssel, die Prorität und die Spezialeffekte eines Sprites definieren und ein- und ausschalten.
es: Usando `SPRITE`, puedes definir la apariencia, el tamaño, el marco de animación, la clave de color, la prioridad, los efectos especiales de un sprite y activarlo y desactivarlo.
fr: En utilisant `SPRITE`, vous pouvez définir l'apparence, la taille, le cadre d'animation, la clé de couleur, la priorité, les effets spéciaux d'un sprite et l'activer et le désactiver.
ja: `SPRITE`を使用すると、スプライトの外観、サイズ、アニメーションフレーム、カラーキー、プロリティ、特殊効果を定義し、オンとオフを切り替えることができます。

source: `SPRITE OFF` turns all sprites off.
de: `SPRITE OFF` schaltet alle Sprites aus.
es: `SPRITE OFF` apaga todos los sprites.
fr: `SPRITE OFF` désactive tous les sprites.
ja: `SPRITE OFF`は、すべてのスプライトをオフにします。

source: coordinate of the top/left sprite pattern, pixels
de: Koordinate des oberen / linken Sprite-Patterns, Pixel
es: coordenada del patrón de sprite superior / izquierdo, píxeles
fr: coordonnée du motif de sprite supérieur / gauche, pixels
ja: 上/左スプライトパターンの座標、ピクセル

source: sprite width, pixels [`0` to `{MAX_SPRITE_W_m1}`]
de: Sprite-Breite, Pixel [`0` bis `{MAX_SPRITE_W_m1} `]
es: ancho de sprite, píxeles [`0` a `{MAX_SPRITE_W_m1} `]
fr: largeur du sprite, pixels [`0` à `{MAX_SPRITE_W_m1}`]
ja: スプライト幅、ピクセル[`0`から`{MAX_SPRITE_W_m1}`]

source: sprite height, pixels [`0` to `{MAX_SPRITE_H_m1}`]
de: Sprite-Höhe, Pixel [`0` bis `{MAX_SPRITE_H_m1} `]
es: Altura de sprite, píxeles [`0` a `{max_sprite_h_m1 }`]
fr: hauteur du sprite, pixels [`0` à `{MAX_SPRITE_H_m1}`]
ja: スプライトの高さ、ピクセル[`0`から`{MAX_SPRITE_H_m1}`]

source: X coordinate of the pattern section to be used, in multiples of sprite width
de: X-Koordinate des zu verwendenden Patternabschnitts in Vielfachen der Sprite-Breite
es: Coordenada X de la sección del patrón que se utilizará, en múltiplos del ancho del sprite
fr: Coordonnée X de la section du motif à utiliser, en multiples de la largeur du sprite
ja: 使用するパターンセクションのX座標（スプライト幅の倍数）

source: Y coordinate of the pattern section to be used, in multiples of sprite height
de: Y-Koordinate des zu verwendenden Patternabschnitts in Vielfachen der Sprite-Höhe
es: Coordenada Y de la sección del patrón que se utilizará, en múltiplos de la altura del sprite
fr: Coordonnée Y de la section de motif à utiliser, en multiples de la hauteur du sprite
ja: 使用するパターンセクションのY座標、スプライトの高さの倍数

source: special effect flags [`0` to `7`]
de: Spezialeffekt-Flags [`0` bis `7`]
es: banderas de efectos especiales [`0` a `7`]
fr: drapeaux d'effets spéciaux [0 à 7].
ja: 特殊効果フラグ[`0`から`7`]

source: key color value to be used for transparency masking
de: Schlüsselfarbwert für die Transparenzmaskierung
es: valor de color clave que se utilizará para el enmascaramiento de transparencia
fr: valeur de couleur clé à utiliser pour le masquage de transparence
ja: 透明度マスキングに使用されるキーカラー値

source: sprite priority in relation to background layers [`0` to `{MAX_BG_m1}`]
de: Sprite-Priorität in Bezug auf Hintergrundebenen [`0` bis `{MAX_BG_m1} `]
es: prioridad de los sprites en relación con las capas de fondo [`0` a `{MAX_BG_m1} `]
fr: priorité du sprite par rapport aux calques d'arrière-plan [`0` à `{MAX_BG_m1}`]
ja: 背景レイヤーに関連するスプライトの優先度[`0`から`{MAX_BG_m1}`]

source: rotation angle in degrees [default `0`]
de: Drehwinkel in Grad [Standard `0`]
es: ángulo de rotación en grados [predeterminado `0`]
fr: angle de rotation en degrés [par défaut `0`]
ja: 回転角（度単位）[デフォルトは `0`]

source: horizontal scaling factor [default `1`]
de: horizontaler Skalierungsfaktor [Standard `1`]
es: factor de escala horizontal [predeterminado `1`]
fr: facteur de mise à l'échelle horizontale [par défaut `1`]
ja: 水平スケーリング係数[デフォルト`1`

source: vertical scaling factor [default `1`]
de: vertikaler Skalierungsfaktor [Standard `1`]
es: factor de escala vertical [predeterminado `1`]
fr: facteur de mise à l'échelle verticale [par défaut `1`]
ja: 垂直スケーリング係数[デフォルト `1`

source: sprite opacity [`0` to `255`, default `255`]
de: Sprite-Deckkraft [`0` bis `255`, Standard `255`]
es: opacidad del sprite [`0` a `255`, predeterminado `255`]
fr: opacité du sprite [`0` à `255`, par défaut `255`]
ja: スプライトの不透明度[`0`から`255`、デフォルトは `255`]

source: The `FLAGS` attribute is the sum of any of the following bit values:
de: Das Attribut `FLAGS` ist die Summe der folgenden Bitwerte:
es: El atributo `FLAGS` es la suma de cualquiera de los siguientes valores de bit:
fr: L'attribut `FLAGS` est la somme de l'une des valeurs de bit suivantes:
ja: `FLAGS`属性は、次のビット値のいずれかの合計です。

source: Bit value
de: Bitwert
es: Valor de bit
fr: Valeur de bit
ja: ビット値

source: Effect
de: Wirkung
es: Efecto
fr: Effet
ja: 効果

source: Sprite opacity (opaque if set)
de: Sprite-Deckkraft (undurchsichtig, falls eingestellt)
es: Opacidad de Sprite (opaco si está configurado)
fr: Opacité du sprite (opaque si défini)
ja: スプライトの不透明度（設定されている場合は不透明）

source: Horizontal flip
de: Horizontaler Flip
es: Volteo horizontal
fr: Retournement horizontal
ja: 水平フリップ

source: Vertical flip
de: Vertikaler Flip
es: Volteo vertical
fr: Retournement vertical
ja: 垂直フリップ

source: * The `SPRITE` command's attributes can be specified in any order, but it is usually a good idea to place the `ON` attribute at the end if used.
de: * Die Attribute des Befehls `SPRITE` können in beliebiger Reihenfolge angegeben werden. In der Regel empfiehlt es sich jedoch, das Attribut `ON` am Ende zu platzieren, wenn es verwendet wird.
es: * Los atributos del comando `SPRITE` se pueden especificar en cualquier orden, pero generalmente es una buena idea colocar el atributo `ON` al final si se usa.
fr: * Les attributs de la commande `SPRITE` peuvent être spécifiés dans n'importe quel ordre, mais c'est généralement une bonne idée de placer l'attribut` ON` à la fin s'il est utilisé.
ja: * `SPRITE`コマンドの属性は任意の順序で指定できますが、使用する場合は通常、最後に`ON`属性を配置することをお勧めします。

source: * The `ALPHA` attribute is only available on true-color platforms.
de: * Das Attribut `Alpha` ist nur auf True-Color-Plattformen verfügbar.
es: * El atributo `ALPHA` solo está disponible en plataformas de color verdadero.
fr: * L'attribut `ALPHA` n'est disponible que sur les plates-formes de couleurs vraies.
ja: * `ALPHA`属性は、トゥルーカラープラットフォームでのみ使用できます。

source: Having to specify the rotation angle in degrees is cumbersome when using other trigonometric operations to calculate it.
de: Die Angabe des Drehwinkels in Grad ist umständlich, wenn andere trigonometrische Operationen zur Berechnung verwendet werden.
es: Tener que especificar el ángulo de rotación en grados es engorroso cuando se utilizan otras operaciones trigonométricas para calcularlo.
fr: Le fait de devoir spécifier l'angle de rotation en degrés est fastidieux lorsque l'on utilise d'autres opérations trigonométriques pour le calculer.
ja: 他の三角関数を使用して回転角を計算する場合、回転角を度で指定する必要があるのは面倒です。

source: Moves a sprite.
de: Verschiebt ein Sprite.
es: Mueve un objeto.
fr: Déplace un sprite.
ja: スプライトを移動します。

source: There are no restrictions on the coordinates that can be used; sprites that are placed completely outside the dimensions of the current screen mode will not be drawn.
de: Es gibt keine Einschränkungen für die Koordinaten, die verwendet werden können. Sprites, die vollständig außerhalb der Abmessungen des aktuellen Bildschirmmodus platziert sind, werden nicht gezeichnet.
es: No hay restricciones sobre las coordenadas que se pueden utilizar; los sprites que se colocan completamente fuera de las dimensiones del modo de pantalla actual no se dibujarán.
fr: Il n'y a aucune restriction sur les coordonnées qui peuvent être utilisées; Les sprites placés complètement en dehors des dimensions du mode d'écran actuel ne seront pas dessinés.
ja: 使用できる座標に制限はありません。現在の画面モードの寸法の完全に外側に配置されたスプライトは描画されません。

source: Sets the value of one or more background tiles.
de: Legt den Wert einer oder mehrerer Hintergrundkacheln fest.
es: Establece el valor de uno o más mosaicos de fondo.
fr: Définit la valeur d'une ou plusieurs mosaïques d'arrière-plan.
ja: 1つ以上の背景タイルの値を設定します。

source: tile X coordinate [`0` to background width in tiles]
de: Kachel-X-Koordinate [`0` zur Hintergrundbreite in Kacheln]
es: Coordenada X del mosaico [`0` al ancho del fondo en mosaicos]
fr: Coordonnée X du carreau [`0` à la largeur du fond en carreaux]
ja: タイルX座標 [`0` から背景の幅（タイル単位）]まで

source: tile Y coordinate [`0` to background height in tiles]
de: Kachel-Y-Koordinate [`0` zur Hintergrundhöhe in Kacheln]
es: Coordenada Y del mosaico [`0` a la altura del fondo en mosaicos]
fr: coordonnée Y du carreau [`0` à la hauteur de l'arrière-plan en carreaux]

source: tile identifier [`0` to `255`]
de: Kachelkennung [`0` bis `255`]
es: identificador de mosaico [`0` a `255`]
fr: identificateur de tuile [`0` à `255`]
ja: タイル識別子[`0`から`255`]

source: tile identifiers
de: Kachel-IDs
es: identificadores de mosaico
fr: identificateurs de tuile
ja: タイル識別子

source: Creates a mapping from one tile to another.
de: Erstellt eine Zuordnung von einer Kachel zur anderen.
es: Crea un mapeo de un mosaico a otro.
fr: Crée un mappage d'une tuile à une autre.
ja: あるタイルから別のタイルへのマッピングを作成します。

source: Sets the number of frames that should be skipped before a new frame is rendered by the BG/sprite engine.
de: Legt die Anzahl der Frames fest, die übersprungen werden sollen, bevor ein neuer Frame von der BG / Sprite-Engine gerendert wird.
es: Establece el número de fotogramas que se deben omitir antes de que el motor BG / sprite represente un nuevo fotograma.
fr: Définit le nombre d'images à ignorer avant qu'une nouvelle image ne soit rendue par le moteur BG / sprite.
ja: BG /スプライトエンジンによって新しいフレームがレンダリングされる前にスキップする必要があるフレームの数を設定します。

source: This serves to increase the available CPU power to BASIC by reducing the load imposed by the graphics subsystem.
de: Dies dient dazu, die verfügbare CPU-Leistung für BASIC zu erhöhen, indem die vom Grafiksubsystem auferlegte Last verringert wird.
es: Esto sirve para aumentar la potencia de CPU disponible a BASIC al reducir la carga impuesta por el subsistema de gráficos.
fr: Cela sert à augmenter la puissance CPU disponible en BASIC en réduisant la charge imposée par le sous-système graphique.
ja: これは、グラフィックサブシステムによって課せられる負荷を減らすことにより、BASICで使用可能なCPUパワーを増やすのに役立ちます。

source: Checks if a sprite has collided with a background tile.
de: Überprüft, ob ein Sprite mit einer Hintergrundkachel kollidiert ist.
es: Comprueba si un objeto ha chocado con un mosaico de fondo.
fr: Vérifie si un sprite est entré en collision avec une tuile d'arrière-plan.
ja: スプライトが背景タイルに衝突したかどうかを確認します。

source: sprite number [`0` to `{MAX_SPRITES_m1}`]
de: Sprite-Nummer [`0` bis `{MAX_SPRITES_m1} `]
es: número de sprite [`0` a `{MAX_SPRITES_m1} `]
fr: numéro de sprite [`0` à `{MAX_SPRITES_m1}`]
ja: スプライト番号[`0`から`{MAX_SPRITES_m1}`]

source: tile number [`0` to `255`]
de: Kachelnummer [`0` bis `255`]
es: número de mosaico [`0` a `255`]
fr: numéro de tuile [`0` à `255`]
ja: タイル番号[`0`から`255`]

source: If the return value is `0`, no collision has taken place. Otherwise the return value is the sum of `64` and any of the following bit values:
de: Wenn der Rückgabewert `0` ist, hat keine Kollision stattgefunden. Andernfalls ist der Rückgabewert die Summe aus `64` und einem der folgenden Bitwerte:
es: Si el valor de retorno es `0`, no se ha producido ninguna colisión. De lo contrario, el valor de retorno es la suma de `64` y cualquiera de los siguientes valores de bits:
fr: Si la valeur de retour est `0`, aucune collision n'a eu lieu. Sinon, la valeur de retour est la somme de `64` et de l'une des valeurs de bits suivantes:
ja: 戻り値が `0`の場合、衝突は発生していません。それ以外の場合、戻り値は `64`と次のビット値のいずれかの合計です。

source: Meaning
de: Bedeutung
es: Significado
fr: Sens
ja: 意味

source: The tile is below the sprite.
de: Die Kachel befindet sich unter dem Sprite.
es: El mosaico está debajo del objeto.
fr: La tuile est sous le sprite.
ja: タイルはスプライトの下にあります。

source: The tile is right of the sprite.
de: Die Kachel befindet sich rechts vom Sprite.
es: El mosaico está a la derecha del objeto.
fr: La tuile est à droite du sprite.
ja: タイルはスプライトの右側にあります。

source: The tile is above the sprite.
de: Die Kachel befindet sich über dem Sprite.
es: El mosaico está encima del objeto.
fr: La tuile est au-dessus du sprite.
ja: タイルはスプライトの上にあります。

source: WARNING: This function has never been tested.
de: WARNUNG: Diese Funktion wurde noch nie getestet.
es: ADVERTENCIA: esta función nunca ha sido probada.
fr: AVERTISSEMENT: cette fonction n'a jamais été testée.
ja: 警告：この機能はテストされていません。

source: Unlike `SPRCOLL()`, tile collision detection is not pixel-accurate.
de: Im Gegensatz zu SPRCOLL() ist die Erkennung von Kachelkollisionen nicht pixelgenau.
es: A diferencia de `SPRCOLL()`, la detección de colisiones de mosaicos no es precisa en píxeles.
fr: Contrairement à SPRCOLL(), la détection de collision de tuiles n'est pas précise au pixel près.
ja: `SPRCOLL()`とは異なり、タイルの衝突検出はピクセル精度ではありません。

source: Checks if a sprite has collided with another sprite.
de: Überprüft, ob ein Sprite mit einem anderen Sprite kollidiert ist.
es: Comprueba si un sprite ha chocado con otro sprite.
fr: Vérifie si un sprite est entré en collision avec un autre sprite.
ja: スプライトが別のスプライトと衝突したかどうかを確認します。

source: sprite number 1 [`0` to `{MAX_SPRITES_m1}`]
de: Sprite Nummer 1 [`0` bis `{MAX_SPRITES_m1} `]
es: sprite número 1 [`0` a `{MAX_SPRITES_m1} `]
fr: sprite numéro 1 [`0` à `{MAX_SPRITES_m1}`]
ja: スプライト番号1 [`0`から`{MAX_SPRITES_m1}`]

source: sprite number 2 [`0` to `{MAX_SPRITES_m1}`]
de: Sprite Nummer 2 [`0` bis `{MAX_SPRITES_m1} `]
es: sprite número 2 [`0` a `{MAX_SPRITES_m1} `]
fr: sprite numéro 2 [`0` à `{MAX_SPRITES_m1}`]
ja: スプライト番号2 [`0`から`{MAX_SPRITES_m1}`]
