Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: Read a half-word (16 bits) of data from an address in memory.
de: Liest ein halbes Wort (16 Bit) Daten von einer Adresse im Speicher.
es: Leer media palabra (16 bits) de datos de una dirección en la memoria.
fr: Lire un demi-mot (16 bits) de données à partir d'une adresse en mémoire.
ja: メモリ内のアドレスからハーフワード（16ビット）のデータを読み取ります。

source: Memory at `addr` must allow byte-wise access, and `addr` must be 2-byte aligned.
de: Der Speicher bei `addr` muss einen byteweisen Zugriff ermöglichen, und `addr` muss 2-Byte-ausgerichtet sein.
es: La memoria en `addr` debe permitir el acceso por bytes, y` addr` debe estar alineado con 2 bytes.
fr: La mémoire à `addr` doit permettre un accès octet par octet et` addr` doit être aligné sur 2 octets.
ja: `addr`のメモリはバイト単位のアクセスを許可する必要があり、`addr`は2バイトで整列されている必要があります。

source: Read a word (32 bits) of data from an address in memory.
de: Liest ein Wort (32 Bit) von Daten von einer Adresse im Speicher.
es: Leer una palabra (32 bits) de datos de una dirección en la memoria.
fr: Lire un mot (32 bits) de données à partir d'une adresse en mémoire.
ja: メモリ内のアドレスからデータのワード（32ビット）を読み取ります。

source: `addr` must be 4-byte aligned.
de: `addr` muss 4 Byte ausgerichtet sein.
es: `addr` debe estar alineado con 4 bytes.
fr: `addr` doit être aligné sur 4 octets.
ja: `addr`は4バイトに揃える必要があります。

source: Write a byte to an address in memory.
de: Schreibt ein Byte an eine Adresse im Speicher.
es: Escribe un byte en una dirección en la memoria.
fr: Écrivez un octet dans une adresse en mémoire.
ja: メモリ内のアドレスにバイトを書き込みます。

source: value to be written
de: Wert, der geschrieben werden soll
es: valor por escribir
fr: valeur à écrire
ja: 書き込まれる値

source: `addr` must be mapped writable and must allow byte-wise access.
de: `addr` muss beschreibbar zugeordnet sein und byteweisen Zugriff ermöglichen.
es: `addr` debe tener capacidad de escritura y debe permitir el acceso por bytes.
fr: `addr` doit être mappé en écriture et doit autoriser l'accès par octet.
ja: `addr`は書き込み可能にマップされ、バイト単位のアクセスを許可する必要があります。

source: Write a half-word (16 bits) to an address in memory.
de: Schreibt ein Halbwort (16 Bit) an eine Adresse im Speicher.
es: Escriba media palabra (16 bits) en una dirección en la memoria.
fr: Ecrivez un demi-mot (16 bits) sur une adresse en mémoire.
ja: メモリ内のアドレスにハーフワード（16ビット）を書き込みます。

source: Write a word (32 bits) to an address in memory.
de: Schreibt ein Wort (32 Bit) an eine Adresse im Speicher.
es: Escribe una palabra (32 bits) en una dirección en la memoria.
fr: Ecrire un mot (32 bits) à une adresse en mémoire.
ja: メモリ内のアドレスにワード（32ビット）を書き込みます。

source: Call a machine language routine.
de: Ruft eine Maschinensprachenroutine auf.
es: Llame a una rutina de lenguaje de máquina.
fr: Appelez une routine de langage machine.
ja: 機械語ルーチンを呼び出します。

source: WARNING: Using this command incorrectly may crash the system, or worse.
de: WARNUNG: Wenn Sie diesen Befehl falsch verwenden, kann das System abstürzen oder schlimmer.
es: ADVERTENCIA: El uso incorrecto de este comando puede bloquear el sistema o algo peor.
fr: AVERTISSEMENT: l'utilisation incorrecte de cette commande peut faire planter le système ou pire.
ja: 警告：このコマンドを誤って使用すると、システムがクラッシュするか、さらに悪い場合があります。

source: No sanity checks are performed on the address.
de: An der Adresse werden keine Sanitätsprüfungen durchgeführt.
es: No se realizan controles de cordura en la dirección.
fr: Aucun contrôle de cohérence n'est effectué sur l'adresse.
ja: アドレスに対して健全性チェックは実行されません。

source: Sets the current date and time.
de: Legt das aktuelle Datum und die aktuelle Uhrzeit fest.
es: Establece la fecha y hora actuales.
fr: Définit la date et l'heure actuelles.
ja: 現在の日付と時刻を設定します。

source: numeric expression [`1900` to `2036`]
de: numerischer Ausdruck [`1900` bis `2036`]
es: expresión numérica [`1900` a `2036`]
fr: expression numérique [`1900` à `2036`]
ja: 数値式 [`1900`から`2036`]

source: numeric expression [`1` to `12`]
de: numerischer Ausdruck [`1` bis `12`]
es: expresión numérica [`1` a `12`]
fr: expression numérique [`1` à `12`]
ja: 数値式 [`1`から`12`]

source: numeric expression [`1` to `31`]
de: numerischer Ausdruck [`1` bis `31`]
es: expresión numérica [`1` a `31`]
fr: expression numérique [`1` à `31`]
ja: 数値式 [`1`から`31`]

source: numeric expression [`0` to `23`]
de: numerischer Ausdruck [`0` bis `23`]
es: expresión numérica [`0` a `23`]
fr: expression numérique [`0` à `23`]
ja: 数値式 [`0`から`23`]

source: numeric expression [`0` to `59`]
de: numerischer Ausdruck [`0` bis `59`]
es: expresión numérica [`0` a `59`]
fr: expression numérique [`0` à `59`]
ja: 数値式 [`0`から`59`]

source: numeric expression [`0` to `61`]
de: numerischer Ausdruck [`0` bis `61`]
es: expresión numérica [`0` a `61`]
fr: expression numérique [`0` à `61`]
ja: 数値式 [`0`から`61`]

source: It is unclear why the maximum value for `second` is 61 and not 59.
de: Es ist unklar, warum der Maximalwert für `second` 61 und nicht 59 beträgt.
es: No está claro por qué el valor máximo de "segundo" es 61 y no 59.
fr: On ne sait pas pourquoi la valeur maximale de `seconde` est 61 et non 59.
ja: `second`の最大値が59ではなく61である理由は不明です。

source: Get the current date.
de: Holt sich das aktuelle Datum.
es: Obtenga la fecha actual.
fr: Obtenez la date actuelle.
ja: 現在の日付を取得します。

source: numeric variable
de: numerische Variable
es: variable numérica
fr: variable numérique
ja: 数値変数

source: The current date in the given numeric variables.
de: Das aktuelle Datum in den angegebenen numerischen Variablen.
es: La fecha actual en las variables numéricas dadas.
fr: La date actuelle dans les variables numériques données.

source: Only supports scalar variables, not array or list members.
de: Unterstützt nur skalare Variablen, keine Array- oder Listenmitglieder.
es: Solo admite variables escalares, no miembros de matriz o lista.
fr: Prend uniquement en charge les variables scalaires, pas les membres de tableau ou de liste.
ja: 配列またはリストのメンバーではなく、スカラー変数のみをサポートします。

source: WARNING: The syntax and semantics of this command are not consistent with other BASIC implementations and may be changed in future releases.
de: WARNUNG: Die Syntax und Semantik dieses Befehls stimmen nicht mit anderen BASIC-Implementierungen überein und können in zukünftigen Versionen geändert werden.
es: ADVERTENCIA: La sintaxis y la semántica de este comando no son consistentes con otras implementaciones de BASIC y pueden cambiar en futuras versiones.
fr: AVERTISSEMENT: la syntaxe et la sémantique de cette commande ne sont pas cohérentes avec les autres implémentations BASIC et peuvent être modifiées dans les versions futures.
ja: 警告：このコマンドの構文とセマンティクスは、他のBASIC実装と一貫性がなく、将来のリリースで変更される可能性があります。

source: Get the current time.
de: Holt sich die aktuelle Zeit.
es: Obtenga la hora actual.
fr: Obtenez l'heure actuelle.
ja: 現在の時刻を取得します。

source: The current time in the given numeric variables.
de: Die aktuelle Zeit in den angegebenen numerischen Variablen.
es: La hora actual en las variables numéricas dadas.
fr: L'heure actuelle dans les variables numériques données.
ja: 指定された数値変数の現在の時刻。

source: Prints the current date and time.
de: Druckt das aktuelle Datum und die aktuelle Uhrzeit.
es: Imprime la fecha y hora actuales.
fr: Imprime la date et l'heure actuelles.
ja: 現在の日付と時刻を出力します。

source: WARNING: The semantics of this command are not consistent with other BASIC implementations and may be changed in future releases.
de: WARNUNG: Die Semantik dieses Befehls stimmt nicht mit anderen BASIC-Implementierungen überein und kann in zukünftigen Versionen geändert werden.
es: ADVERTENCIA: La semántica de este comando no es consistente con otras implementaciones BASIC y puede cambiarse en versiones futuras.
fr: AVERTISSEMENT: la sémantique de cette commande n'est pas cohérente avec les autres implémentations BASIC et peut être modifiée dans les versions futures.
ja: 警告：このコマンドのセマンティクスは他のBASIC実装と一致しておらず、将来のリリースで変更される可能性があります。

source: Prints information on Engine BASIC's components, its authors and licensing conditions.
de: Druckt Informationen zu den Komponenten von Engine BASIC, ihren Autoren und Lizenzbedingungen.
es: Imprime información sobre los componentes de Engine BASIC, sus autores y condiciones de licencia.
fr: Imprime des informations sur les composants d'Engine BASIC, ses auteurs et les conditions de licence.
ja: Engine BASICのコンポーネント、その作成者、およびライセンス条件に関する情報を出力します。

source: Run Z-machine program.
de: Führt das Z-Maschinenprogramm aus.
es: Ejecute el programa Z-machine.
fr: Exécutez le programme Z-machine.
ja: Zマシンプログラムを実行します。

source: name of a z-code file
de: Name einer Z-Code-Datei
es: nombre de un archivo de código z
fr: nom d'un fichier z-code
ja: Zコードファイルの名前

source: Retrieve internal system addresses and parameters.
de: Ruft interne Systemadressen und -parameter ab.
es: Recupere direcciones y parámetros internos del sistema.
fr: Récupérez les adresses et les paramètres du système interne.
ja: 内部システムアドレスとパラメータを取得します。

source: number of the item of information to be retrieved
de: Nummer der abzurufenden Information
es: número del elemento de información que se va a recuperar
fr: numéro de l'information à récupérer
ja: 取得する情報項目の番号

source: Requested information.
de: Angeforderte Information.
es: Información solicitada.
fr: Information demandée.
ja: 要求された情報。

source: The following internal information can be retrieved using `SYS()`:
de: Die folgenden internen Informationen können mit `SYS()` abgerufen werden:
es: La siguiente información interna se puede recuperar usando `SYS()`:
fr: Les informations internes suivantes peuvent être récupérées en utilisant `SYS()`:
ja: 次の内部情報は、 `SYS()`を使用して取得できます。

source: memory address of BASIC program buffer
de: Speicheradresse des BASIC-Programmpuffers
es: dirección de memoria del búfer de programa BÁSICO
fr: adresse mémoire du tampon de programme BASIC
ja: BASICプログラムバッファのメモリアドレス

source: memory address of current font
de: Speicheradresse der aktuellen Schriftart
es: dirección de memoria de la fuente actual
fr: adresse mémoire de la police actuelle
ja: 現在のフォントのメモリアドレス

source: Get free memory size.
de: Holt sich freie Speichergröße.
es: Obtenga tamaño de memoria libre.
fr: Obtenez de la mémoire libre.
ja: 空きメモリサイズを取得します。

source: Number of bytes free.
de: Anzahl der freien Bytes.
es: Número de bytes libres.
fr: Nombre d'octets libres.
ja: 空きバイト数。

source: Returns the elapsed time since power-on.
de: Gibt die seit dem Einschalten verstrichene Zeit zurück.
es: Devuelve el tiempo transcurrido desde el encendido.
fr: Renvoie le temps écoulé depuis la mise sous tension.
ja: 電源投入からの経過時間を返します。

source: unit of time [`0` for milliseconds, `1` for seconds, default: `0`]
de: Zeiteinheit [`0` für Millisekunden, `1` für Sekunden, Standard: `0`]
es: unidad de tiempo [`0` para milisegundos, `1` para segundos, predeterminado: `0`]
fr: unité de temps [`0` pour les millisecondes, `1` pour les secondes, par défaut: `0`]
ja: 時間の単位[ミリ秒の場合は `0`、秒の場合は`1`、デフォルト： `0`]

source: Time elapsed.
de: Verstrichene Zeit.
es: Tiempo transcurrido.
fr: Temps écoulé.
ja: 時間経過。

source: Displays internal information about the system.
de: Zeigt interne Informationen zum System an.
es: Muestra información interna sobre el sistema.
fr: Affiche des informations internes sur le système.
ja: システムに関する内部情報を表示します。

source: `SYSINFO` displays the following information:
de: `SYSINFO` zeigt die folgenden Informationen an:
es: `SYSINFO` muestra la siguiente información:
fr: `SYSINFO` affiche les informations suivantes:
ja: `SYSINFO`は次の情報を表示します。

source: * Program size,
de: * Programmgröße,
es: * Tamaño del programa,
fr: * Taille du programme,
ja: *プログラムサイズ、

source: * statistics on scalar, array and list variables, both numeric and string,
de: * Statistiken zu Skalar-, Array- und Listenvariablen, sowohl numerisch als auch Strings,
es: * estadísticas sobre variables escalares, de matriz y de lista, tanto numéricas como de cadena,
fr: * statistiques sur les variables scalaires, de tableau et de liste, à la fois numérique et chaîne,
ja: *数値変数と文字列の両方のスカラー変数、配列変数、リスト変数に関する統計、

source: * loop and return stack depths,
de: * Schleifen- und Rückgabestapeltiefen,
es: * profundidades de pila de bucle y retorno,
fr: * les profondeurs de boucle et de retour de pile,
ja: *ループとリターンスタックの深さ、

source: * CPU stack pointer address,
de: * CPU-Stapelzeigeradresse,
es: * Dirección de puntero de pila de CPU,
fr: * Adresse du pointeur de pile CPU,
ja: * CPUスタックポインタアドレス、

source: * free memory size and
de: * freie Speichergröße und
es: * tamaño de memoria libre y
fr: * taille de la mémoire libre et
ja: * メモリサイズが無料、

source: * video timing information (nominal and actual cycles per frame).
de: * Video-Timing-Informationen (nominelle und tatsächliche Zyklen pro Frame).
es: * información de tiempo de video (ciclos nominales y reales por cuadro).
fr: * informations de synchronisation vidéo (cycles nominaux et réels par image).
ja: *ビデオタイミング情報（フレームあたりの公称および実際のサイクル）。

source: Boots the system from the specified flash page.
de: Startet das System von der angegebenen Flash-Seite.
es: Inicia el sistema desde la página flash especificada.
fr: Démarre le système à partir de la page flash spécifiée.
ja: 指定されたフラッシュページからシステムを起動します。

source: The `BOOT` command does not verify if valid firmware code is installed at the given flash page. Use with caution.
de: Der Befehl `BOOT` überprüft nicht, ob auf der angegebenen Flash-Seite ein gültiger Firmware-Code installiert ist. Mit Vorsicht verwenden.
es: El comando `BOOT` no verifica si el código de firmware válido está instalado en la página flash dada. Úselo con precaución.
fr: La commande `BOOT` ne vérifie pas si un code de micrologiciel valide est installé sur la page flash donnée. Utiliser avec précaution.
ja: `BOOT`コマンドは、有効なファームウェアコードが指定されたフラッシュページにインストールされているかどうかを確認しません。注意して使用してください。

source: Declares an array.
de: Deklariert ein Array.
es: Declara una matriz.
fr: Déclare un tableau.
ja: 配列を宣言します。

source: an numeric or string array variable
de: eine numerische oder String-Array-Variable
es: una variable de matriz numérica o de cadena
fr: une variable de tableau numérique ou chaîne
ja: 数値または文字列配列変数

source: one or more dimensions of the array
de: eine oder mehrere Dimensionen des Arrays
es: una o más dimensiones de la matriz
fr: une ou plusieurs dimensions du tableau
ja: 配列の1つ以上の次元

source: initial value(s) for the array elements
de: Anfangswert(e) für die Array-Elemente
es: valor (es) inicial (es) para los elementos de la matriz
fr: valeur (s) initiale (s) des éléments du tableau
ja: 配列要素の初期値

source: Initialization is only possible for one-dimensional arrays.
de: Die Initialisierung ist nur für eindimensionale Arrays möglich.
es: La inicialización solo es posible para matrices unidimensionales.
fr: L'initialisation n'est possible que pour les tableaux unidimensionnels.
ja: 初期化は、1次元配列でのみ可能です。

source: Appends an element to the end of a list.
de: Hängt ein Element an das Ende einer Liste an.
es: Agrega un elemento al final de una lista.
fr: Ajoute un élément à la fin d'une liste.
ja: リストの最後に要素を追加します。

source: a numeric or string list variable
de: eine numerische oder String-Listenvariable
es: una variable de lista numérica o de cadena
fr: une variable de liste numérique ou chaîne
ja: 数値または文字列リスト変数

source: Adds an element to the start of a list.
de: Fügt dem Anfang einer Liste ein Element hinzu.
es: Agrega un elemento al comienzo de una lista.
fr: Ajoute un élément au début d'une liste.
ja: リストの先頭に要素を追加します。

source: Assigns the value of an expression to a variable.
de: Weist einer Variablen den Wert eines Ausdrucks zu.
es: Asigna el valor de una expresión a una variable.
fr: Attribue la valeur d'une expression à une variable.
ja: 式の値を変数に割り当てます。

source: any variable
de: jede Variable
es: cualquier variable
fr: toute variable
ja: 任意の変数

source: any expression that is of the same type as `variable`
de: Jeder Ausdruck, der vom gleichen Typ ist wie `Variable`
es: cualquier expresión que sea del mismo tipo que `variable`
fr: toute expression du même type que `variable`
ja: `variable`と同じタイプの式

source: The use of this command is optional; any variable assignment can be written as `variable = expression`, without prefixing it with `LET`.
de: Die Verwendung dieses Befehls ist optional. Jede Variablenzuweisung kann als `variable = ausdruck` geschrieben werden, ohne dass `LET` vorangestellt wird.
es: El uso de este comando es opcional; cualquier asignación de variable se puede escribir como `variable = expresión`, sin prefijarla con `LET`.
fr: L'utilisation de cette commande est facultative; toute affectation de variable peut être écrite sous la forme `variable = expression`, sans la précéder de `LET`.
ja: このコマンドの使用はオプションです。変数の割り当ては、接頭辞`LET`を付けずに「変数=式」と書くことができます。

source: It is provided solely as a compatibility feature with other BASIC dialects. Its use in new programs is not recommended, as it consumes additional memory and compute resources without providing any benefit.
de: Es wird ausschließlich als Kompatibilitätsmerkmal mit anderen BASIC-Diamelekten bereitgestellt. Seine Verwendung in neuen Programmen wird nicht empfohlen, da es zusätzliche Speicher und Rechenressourcen verbraucht, ohne einen Vorteil zu bieten.
es: Se proporciona únicamente como una característica de compatibilidad con otros dialectos BÁSICOS. No se recomienda su uso en nuevos programas, ya que consume memoria adicional y recursos de cómputo sin proporcionar ningún beneficio.
fr: Il est fourni uniquement comme une fonctionnalité de compatibilité avec d'autres dialectes BASIC. Son utilisation dans de nouveaux programmes n'est pas recommandée, car elle consomme de la mémoire supplémentaire et des ressources de calcul sans apporter aucun avantage.
ja: これは、他のBASIC方言との互換性機能としてのみ提供されます。新しいプログラムでの使用はお勧めしません。何のメリットももたらさずに、追加のメモリとコンピューティングリソースを消費するからです。

source: Remove an element from the beginning of a numeric list.
de: Entfernt ein Element vom Anfang einer numerischen Liste.
es: Elimina un elemento del principio de una lista numérica.
fr: Supprime un élément du début d'une liste numérique.
ja: 数値リストの先頭から要素を削除します。

source: reference to a numeric list
de: Verweis auf eine numerische Liste
es: referencia a una lista numérica
fr: référence à une liste numérique
ja: 数値リストへの参照

source: Value of the element removed.
de: Wert des entfernten Elements.
es: Valor del elemento eliminado.
fr: Valeur de l'élément supprimé.
ja: 削除された要素の値。

source: An error is generated if `~list` is empty.
de: Ein Fehler wird generiert, wenn `~list` leer ist.
es: Se genera un error si `~list` está vacío.
fr: Une erreur est générée si `~list` est vide.
ja: `~list`が空の場合、エラーが生成されます。

source: Remove an element from the end of a numeric list.
de: Entfernt ein Element vom Ende einer numerischen Liste.
es: Elimina un elemento del final de una lista numérica.
fr: Supprime un élément de la fin d'une liste numérique.
ja: 数値リストの最後から要素を削除します。

source: Remove an element from the beginning of a string list.
de: Entfernt ein Element vom Anfang einer Stringliste.
es: Elimina un elemento del principio de una lista de cadenas.
fr: Supprime un élément du début d'une liste de chaînes.
ja: 文字列リストの先頭から要素を削除します。

source: reference to a string list
de: Verweis auf eine Stringliste
es: referencia a una lista de cadenas
fr: référence à une liste de chaînes
ja: 文字列リストへの参照

source: An error is generated if `~list$` is empty.
de: Ein Fehler wird generiert, wenn `~list$` leer ist.
es: Se genera un error si `~list$` está vacío.
fr: Une erreur est générée si `~list$` est vide.
ja: `list$`が空の場合、エラーが生成されます。

source: Remove an element from the end of a string list.
de: Entfernt ein Element vom Ende einer Stringliste.
es: Elimina un elemento del final de una lista de cadenas.
fr: Supprime un élément de la fin d'une liste de chaînes.
ja: 文字列リストの最後から要素を削除します。

source: Sets the text screen window.
de: Setzt das Textfenster.
es: Establece la ventana de la pantalla de texto.
fr: Définit la fenêtre de l'écran de texte.
ja: テキスト画面ウィンドウを設定します。

source: `WINDOW OFF` resets the text window to cover the entire screen.
de: `WINDOW OFF` setzt das Textfenster zurück, um den gesamten Bildschirm abzudecken.
es: `WINDOW OFF` restablece la ventana de texto para cubrir toda la pantalla.
fr: `WINDOW OFF` réinitialise la fenêtre de texte pour couvrir tout l'écran.
ja: `WINDOW OFF`は、画面全体をカバーするようにテキストウィンドウをリセットします。

source: left boundary of the text window, in characters [`0` to `CSIZE(0)-1`]
de: linke Grenze des Textfensters in Zeichen [`0` bis `CSIZE(0)-1`]
es: límite izquierdo de la ventana de texto, en caracteres [`0` a `CSIZE(0)-1`]
fr: limite gauche de la fenêtre de texte, en caractères [`0` à `CSIZE(0)-1`]
ja: テキストウィンドウの左境界、[`0"から `csize（0)-1`まで）

source: top boundary of the text window, in characters [`0` to `CSIZE(1)-1`]
de: obere Grenze des Textfensters in Zeichen [`0` bis `CSIZE(1)-1`]
es: límite superior de la ventana de texto, en caracteres [`0` a `CSIZE(1)-1`]
fr: limite supérieure de la fenêtre de texte, en caractères [`0` à `CSIZE(1) -1`]
ja: テキストウィンドウのトップ境界, 文字で [0` から `CSIZE(1)-1`]

source: width of the text window, in characters [`1` to `CSIZE(0)-x`]
de: Breite des Textfensters in Zeichen [`1` bis `CSIZE(0)-x`]
es: ancho de la ventana de texto, en caracteres [`1` a `CSIZE(0)-x`]
fr: largeur de la fenêtre de texte, en caractères [`1` à `CSIZE(0)-x`]
ja: テキストウィンドウの幅、文字[`1"から `csize（0)-x`]

source: height of the text window, in characters [`1` to `CSIZE(1)-y`]
de: Höhe des Textfensters in Zeichen [`1` bis `CSIZE(1)-y`]
es: altura de la ventana de texto, en caracteres [`1` a `CSIZE(1)-y`]
fr: hauteur de la fenêtre de texte, en caractères [`1` à `CSIZE(1)-y`]
ja: テキストウィンドウの高さ、文字で [1` から `CSIZE(1)-y`]

source: Sets the current text font.
de: Legt die aktuelle Textschrift fest.
es: Establece la fuente de texto actual.
fr: Définit la police du texte actuelle.
ja: 現在のテキストフォントを設定します。

source: font number [`0` to `{NUM_FONTS_m1}`]
de: Schriftnummer [`0` bis `{NUM_FONTS_m1} `]
es: número de fuente [`0` a `{NUM_FONTS_m1} `]
fr: numéro de police [`0` à `{NUM_FONTS_m1}`]

source: The following fonts are available:
de: Folgende Schriftarten stehen zur Verfügung:
es: Están disponibles las siguientes fuentes:
fr: Les polices suivantes sont disponibles:

source: ATI console font, 6x8 pixels (default)
de: ATI-Konsolenschrift, 6x8 Pixel (Standard)
es: Fuente de consola ATI, 6x8 píxeles (predeterminado)
fr: Police de la console ATI, 6x8 pixels (par défaut)

source: CPC font, 8x8 pixels
de: CPC-Schriftart, 8 x 8 Pixel
es: Fuente CPC, 8 x 8 píxeles
fr: Police CPC, 8 x 8 pixels
ja: CPCフォント、8x8ピクセル

source: PETSCII font, 8x8 pixels
de: PETSCII-Schriftart, 8 x 8 Pixel
es: Fuente PETSCII, 8x8 píxeles
fr: Police PETSCII, 8x8 pixels
ja: PETSCIIフォント、8x8ピクセル

source: Japanese font, 6x8 pixels
de: Japanische Schrift, 6x8 Pixel
es: Fuente japonesa, 6x8 píxeles
fr: Police japonaise, 6x8 pixels

source: The font set at power-on can be set using the `CONFIG` command.
de: Die beim Einschalten eingestellte Schriftart kann mit dem Befehl `CONFIG` eingestellt werden.
es: La fuente configurada al encender se puede configurar usando el comando `CONFIG`.
fr: La police définie à la mise sous tension peut être définie à l'aide de la commande `CONFIG`.

source: Change the screen resolution.
de: Ändern Sie die Bildschirmauflösung.
es: Cambia la resolución de la pantalla.
fr: Modifiez la résolution de l'écran.
ja: 画面の解像度を変更します。

source: The following modes are available:
de: Folgende Modi stehen zur Verfügung:
es: Están disponibles los siguientes modos:
fr: Les modes suivants sont disponibles:
ja: 次のモードを使用できます。

source: Resolution
de: Auflösung
es: Resolución
fr: Résolution
ja: 解決

source: Comment
de: Kommentar
es: Comentario
fr: Commenter
ja: コメント

source: Maximum usable resolution in NTSC mode.
de: Maximal verwendbare Auflösung im NTSC-Modus.
es: Resolución máxima utilizable en modo NTSC.
fr: Résolution maximale utilisable en mode NTSC.
ja: NTSC モードの最大の使用可能な解像度。
