Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: Returns from a subroutine called by `GOSUB` or from a procedure defined by `PROC` and called with `CALL` or `FN`.
de: Kehrt von einer Unterroutine zurück, die von `GOSUB` aufgerufen wird, oder von einer Prozedur, die mit `PROC` definiert und mit `CALL` oder `FN` aufgerufen wurde.
es: Retorna de una subrutina llamada por `GOSUB` o de un procedimiento definido por `PROC` y llamado con `CALL` o `FN`.
fr: Retourne d'un sous-programme appelé par `GOSUB` ou d'une procédure définie par` PROC` et appelée avec `CALL` ou` FN`.
ja: `GOSUB`によって呼び出されたサブルーチン、または`PROC`によって定義され、 `CALL`または`FN`で呼び出されたプロシージャから戻ります。

source: If `condition` is prefixed by `WHILE`, the loop will repeat if `condition` is "true" (non-zero). If `condition` is prefixed by `UNTIL`, the loop will continue if `condition` is "false" (zero). In any other case, the loop will be exited and execution will continue with the instruction following the `LOOP` command.
de: Wenn `condition` das Präfix `WHILE` vorangestellt ist, wird die Schleife wiederholt, wenn `condition` "wahr" ist (nicht Null). Wenn `condition` das Präfix `UNTIL` vorangestellt ist, wird die Schleife fortgesetzt, wenn `condition` "falsch" (Null) ist. In jedem anderen Fall wird die Schleife verlassen und die Ausführung mit der Anweisung fortgesetzt, die dem Befehl `LOOP` folgt.
es: Si "condición" tiene el prefijo "MIENTRAS", el ciclo se repetirá si "condición" es "verdadera" (distinta de cero). Si "condición" tiene el prefijo "UNTIL", el ciclo continuará si "condición" es "falsa" (cero). En cualquier otro caso, se saldrá del bucle y la ejecución continuará con la instrucción que sigue al comando `LOOP`.
fr: Si `condition` est préfixé par` WHILE`, la boucle se répétera si `condition` est" vraie "(différente de zéro). Si `condition` est préfixé par` UNTIL`, la boucle continuera si `condition` est" fausse "(zéro). Dans tous les autres cas, la boucle sera quittée et l'exécution se poursuivra avec l'instruction suivant la commande `LOOP`.
ja: `condition`の前に`WHILE`が付いている場合、 `condition`が" true "（ゼロ以外）の場合、ループが繰り返されます。`condition`の前に`UNTIL`が付いている場合、 `condition`が" false "（ゼロ）の場合、ループは続行されます。それ以外の場合、ループは終了し、 `LOOP`コマンドに続く命令で実行が続行されます。

source: amount the counter is changed each time through the loop [default: `1`]
de: Betrag, um den der Zähler bei jedem Schleifendurchlauf geändert wird [Standard: `1`]
es: la cantidad del contador se cambia cada vez a través del bucle [default: `1`]
fr: quantité de changement du compteur à chaque fois dans la boucle [par défaut: `1`]
ja: ループを通過するたびにカウンターが変更される量[デフォルト：`1`]

source: Both `end` and `increment` are only evaluated once, at the start of the loop. Any changes to these expressions afterwards will not have any effect on it.
de: Sowohl `end` als auch `increment` werden zu Beginn der Schleife nur einmal ausgewertet. Nachträgliche Änderungen an diesen Ausdrücken haben keine Auswirkungen.
es: Tanto `end` como` increment` solo se evalúan una vez, al comienzo del ciclo. Cualquier cambio posterior a estas expresiones no tendrá ningún efecto sobre él.
fr: `End` et `increment` ne sont évalués qu'une seule fois, au début de la boucle. Toute modification de ces expressions par la suite n'aura aucun effet sur celle-ci.
ja: `end`と`increment`はどちらも、ループの開始時に1回だけ評価されます。その後、これらの式を変更しても、影響はありません。

source: If the numeric `tile` argument is given, a single tile will be set. If a string of tiles (`tile$`) is passed, a tile will be set for each of the elements of the string, starting from the specified tile coordinates and proceeding horizontally.
de: Wenn das numerische Argument `tile` angegeben wird, wird eine einzelne Kachel gesetzt. Wenn eine Kachelstring (`tile$`) übergeben wird, wird für jedes Element des Strings eine Kachel festgelegt, beginnend mit den angegebenen Kachelkoordinaten und in horizontaler Richtung.
es: Si se da el argumento numérico `mosaico`, se establecerá un solo mosaico. Si se pasa una cadena de mosaicos (`tile$`), se establecerá un mosaico para cada uno de los elementos de la cadena, comenzando desde las coordenadas de mosaico especificadas y procediendo horizontalmente.
fr: Si l'argument numérique `tile` est donné, une seule tuile sera définie. Si une chaîne de tuiles (`tile$`) est passée, une tuile sera définie pour chacun des éléments de la chaîne, en commençant par les coordonnées de tuile spécifiées et en procédant horizontalement.
ja: 数値の `tile`引数を指定すると、単一のタイルが設定されます。タイルの文字列（ `tile $`）が渡されると、指定されたタイル座標から始まり、水平方向に進む、文字列の各要素にタイルが設定されます。

source: Tile numbers depend on the locations of graphics data in memory and do not usually represent printable characters, often making it difficult to handle them in program text. By remapping a printable character to a tile as represented by the graphics data, it is possible to use that human-readable character in your program, making it easier to write and to understand.
de: Kachelnummern hängen von der Position der Grafikdaten im Speicher ab und stellen normalerweise keine druckbaren Zeichen dar, was es häufig schwierig macht, sie im Programmtext zu verwenden. Durch Zuordnen eines druckbaren Zeichens zu einer Kachel, wie sie durch die Grafikdaten dargestellt wird, ist es möglich, dieses menschenlesbare Zeichen in Ihrem Programm zu verwenden, um das Schreiben und Verstehen zu erleichtern.
es: Los números de mosaico dependen de la ubicación de los datos gráficos en la memoria y, por lo general, no representan caracteres imprimibles, lo que a menudo dificulta su manejo en el texto del programa. Al reasignar un carácter imprimible a un mosaico representado por los datos gráficos, es posible utilizar ese carácter legible por humanos en su programa, lo que facilita la escritura y la comprensión.
fr: Les numéros de tuiles dépendent de l'emplacement des données graphiques dans la mémoire et ne représentent généralement pas des caractères imprimables, ce qui rend souvent difficile leur manipulation dans le texte du programme. En remappant un caractère imprimable sur une tuile représentée par les données graphiques, il est possible d'utiliser ce caractère lisible par l'homme dans votre programme, ce qui facilite l'écriture et la compréhension.
ja: タイル番号は、メモリ内のグラフィックデータの場所に依存し、通常は印刷可能な文字を表さないため、プログラムテキストでの処理が困難になることがよくあります。グラフィックデータで表されるように、印刷可能な文字をタイルに再マッピングすることにより、プログラムでその人間が読める文字を使用することが可能になり、記述と理解が容易になります。

source: tile number to remap [`0` to `255`]
de: Kachelnummer zum Neuzuordnen [`0` zu` 255`]
es: número de mosaico para reasignar [`0` a `255`]
fr: numéro de tuile à remapper [`0` à `255`]
ja: 再マップするタイル番号[`0`から`255`]

source: tile number to map to [`0` to `255`]
de: Kachelnummer, auf die es abgebildet werden soll [`0` bis` 255`]
es: número de mosaico para asignar a [`0` a `255`]
fr: numéro de tuile à mapper sur [`0` à `255`]
ja: マップするタイル番号 [`0` から `255`] を指定します。

source: number of frames to be skipped [`0` (default) to `60`]
de: Anzahl der zu überspringenden Frames [`0` (Standard) auf` 60`]
es: número de fotogramas que se omitirán [`0` (predeterminado) a `60`]
fr: nombre d'images à sauter [`0` (par défaut) à `60`]
ja: スキップするフレーム数[`0`（デフォルト）から`60`]

source: It is not possible to mitigate flickering caused by overloading the graphics engine using `FRAMESKIP` because each frame that is actually rendered must be so within a single TV frame.
de: Es ist nicht möglich, mit `FRAMESKIP` Flackern zu verringern, das durch Überlastung der Grafik-Engine verursacht wird, da jedes tatsächlich gerenderte Bild innerhalb eines einzelnen TV-Rahmens fertig sein muss.
es: No es posible mitigar el parpadeo causado por la sobrecarga del motor gráfico usando `FRAMESKIP` porque cada fotograma que se renderiza debe estar dentro de un solo fotograma de TV.
fr: Il n'est pas possible d'atténuer le scintillement causé par la surcharge du moteur graphique en utilisant `FRAMESKIP` car chaque image qui est réellement rendue doit l'être dans une seule image TV.
ja: 実際にレンダリングされる各フレームは単一のTVフレーム内にある必要があるため、 `FRAMESKIP`を使用してグラフィックエンジンの過負荷によって引き起こされるちらつきを軽減することはできません。

source: `1` (aka `<<LEFT>>`)
de: `1` (alias` <<LEFT>> `)
ja: `1`（別名`<<LEFT>>`）

source: The tile is left of the sprite.
de: Die Kachel liegt links vom Sprite.
es: El mosaico queda a la izquierda del sprite.
fr: La tuile est à gauche du sprite.
ja: タイルはスプライトの左側にあります。

source: `2` (aka `<<DOWN>>`)
de: `2` (alias `<<DOWN>>`)

source: `4` (aka `<<RIGHT>>`)
de: `4` (alias `<<RIGHT>>`)
ja: `4`（別名 `<<RIGHT>>`）

source: Note that it is possible that none of these bits are set even if a collision has taken place (i.e., the return value is `64`) if the sprite's size is larger than the tile size of the given background layer, and the sprite covers the tile completely.
de: Beachten Sie, dass es möglich ist, dass keines dieser Bits gesetzt wird, selbst wenn eine Kollision stattgefunden hat (d.h. der Rückgabewert ist `64`), wenn die Größe des Sprites größer als die Kachelgröße der angegebenen Hintergrundebene ist und das Sprite die Kachel vollständig überdeckt.
es: Tenga en cuenta que es posible que ninguno de estos bits se establezca incluso si se ha producido una colisión (es decir, el valor de retorno es `64`) si el tamaño del sprite es mayor que el tamaño del mosaico de la capa de fondo dada, y el sprite cubre el azulejo completamente.
fr: Notez qu'il est possible qu'aucun de ces bits ne soit défini même si une collision a eu lieu (c'est-à-dire, la valeur de retour est `64`) si la taille du sprite est plus grande que la taille des tuiles du calque d'arrière-plan donné et que le sprite couvre complètement le carrelage.
ja: スプライトのサイズが与えられた背景レイヤーのタイルサイズより大きく、スプライトがタイルを完全に覆っている場合、衝突が起こったとしても、これらのビットが何もセットされない（すなわち、戻り値が `64` ）可能性があることに注意してください。

source: It is possible that none of these bits are set even if a collision has taken place (i.e., the return value is `64`) if sprite 1 is larger than sprite 2 and covers it completely.
de: Es ist möglich, dass keines dieser Bits gesetzt wird, selbst wenn eine Kollision stattgefunden hat (d.h. der Rückgabewert ist `64`), wenn Sprite 1 größer als Sprite 2 ist und dieses vollständig überdeckt.
es: Es posible que ninguno de estos bits se establezca incluso si se ha producido una colisión (es decir, el valor de retorno es 64) si el sprite 1 es más grande que el sprite 2 y lo cubre por completo.
fr: Il est possible qu'aucun de ces bits ne soit positionné même si une collision a eu lieu (c'est-à-dire que la valeur de retour est `64`) si le sprite 1 est plus grand que le sprite 2 et le couvre complètement.
ja: スプライト1がスプライト2よりも大きく、完全にカバーしている場合、衝突が発生した場合でも（つまり、戻り値が`64`である場合）、これらのビットが設定されない可能性があります。

source: Does not return an intuitive direction indication if sprite 2 is larger than sprite 1 and covers it completely. (It will indicate that sprite 2 is up/left of sprite 1.)
de: Gibt keine intuitive Richtungsangabe zurück, wenn Sprite 2 größer als Sprite 1 ist und dieses vollständig abdeckt. (Es wird angezeigt, dass Sprite 2 links oben von Sprite 1 liegt.)
es: No devuelve una indicación de dirección intuitiva si el sprite 2 es más grande que el sprite 1 y lo cubre por completo. (Indicará que el sprite 2 está arriba / a la izquierda del sprite 1.)
fr: Ne renvoie pas d'indication de direction intuitive si le sprite 2 est plus grand que le sprite 1 et le recouvre complètement. (Cela indiquera que le sprite 2 est en haut / à gauche du sprite 1.)
ja: スプライト2がスプライト1より大きく、完全にスプライト1を覆っている場合、直感的な方向指示を返さない。(スプライト2がスプライト1の上/左にあることを示します）。

source: The options will be reset to their defaults on system startup unless they have been saved using <<SAVE CONFIG>>. Changing power-on default options does not affect the system until the options are saved and the system is restarted.
de: Die Optionen werden auf Ihre Standardwerte zurückgesetzt, wenn sie nicht mit <<SAVE CONFIG>> gespeichert wurden. Einschalt-Standardoptionen haben keinen Effekt auf das System, bis sie gespeichert werden und das System neu gestartet wird.
es: *not found*
ja: <<SAVE CONFIG>>を使用して保存されていない限り、オプションはシステムの起動時にデフォルトにリセットされます。パワーオンデフォルトオプションの変更は、オプションが保存され、システムが再起動されるまでシステムには影響しません。

source: configuration option to be set [`0` to `8`]
de: zu setzende Konfigurationsoption [`0` bis` 8`]
es: opción de configuración a establecer [`0` a `8`]
fr: option de configuration à définir [`0` à `8`]
ja: 設定する構成オプション[`0`から`8`]

source: * There is no way to override a saved configuration, which may make it difficult or even impossible to fix an system configured to an unusable state.
de: * Es gibt keine Möglichkeit, eine gespeicherte Konfiguration zu überschreiben, was es schwierig oder sogar unmöglich machen kann, ein in einen unbrauchbaren Zustand versetztes System wieder gangbar zu machen.
es: * No hay forma de anular una configuración guardada, lo que puede dificultar o incluso hacer imposible reparar un sistema configurado en un estado inutilizable.
fr: * Il n'y a aucun moyen de remplacer une configuration enregistrée, ce qui peut rendre difficile, voire impossible, la réparation d'un système configuré dans un état inutilisable.
ja: * 保存された設定を上書きする方法がないため、使用不可能な状態に設定されたシステムを修正することが困難または不可能になる場合があります。

source: The configuration will be saved as a file under the name `/flash/.config`.
de: Die Konfiguration wird als Datei unter dem Namen `/flash/.config` gespeichert.
es: La configuración se guardará como un archivo con el nombre `/ flash / .config`.
fr: La configuration sera enregistrée sous forme de fichier sous le nom `/ flash / .config`.
ja: 設定は `/ flash / .config`という名前でファイルとして保存されます。

source: Data read from file.
de: Aus der Datei gelesene Daten.
es: Datos leídos del archivo.
fr: Données lues à partir du fichier.
ja: ファイルから読み取られたデータ。

source: Redirect screen I/O to a file.
de: Bildschirm-I/O in eine Datei umleiten.
es: Redirigir la E / S de la pantalla a un archivo.
fr: Redirigez les E / S d'écran vers un fichier.
ja: 画面I / Oをファイルにリダイレクトします。

source: Redirection can be disabled by replacing the file number with `OFF`. `CMD OFF` turns off both input and output redirection.
de: Die Umleitung kann deaktiviert werden, indem die Dateinummer durch `OFF` ersetzt wird. `CMD OFF` schaltet sowohl die Eingangs- als auch die Ausgangsumleitung aus.
es: La redirección se puede desactivar reemplazando el número de archivo con "OFF". `CMD OFF` desactiva la redirección de entrada y salida.
fr: La redirection peut être désactivée en remplaçant le numéro de fichier par `OFF`. `CMD OFF` désactive la redirection d'entrée et de sortie.
ja: ファイル番号を `OFF`に置き換えることでリダイレクトを無効にすることができます。`CMD OFF`は、入力リダイレクトと出力リダイレクトの両方をオフにします。

source: number of an open file to redirect to [`0` to `{MAX_USER_FILES_m1}`]
de: Nummer einer geöffneten Datei, auf die umgeleitet werden soll [`0` bis `{MAX_USER_FILES_m1}]
es: número de un archivo abierto para redirigir a [`0` a `{MAX_USER_FILES_m1} `]
fr: numéro d'un fichier ouvert à rediriger vers [`0` vers` {MAX_USER_FILES_m1} `]

source: copy of the file to be created
de: zu erstellende Kopie der Datei
es: copia del archivo a crear
fr: copie du fichier à créer
ja: 作成するファイルのコピー

source: Writes the contents of a file to the screen. When a screen's worth of text has been printed, it pauses and waits for a key press.
de: Schreibt den Inhalt einer Datei auf den Bildschirm. Wenn der ganze Bildschirm mit Text beschrieben wurde, wird angehalten und auf einen Tastendruck gewartet.
es: Escribe el contenido de un archivo en la pantalla. Cuando se imprime el texto de una pantalla, se detiene y espera a que se presione una tecla.
fr: Écrit le contenu d'un fichier à l'écran. Lorsqu'une valeur de texte d'un écran a été imprimée, elle se met en pause et attend une pression sur une touche.
ja: ファイルの内容を画面に書き込みます。画面に相当するテキストが印刷されると、一時停止してキーが押されるのを待ちます。

source: Bit field representing the button states of the requested controller(s). The value is the sum of any of the following bit values:
de: Bitfeld, das die Buttonzustände der angeforderten Controller darstellt. Der Wert ist die Summe eines oder mehrerer der folgenden Bitwerte:
es: Campo de bits que representa los estados de los botones de los controladores solicitados. El valor es la suma de cualquiera de los siguientes valores de bits:
fr: Champ de bits représentant les états des boutons du (des) contrôleur (s) demandé (s). La valeur est la somme de l'une des valeurs de bit suivantes:
ja: 要求されたコントローラーのボタンの状態を表すビットフィールド。この値は、次のビット値のいずれかの合計です。

source: kbd:[Down] key
de: kbd:[Runter]
es: kbd:tecla [Abajo]
fr: kbd:touche [Bas]

source: kbd:[Right] key
de: kbd:[Rechts]
es: kbd:tecla [Derecha]
fr: kbd:touche [Droite]

source: kbd:[Up] key
de: kbd:[Hoch]
es: kbd:tecla [Arriba]
fr: kbd:touche [Haut]
ja: kbd:[Up] キー

source: kbd:[&#x25cb;] button
de: kbd:[○]-Button
es: kbd:botón [○]
fr: kbd:bouton [○]
ja: kbd:[○]ボタン

source: Key
de: Taste

source: Key code
de: Tastencode
es: Código clave
fr: Code clé
ja: キーコード

source: kbd:[Left Alt]
de: kbd:[Links Alt]
es: kbd:[Alt Izquierda]
fr: kbd:[Alt gauche]
ja: kbd:[左Alt]

source: kbd:[Left Shift]
de: kbd:[Linksverschiebung]
fr: kbd:[Maj gauche]

source: kbd:[Left Ctrl]
de: kbd:[Linke Strg]
es: kbd:[Ctrl izquierdo]
fr: kbd:[Ctrl gauche]
ja: kbd:[左Ctrl]

source: kbd:[Right Shift]
de: kbd:[Rechtsverschiebung]
fr: kbd:[Maj droit]
ja: kbd:[右シフト]

source: kbd:[Right Alt]
de: kbd:[Rechts Alt]
es: kbd:[Alt derecha]
fr: kbd:[Alt droite]
ja: kbd:[右Alt]

source: kbd:[Right Ctrl]
de: kbd:[Rechte Strg]
es: kbd:[Ctrl derecho]
fr: kbd:[Ctrl droite]
ja: kbd:[右Ctrl]

source: kbd:[Left GUI]
de: kbd:[Linke GUI]
es: kbd:[GUI izquierda]
fr: kbd:[GUI gauche]
ja: kbd:[左GUI]

source: kbd:[Right GUI]
de: kbd:[Rechte GUI]
es: kbd:[GUI derecha]
fr: kbd:[GUI droite]
ja: kbd:[右GUI]

source: kbd:[Scroll Lock]
de: kbd:[Bildlaufsperre]
es: kbd:[Bloqueo de desplazamiento]
ja: kbd:[スクロールロック]

source: kbd:[Caps Lock]
de: kbd:[Feststelltaste]
es: kbd:[Bloq Mayús]
fr: kbd:[Verrouillage majuscule]
ja: kbd:[キャップロック]

source: kbd:[Print Screen]
de: kbd:[Bildschirm drucken]
es: kbd:[Imprimir pantalla]
fr: kbd:[Impr écran]

source: kbd:[Page Up]
de: kbd:[Bild auf]
ja: kbd:[ページアップ]

source: kbd:[Page Down]
de: kbd:[Bild ab]
es: kbd:[Página abajo]
ja: kbd:[ページダウン]

source: kbd:[Right Arrow]
de: kbd:[rechter Pfeil]
es: kbd:[flecha derecha]
fr: kbd:[Flèche droite]
ja: kbd:[右矢印]

source: kbd:[Delete]
de: kbd:[Löschen]
es: kbd:[Eliminar]
fr: kbd:[Supprimer]

source: kbd:[Space]
de: kbd:[Leerzeichen]
es: kbd:[Espacio]
fr: kbd:[Espace]
ja: kbd:[スペース]

source: kbd:[&#x5c;]
de: kbd:[\\]
es: kbd:[\\]
fr: kbd:[\\]

source: Keypad kbd:[=]
de: Tastatur kbd:[=]
fr: Clavier kbd:[=]
ja: キーパッドkbd:[=]

source: Keypad kbd:[Enter]
de: Tastatur kbd:[Enter]
ja: キーパッドkbd:[Enter]

source: Keypad kbd:[0]
de: Tastatur kbd:[0]
ja: キーパッドkbd:[0]

source: Keypad kbd:[1]
de: Tastatur kbd:[1]
ja: キーパッドkbd:[1]

source: Keypad kbd:[2]
de: Tastatur kbd:[2]
ja: キーパッドkbd:[2]

source: Keypad kbd:[3]
de: Tastatur kbd:[3]
ja: キーパッドkbd:[3]

source: Keypad kbd:[4]
de: Tastatur kbd:[4]
es: Kbd Keypad:[4]
ja: キーパッドkbd:[4]

source: Keypad kbd:[5]
de: Tastatur kbd:[5]
ja: キーパッドkbd:[5]

source: Keypad kbd:[6]
de: Tastatur kbd:[6]
ja: キーパッドkbd:[6]

source: Keypad kbd:[7]
de: Tastatur kbd:[7]
ja: キーパッドkbd:[7]

source: Keypad kbd:[8]
de: Tastatur kbd:[8]
ja: キーパッドkbd:[8]

source: Keypad kbd:[9]
de: Tastatur kbd:[9]
ja: キーパッドkbd:[9]

source: Keypad kbd:[*]
de: Tastatur kbd:[*]
ja: キーパッドkbd:[*]

source: Keypad kbd:[+]
de: Tastatur kbd:[+]
es: Kbd Keypad:[+]
ja: キーパッドkbd:[+]

source: Keypad kbd:[,]
de: Tastatur kbd:[,]
ja: キーパッドkbd:[、]

source: Keypad kbd:[-]
de: Tastatur kbd:[-]
ja: キーパッドkbd:[-]

source: Keypad kbd:[.]
de: Tastatur kbd:[.]
ja: キーパッドkbd:[。]

source: Keypad kbd:[/]
de: Tastatur kbd:[/]
ja: キーパッドkbd:[/]

source: kbd:[Power]
de: kbd:[Macht]
ja: kbd:[パワー]

source: * [[unclear]] Some key definitions are not well-defined. The kbd:[Pipe2] key is documented as belonging to a US layout keyboard, but US layouts do not have a separate kbd:[
de: * [[unklar]] Einige Tastendefinitionen sind nicht genau definiert. Die Taste kbd:[Pipe2] is als zu einer US-Layout-Tastatur gehörig definiert, aber US-Layouts haben keine separate kbd:[
es: * [[poco claro]] Algunas definiciones clave no están bien definidas. La clave kbd:[Pipe2] está documentada como perteneciente a un teclado de diseño de EE. UU., pero los diseños de EE. UU. no tienen un kbd:[
fr: * [[pas clair]] Certaines définitions de touches ne sont pas bien définies. La touche kbd:[Pipe2] est documentée comme appartenant à un clavier à disposition américaine, mais les dispositions américaines n'ont pas de touche kbd:[

source: ] key.
de: ]-Taste.
es: ] clave.
fr: ] clé.
ja: ]キー。

source: * There is currently no keyboard event handling similar to <<ON PAD>> for game pad input.
de: Es gibt im Moment kein Tastatur-Eventhandling wie das für Gamepad-Eingabe mittles <<ON PAD>>.
fr: * Il n'y a actuellement aucun manipulation d'événements de clavier similaire à <<ON PAD>> pour l'entrée de pad de jeu.
ja: *ゲームパッド入力のための<<ON PAD>>に似たキーボードイベント処理は現在ありません。

source: * a single-character string for regular keys,
de: * eine Ein-Zeichen-String für normale Tasten,
es: * una cadena de un solo carácter para claves normales,
fr: * une chaîne à un seul caractère pour les clés régulières,
ja: *通常のキーの場合は1文字の文字列、

source: * a two-character string for extended keys.
de: * Eine zwei-Zeichen-String für erweiterte Tasten.
es: * una cadena de dos caracteres para claves extendidas.
fr: * une chaîne de deux caractères pour les clés étendues.
ja: *拡張キーの場合は2文字の文字列。

source: An "extended key" is a key that does not have a common ASCII representation, such as cursor or function keys.
de: Eine "erweiterte Taste" ist eine Taste ohne übliche ASCII-Darstellung, z.B. Cursor- oder Funktionstasten.
es: Una "tecla extendida" es una tecla que no tiene una representación ASCII común, como un cursor o teclas de función.
fr: Une "touche étendue" est une touche qui n'a pas de représentation ASCII commune, telle que le curseur ou les touches de fonction.
ja: 「拡張キー」とは、カーソルキーやファンクションキーなど、一般的なASCII表現を持たないキーです。

source: `INKEY$` is not consistent with the Engine BASIC convention of following functions with parentheses to distinguish them from constants and variables in order to remain compatible with other BASIC implementations.
de: `INKEY$` entspricht nicht der Engine BASIC-Konvention, dass auf Funktionen zur Unterscheidung von Konstanten und Variablen Klammern folgen, um mit anderen BASIC-Implementierungen kompatibel zu bleiben.

source: Value of the "right" direction for input devices.
de: Wert der Richtung "rechts" für Eingabegeräte.
es: Valor de la dirección "derecha" para dispositivos de entrada.
fr: Valeur de la direction `droite` pour les périphériques d'entrée.
ja: 入力装置の「右」方向の値。

source: Value of the "left" direction for input devices.
de: Wert der Richtung "links" für Eingabegeräte.
es: Valor de la dirección "izquierda" para dispositivos de entrada.
fr: Valeur de la direction `gauche` pour les périphériques d'entrée.
ja: 入力デバイスの「左」方向の値。

source: Key code [`0` to `65535`]
de: Tastencode [`0` bis` 65535`]
es: Código de clave [`0` a `65535`]
fr: Code clé [`0` à `65535`]
ja: キーコード[`0`から`65535`]

source: Sets the state of a general-purpose I/O pin.
de: Legt den Status eines Universal-I/O-Pins fest.
es: Establece el estado de un pin I/O de uso general.
fr: Définit l'état d'une broche d'E / S à usage général.
ja: 汎用I / Oピンの状態を設定します。

source: Sets the mode of a general-purpose I/O pin.
de: Legt den Modus eines Universal-I/O-Pins fest.
es: Establece el modo de un pin de E / S de uso general.
fr: Définit le mode d'une broche d'E / S à usage général.
ja: 汎用のI / Oピンのモードを設定します。

source: Also returns the status code of the outward transmission in `RET(0)`.
de: Gibt auch den Statuscode der ausgehenden Datenübertragung in `RET(0)` zurück.
es: También devuelve el código de estado de la transmisión saliente en `RET(0)`.
fr: Renvoie également le code d'état de la transmission sortante dans `RET(0)`.
ja: また、 `RET(0)`で送信のステータスコードを返します。
