Repository: CityAceE/basicengine-firmware
Catalog: po/helptext_*.po
Languages: de, es, fr, ja

source: byte to be written
de: zu schreibendes Byte
es: byte para ser escrito
fr: octet à écrire
ja: 書き込まれるバイト

source: Reads the state of a general-purpose I/O pin.
de: Liest den Status eines Universal-I/O-Pins.
es: Lee el estado de un pin de E / S de uso general.
fr: Lit l'état d'une broche d'E/S à usage général.
ja: 汎用I / Oピンの状態を読み取ります。

source: State of pin: `0` for low, `1` for high.
de: Zustand des Pins: `0` für low, `1` für high.
es: Estado del pin: `0` para bajo, `1` para alto.
fr: État de la broche: `0` pour bas, `1` pour haut.
ja: ピンの状態：ローの場合は`0`、ハイの場合は`1`。

source: Analog value read.
de: Ausgelesener Analogwert.
es: Lectura de valor analógico.
fr: Valeur analogique lue.
ja: 読み取ったアナログ値。

source: Byte of data read, or `-1` if there was no data available.
de: Gelesenes Byte, oder `-1`, wenn keine Daten verfügbar waren.
es: Byte de datos leídos, o "-1" si no había datos disponibles.
fr: Octet de données lues, ou `-1` s'il n'y a pas de données disponibles.
ja: データのバイト、またはデータがない場合は `-1`のバイト。

source: `ATN()` calculates the principal value of the arc tangent of `x`; that is the value whose tangent is `x`.
de: `ATN()` berechnet den Hauptwert des Arcustangens von `x`; das ist der Wert, dessen Tangens `x` ist.
es: `ATN()` calcula el valor principal del arco tangente de `x`; ese es el valor cuya tangente es `x`.
fr: `ATN()` calcule la valeur principale de l'arc tangente de `x`; c'est la valeur dont la tangente est `x`.
ja: `ATN()`は `x`のアークタンジェントの主値を計算します。これは、タンジェントが `x`である値です。

source: The principal value of the arc tangent of `x` in radians.
de: Der Hauptwert des Arcustangens von `x` im Bogenmaß.
es: El valor principal del arco tangente de `x` en radianes.
fr: La valeur principale de l'arc tangente de `x` en radians.
ja: `x`のアークタンジェントの主値（ラジアン）。

source: Returns the tangent of a specified angle.
de: Gibt den Tangens eines bestimmten Winkels zurück.
es: Devuelve la tangente de un ángulo especificado.
fr: Renvoie la tangente d'un angle spécifié.
ja: 指定された角度の接線を返します。

source: Division operator.
de: Divisionsoperator.
es: Operador de división.
fr: Opérateur de division.
ja: 除算演算子。

source: Difference of `a` and `b`.
de: Differenz von `a` und `b`.
es: Diferencia de "a" y "b".
fr: Différence de `a` et `b`.
ja: `a`と`b`の違い。

source: Inequality operator.
de: Ungleichheitsoperator.
es: Operador de desigualdad.
fr: Opérateur d'inégalité.
ja: 不等式演算子。

source: Less-than-or-equal operator.
de: Kleiner-gleich-Operator.
es: Operador menor o igual.
fr: Opérateur inférieur ou égal.

source: * MML syntax undocumented.
de: * MML-Syntax nicht dokumentiert.
es: * Sintaxis MML no documentada.
fr: * Syntaxe MML non documentée.
ja: * MML構文は文書化されていません。

source: Produces a sound using the "beeper" sound engine.
de: Erzeugt einen Sound mit der "Beeper"-Sound-Engine.
es: Prodce un sonido utilizando el motor de sonido "beeper".
fr: Produit un son à l'aide du moteur sonore "bip".
ja: 「ブザー」サウンドエンジンを使用してサウンドを生成します。

source: volume envelope [characters from `CHR$(0)` to `CHR$(15)`, default: constant volume]
de: Lautstärkenhüllkurve [Zeichen von `CHR$(0)` bis `CHR$(15)`, Standardeinstellung: Konstante Lautstärke]
es: envolvente de volumen [caracteres de `CHR$(0)` a `CHR$(15)`, predeterminado: volumen constante]
fr: enveloppe de volume [caractères de `CHR$(0)` à `CHR$(15)`, par défaut : volume constant]
ja: ボリュームエンベロープ[`chr$(0)"から `chr$(15)`、デフォルト：定数ボリューム]

source: The maximum value for `period` depends on the flavor of Engine BASIC; it's 320 for the gaming build, and 160 for the network build.
de: Der Maximalwert für `period` hängt von der Geschmacksrichtung von Engine BASIC ab. Er ist 320 für den Gaming-Build und 160 für den Netzwerk-Build.
es: El valor máximo de "período" depende del tipo de motor BASIC; es 320 para la construcción de juegos y 160 para la construcción de red.
fr: La valeur maximale de `period` dépend de la saveur du Engine BASIC ; c'est 320 pour la version jeu et 160 pour la version réseau.
ja: `period`の最大値は、EngineBASICのフレーバーによって異なります。ゲームビルドの場合は320、ネットワークビルドの場合は160です。

source: If a relative path is specified, Engine BASIC will first attempt to load the sound font from `/sd`, then from `/flash`.
de: Wenn ein relativer Pfad angegeben wird, versucht Engine BASIC zuerst, die Soundschriftart von `/sd` und dann von `/flash` zu laden.
es: Si se especifica una ruta relativa, Engine BASIC primero intentará cargar la fuente de sonido desde `/ sd`, luego desde` / flash`.
fr: Si un chemin relatif est spécifié, Engine BASIC essaiera d'abord de charger la police sonore depuis `/ sd`, puis depuis` / flash`.
ja: 相対パスが指定されている場合、EngineBASICは最初に`/sd`から、次に`/flash`からサウンドフォントをロードしようとします。

source: No sanity checks are performed before setting the sound font.
de: Vor dem Einstellen des Soundfont werden keine Sanity-Checks durchgeführt.
es: No se realizan comprobaciones de cordura antes de configurar la fuente de sonido.
fr: Aucun contrôle de cohérence n'est effectué avant de définir la police sonore.
ja: サウンドフォントを設定する前に、健全性チェックは実行されません。

source: note pitch
de: Tonhöhe
es: tono de nota
fr: hauteur de note
ja: 音高

source: Pause for a specific amount of time.
de: Für eine bestimmte Zeit pausieren.
es: Pausa por una cantidad específica de tiempo.
fr: Faites une pause pendant un laps de temps spécifique.
ja: 特定の時間一時停止します。

source: `addr` must be mapped writable and must allow half-word-wise access. It must be 2-byte aligned.
de: `addr` muss schreibbar sein, einen halbwortweisen Zugriff ermöglichen und an einer 2-Byte-Grenze ausgerichtet sein.
es: `addr` debe tener capacidad de escritura y debe permitir el acceso de media palabra. Debe estar alineado con 2 bytes.
fr: `addr` doit être mappé en écriture et doit permettre un accès par demi-mot. Il doit être aligné sur 2 octets.
ja: `addr`は書き込み可能にマップされ、ハーフワード単位のアクセスを許可する必要があります。2バイトに揃える必要があります。

source: `addr` must be mapped writable and must allow half-word-wise access. It must be 4-byte aligned.
de: `addr` muss schreibbar sein, einen halbwortweisen Zugriff ermöglichen und an einer 4-Byte-Grenze ausgerichtet sein.
es: `addr` debe tener capacidad de escritura y debe permitir el acceso de media palabra. Debe estar alineado con 4 bytes.
fr: `addr` doit être mappé en écriture et doit permettre un accès par demi-mot. Il doit être aligné sur 4 octets.
ja: `addr`は書き込み可能にマップされ、ハーフワード単位のアクセスを許可する必要があります。4バイトに揃える必要があります。

source: a memory address mapped as executable
de: eine Speicheradresse, die als ausführbar gemappt ist
es: una dirección de memoria asignada como ejecutable
fr: une adresse mémoire mappée comme exécutable
ja: 実行可能としてマップされたメモリアドレス

source: flash page to boot from [`0` to `255`]
de: Flash-Seite zum Booten [`0` bis` 255`]
es: página flash para arrancar desde [`0` a `255`]
fr: page flash pour démarrer de [`0` à `255`]
ja: フラッシュページから起動する [`0`から`255`]

source: Mode
de: Modus
es: Modo
ja: モード

source: * Apart from changing the mode, `SCREEN` clears the screen, resets the font and color space (palette) to their defaults, and disables sprites and tiled backgrounds.
de: * Abgesehen von der Änderung des Modus löscht `SCREEN` den Bildschirm, setzt die Schriftart und den Farbraum (Palette) auf die Standardeinstellungen zurück und deaktiviert Sprites und gekachelte Hintergründe.
es: * Además de cambiar el modo, `SCREEN` borra la pantalla, restablece la fuente y el espacio de color (paleta) a sus valores predeterminados y desactiva los sprites y los fondos en mosaico.
fr: * Outre le changement de mode, `SCREEN` efface l'écran, réinitialise la police et l'espace colorimétrique (palette) à leurs valeurs par défaut, et désactive les sprites et les arrière-plans en mosaïque.
ja: *モードの変更とは別に、 `SCREEN`は画面をクリアし、フォントと色空間（パレット）をデフォルトにリセットし、スプライトとタイル状の背景を無効にします。

source: Converts RGB value to hardware color value.
de: Konvertiert einen RGB-Wert in einen Hardware-Farbwert.
es: Convierte el valor RGB en valor de color de hardware.
fr: Convertit la valeur RVB en valeur de couleur matérielle.
ja: RGB値をハードウェアカラー値に変換します。

source: All Engine BASIC commands that require a color value expect that value to be in the video controller's format, which depends on the <<PALETTE>> setting.
de: Alle Engine-BASIC-Befehle, die einen Farbwert erfordern, erwarten, dass der Wert im Format des Video-Controllers liegt, der von der <<PALETTE>-Einstellung abhängt.
es: Todos los comandos de Engine BASIC que requieren un valor de color esperan que el valor esté en el formato del controlador de vídeo, que depende del ajuste de <<PALETTE>>.
fr: Toutes les commandes de Engine BASIC nécessitant une valeur de couleur s'attendent à ce que la valeur soit au format du contrôleur vidéo, qui dépend du paramètre <<PALETTE>>.
ja: カラー値を必要とするすべてのEngine Basicコマンドは、その値がビデオコントローラのフォーマットにあることを期待しています。これは<<PALETTE>>設定によって異なります。

source: Component values that are out of range will be silently clamped.
de: Komponentenwerte, die außerhalb des Bereichs liegen, werden lautlos geklemmt.
ja: 範囲外のコンポーネント値は、サイレントにクランプされます。

source: Scroll a portion screen contents in the given direction.
de: Scrollt den Inhalt eines Teilbildschirms in die angegebene Richtung.
es: Desplaza el contenido de una parte de la pantalla en la dirección dada.
fr: Faites défiler une partie du contenu de l'écran dans la direction donnée.
ja: 一部の画面コンテンツを所定の方向にスクロールします。

source: right
de: rechts
es: derecho
fr: droite
ja: 正しい

source: * `11`: Language + The following languages are supported for system messages: + `0` (US English, default), `1` (German), `2` (French), `3` (Spanish), `4` (Japanese).
de: * `11`: Sprache + Folgende Sprachen werden für Systemmeldungen unterstützt: + `0` (US-Englisch, Standard), `1` (Deutsch), `2` (Französisch), `3` (Spanisch), `4` (Japanisch).
es: * `11`: Idioma + Se admiten los siguientes idiomas para los mensajes del sistema: + `0` (inglés estadounidense, por defecto), `1` (alemán), `2` (francés), `3` (español), `4` (japonés).
fr: * `11` : langue + Les langues suivantes sont prises en charge pour les messages système : + `0` (anglais américain, par défaut), `1` (allemand), `2` (français), `3` (espagnol), `4 ` (japonais).
ja: * `11`：言語 + システムメッセージでは次の言語がサポートされています： + `0`（米国英語、デフォルト）、`1`（ドイツ語）、`2`（フランス語）、 `3`（スペイン語）、`4`（日本語）。

source: Returns the Unicode codepoint for the first character in a string expression.
de: Gibt den Unicode-Codepoint für das erste Zeichen in einem String-Ausdruck zurück.
es: Devuelve el codigo unicode para el primer carácter en una expresión de cadena.
fr: Renvoie le point de code Unicode pour le premier caractère d'une expression de chaîne.
ja: 文字列式の最初の文字のUnicodeコードポイントを返します。

source: Unicode codepoint of the first character.
de: Unicode-Codepunkt des ersten Zeichens.
es: Punto de código Unicode del primer carácter.
fr: Point de code Unicode du premier caractère.
ja: 最初の文字のUnicodeコードポイント。

source: * Unlike its counterparts in single-byte BASIC implementations, this function may return values larger than 255.
de: * Im Gegensatz zu seinen Pendants in Single-Byte Basic-Implementierungen kann diese Funktion Werte von mehr als 255 zurückgeben.
es: * A diferencia de sus contrapartes en implementaciones BASIC de un solo byte, esta función puede devolver valores superiores a 255.
fr: * Contrairement à ses homologues dans les implémentations BASIC mono-octet, cette fonction peut renvoyer des valeurs supérieures à 255.
ja: *シングルバイトBASIC実装の対応するものとは異なり、この関数は255より大きい値を返す場合があります。

source: * To get access to individual bytes without UTF-8 decoding, use the `a$[num]` syntax.
de: * Um Zugriff auf einzelne Bytes ohne UTF-8-Dekodierung zu erhalten, verwenden Sie die Syntax `a$[num]`.
es: * Para obtener acceso a bytes individuales sin decodificación UTF-8, use la sintaxis `a$[num]`.
fr: * Pour accéder à des octets individuels sans décodage UTF-8, utilisez la syntaxe `a$[num]`.
ja: * UTF-8デコードなしで個々のバイトにアクセスするには、 `a$[num]`構文を使用します。

source: Returns the number of bytes in a byte string.
de: Gibt die Anzahl der Bytes in einem Byte-String zurück.
es: Devuelve el número de bytes en una cadena de bytes.
fr: Renvoie le nombre d'octets dans une chaîne d'octets.
ja: バイト文字列のバイト数を返します。

source: Length in bytes.
de: Länge in Bytes.
es: Longitud en bytes.
fr: Longueur en octets.
ja: バイト単位の長さ。

source: Ends a multi-line `IF` instruction.
de: Beendet eine mehrzeilige `IF`-Anweisung.
es: Termina una instrucción `IF` de varias líneas.
fr: Termine une instruction `IF` multiligne.
ja: 複数行の`IF`命令を終了します。

source: The alternative syntax `CWD$()` is supported for backwards compatibility with earlier versions of Engine BASIC.
de: Die alternative Syntax `CWD$()` wird aus Gründen der Abwärtskompatibilität mit früheren Versionen von Engine BASIC unterstützt.
es: La sintaxis alternativa `CWD$()` es compatible con versiones anteriores del Engine BASIC.
fr: La syntaxe alternative `CWD$()` est prise en charge pour une compatibilité descendante avec les versions antérieures de Engine BASIC.
ja: 代替構文`CWD$()`は、以前のバージョンのEngineBASICとの下位互換性のためにサポートされています。

source: kbd:[Up_Arrow]
de: kbd:[Pfeil nach oben]

source: The alternative syntax `INKEY()` is supported for backwards compatibility with earlier versions of Engine BASIC.
de: Die alternative Syntax `INKEY()` wird aus Gründen der Abwärtskompatibilität mit früheren Versionen von Engine BASIC unterstützt.
es: La sintaxis alternativa `INKEY()` es compatible con versiones anteriores del Engine BASIC.
fr: La syntaxe alternative `INKEY()` est prise en charge pour une compatibilité descendante avec les versions antérieures de Engine BASIC.
ja: 代替構文`INKEY()`は、以前のバージョンのEngineBASICとの下位互換性のためにサポートされています。

source: Absolute horizontal coordinate of the mouse cursor.
de: Absolute horizontale Koordinate des Mauszeigers.
es: Coordenada horizontal absoluta del cursor del ratón.
fr: Coordonnée horizontale absolue du curseur de la souris.
ja: マウスカーソルの絶対水平座標。

source: X coordinate of mouse cursor, from `0` to `PSIZE(0)-1`
de: X-Koordinate des Mauszeigers, von `0` bis `PSIZE(0)-1`
es: X coordenada del cursor del ratón, de `0` a `PSIZE(0)-1`
fr: Coordonnée X du curseur de la souris, de `0` à `PSIZE(0)-1`
ja: マウスカーソルのX座標（`0`から`PSIZE(0)-1`まで）

source: Absolute vertical coordinate of the mouse cursor.
de: Absolute vertikale Koordinate des Mauszeigers.
es: Coordenada vertical absoluta del cursor del ratón.
fr: Coordonnée verticale absolue du curseur de la souris.
ja: マウスカーソルの絶対垂直座標。

source: Y coordinate of mouse cursor, from `0` to `PSIZE(1)-1`
de: Y-Koordinate des Mauszeigers, von `0` bis `PSIZE(1)-1`
es: Y coordenada del cursor del ratón, de `0 a `PSIZE(1)-1`
fr: Coordonnée Y du curseur de la souris, de `0` à `PSIZE(1)-1`
ja: マウスカーソルのY座標（`0`から`PSIZE(1)-1`まで）

source: Horizontal movement of the mouse.
de: Horizontale Bewegung der Maus.
es: Movimiento horizontal del ratón.
fr: Mouvement horizontal de la souris.
ja: マウスの水平方向の動き。

source: Returns a value representing the amount of horizontal movement of the mouse since the last call to `MOUSEDX`.
de: Gibt einen Wert zurück, der die horizontale Bewegung der Maus seit dem letzten Aufruf von `MOUSEDX` darstellt.
es: Devuelve un valor que representa la cantidad de movimiento horizontal del ratón desde la última llamada a `MOUSEDX`.
fr: Renvoie une valeur représentant la quantité de mouvement horizontal de la souris depuis le dernier appel à `MOUSEDX`.
ja: `MOUSEDX`を最後に呼び出してからのマウスの水平方向の動きの量を表す値を返します。

source: relative horizontal movement of mouse, pixels
de: relative horizontale Bewegung der Maus, Pixel
es: Movimiento horizontal relativo del ratón, en píxeles
fr: mouvement horizontal relatif de la souris, pixels
ja: マウスの相対的な水平方向の動き、ピクセル

source: Vertical movement of the mouse.
de: Vertikale Bewegung der Maus.
es: Movimiento vertical del ratón.
fr: Mouvement vertical de la souris.
ja: マウスの垂直方向の動き。

source: Returns a value representing the amount of vertical movement of the mouse since the last call to `MOUSEDY`.
de: Gibt einen Wert zurück, der die vertikale Bewegung der Maus seit dem letzten Aufruf von `MOUSEDY` darstellt.
es: Devuelve un valor que representa la cantidad de movimiento vertical del ratón desde la última llamada a `MOUSEDY`.
fr: Renvoie une valeur représentant la quantité de mouvement vertical de la souris depuis le dernier appel à `MOUSEDY`.
ja: `MOUSEDY`を最後に呼び出してからのマウスの垂直方向の動きの量を表す値を返します。

source: relative vertical movement of mouse, pixels
de: relative vertikale Bewegung der Maus, Pixel
es: Movimiento vertical relativo del ratón, píxeles
fr: mouvement vertical relatif de la souris, pixels
ja: マウスの相対的な垂直方向の動き、ピクセル

source: State of the specified mouse button.
de: Zustand der angegebenen Maustaste.
es: Estado del botón del ratón especificado.
fr: État du bouton de souris spécifié.
ja: 指定されたマウスボタンの状態。

source: `1` if the mouse button is held, `0` if it is not.
de: `1` wenn die Maustaste gedrückt gehalten wird, `0` wenn nicht.
es: `1` si se mantiene el botón del ratón, `0` si no lo es.
fr: `1` si le bouton de la souris est maintenu enfoncé, `0` si ce n'est pas le cas.
ja: マウスボタンが押されている場合は`1`、押されていない場合は`0`。

source: Number
de: Nummer
es: Número
fr: Nombre

source: Mouse button
de: Maustaste
es: Botón de ratón
fr: Bouton de souris
ja: マウスボタン

source: Other buttons than the ones specified above may be available if the mouse connected has more than three buttons.
de: Andere Tasten als die oben angegebenen sind möglicherweise verfügbar, wenn die angeschlossene Maus mehr als drei Tasten hat.
es: Otros botones que los especificados anteriormente pueden estar disponibles si el ratón conectado tiene más de tres botones.
fr: D'autres boutons que ceux spécifiés ci-dessus peuvent être disponibles si la souris connectée a plus de trois boutons.
ja: 接続されているマウスに3つ以上のボタンがある場合は、上記以外のボタンを使用できる場合があります。

source: Movement of the mouse wheel.
de: Bewegung des Mausrades.
es: Movimiento de la rueda del ratón.
fr: Mouvement de la molette de la souris.
ja: マウスホイールの動き。

source: Returns a value representing the movement of the mouse wheel since the last call to `MOUSEWHEEL`.
de: Gibt einen Wert zurück, der die Bewegung des Mausrads seit dem letzten Aufruf von `MOUSEWHEEL` darstellt.
es: Devuelve un valor que representa el movimiento de la rueda del ratón desde la última llamada a `MOUSEWHEEL`.
fr: Renvoie une valeur représentant le mouvement de la molette de la souris depuis le dernier appel à `MOUSEWHEEL`.
ja: `MOUSEWHEEL`を最後に呼び出してからのマウスホイールの動きを表す値を返します。

source: movement of mouse wheel, clicks
de: Bewegung des Mausrades, Klicks
es: movimiento de la rueda del ratón, clics
fr: mouvement de la molette de la souris, clics
ja: マウスホイールの動き、クリック

source: This function is not implemented on SDL platforms.
de: Diese Funktion ist auf SDL-Plattformen nicht implementiert.
es: Esta función no se implementa en las plataformas SDL.
fr: Cette fonction n'est pas implémentée sur les plates-formes SDL.
ja: この機能はSDLプラットフォームには実装されていません。

source: The alternative syntax `SREAD()` is supported for backwards compatibility with earlier versions of Engine BASIC.
de: Die alternative Syntax `SREAD()` wird aus Gründen der Abwärtskompatibilität mit früheren Versionen von Engine BASIC unterstützt.
es: La sintaxis alternativa `SREAD()` es compatible con versiones anteriores del Engine BASIC.
fr: La syntaxe alternative `SREAD()` est prise en charge pour une compatibilité descendante avec les versions antérieures de Engine BASIC.
ja: 以前のバージョンのEngineBASICとの下位互換性のために、代替構文`SREAD()`がサポートされています。

source: The alternative syntax `SREADY()` is supported for backwards compatibility with earlier versions of Engine BASIC.
de: Die alternative Syntax `SREADY()` wird aus Gründen der Abwärtskompatibilität mit früheren Versionen von Engine BASIC unterstützt.
es: La sintaxis alternativa `SREADY()` es compatible con versiones anteriores del Engine BASIC.
fr: La syntaxe alternative `SREADY()` est prise en charge pour une compatibilité descendante avec les versions antérieures de Engine BASIC.
ja: 代替構文`SREADY()`は、以前のバージョンのEngineBASICとの下位互換性のためにサポートされています。

source: Returns a pointer to a native symbol.
de: Gibt einen Zeiger auf ein natives Symbol zurück.
es: Devuelve un puntero a un símbolo nativo.
fr: Renvoie un pointeur vers un symbole natif.
ja: ネイティブシンボルへのポインタを返します。

source: name of a native symbol
de: Name eines nativen Symbols
es: nombre de un símbolo nativo
fr: nom d'un symbole natif
ja: ネイティブシンボルの名前

source: Pointer to requested symbol, or 0 if not found.
de: Zeiger auf angefordertes Symbol oder 0, falls nicht gefunden.
es: Puntero al símbolo solicitado, o 0 si no se encuentra.
fr: Pointeur vers le symbole demandé, ou 0 s'il n'est pas trouvé.
ja: 要求されたシンボルへのポインタ、または見つからない場合は0。

source: note velocity [`0` to `1` (default)]
de: Noten-Velocity [`0` bis `1` (Standard)]
es: velocidad de nota [`0` a `1` (predeterminado)]
fr: vélocité de la note [`0` à `1` (par défaut)]

source: Returns a specified number of leftmost bytes in a byte string.
de: Gibt eine angegebene Anzahl von Bytes ganz links in einer Byte-Zeichenfolge zurück.
es: Devuelve un número específico de bytes izquierdos en una cadena de byte.
fr: Renvoie un nombre spécifié d'octets les plus à gauche dans une chaîne d'octets.
ja: バイト文字列の左端の指定された数のバイトを返します。

source: number of bytes to return [min `0`]
de: Anzahl der zurückzugebenden Bytes [min `0`]
es: número de bytes a devolver [min `0`]
fr: nombre d'octets à renvoyer [min `0`]
ja: 返すバイト数[min`0`]

source: Substring of `num` bytes or less.
de: Teilstring von `num` bytes oder weniger.
es: Subcadena de `num` bytes o menos.
fr: Sous-chaîne de `num` octets ou moins.
ja: `num`バイト以下のサブストリング。

source: If `l$` is shorter than `num` bytes, the return value is `l$`.
de: Ist `l$` kürzer als `num` Bytes, dann ist der Rückgabewert `l$`.
es: Si `l$` es más corto que `num` bytes, el valor de retorno es `l$`.
fr: Si `l$` est plus court que `num` octets, la valeur de retour est `l$`.
ja: `l$`が `num`バイトより短い場合、戻り値は`l$`です。

source: Returns a specified number of rightmost bytes in a byte string.
de: Gibt eine angegebene Anzahl von Bytes ganz rechts in einer Byte-Zeichenfolge zurück.
es: Devuelve un número específico de bytes derecho en una cadena de byte.
fr: Renvoie un nombre spécifié d'octets les plus à droite dans une chaîne d'octets.
ja: バイト文字列の右端の指定された数のバイトを返します。

source: If `r$` is shorter than `num` bytes, the return value is `r$`.
de: Ist `r$` kürzer als `num` Bytes, dann ist der Rückgabewert `r$`.
es: Si `r$` es más corto que `num` bytes, el valor de retorno es `r$`.
fr: Si `r$` est plus court que `num` octets, la valeur de retour est `r$`.
ja: `r$`が `num`バイトより短い場合、戻り値は`r$`です。

source: Returns part of a byte string.
de: Gibt einen Teil eines Byte-Strings zurück.
es: Devuelve parte de una cadena de bytes.
fr: Renvoie une partie d'une chaîne d'octets.
ja: バイト文字列の一部を返します。

source: position of the first byte in the substring being returned
de: Position des ersten Bytes im zurückgegebenen Teilstring
es: Posición del primer byte en la subcadena que se devuelve.
fr: position du premier octet dans la sous-chaîne renvoyée
ja: 返される部分文字列の最初のバイトの位置

source: number of bytes in the substring [default: `BLEN(m$)-start`]
de: Anzahl der Bytes im Substring [Standard: `BLEN(m$)-start`]
es: Número de bytes en la subcadena [Predeterminado: `BLEN(m$)-start`]
fr: nombre d'octets dans la sous-chaîne [par défaut : `BLEN(m$)-start`]
ja: サブストリングのバイト数[デフォルト： `BLEN（m$)-start`]

source: Substring of `len` bytes or less.
de: Teilstring von `len` Bytes oder weniger.
es: Subcadena de `len` bytes o menos.
fr: Sous-chaîne d'octets `len` ou moins.
ja: `len`バイト以下の部分文字列。

source: * If `m$` is shorter than `len` bytes, the return value is `m$`.
de: * Wenn `m$` kürzer als `len` Bytes ist, ist der Rückgabewert `m$`.
es: * Si `m$` es más corto que `len` bytes, el valor de retorno es `m$`.
fr: * Si `m$` est plus court que `len` octets, la valeur de retour est `m$`.
ja: * `m$`が `len`バイトより短い場合、戻り値は`m$`です。
