Repository: CityAceE/basicengine-firmware
Catalog: po/system_*.po
Languages: de, es, fr, ja

source: Division by zero
de: Division durch Null
es: División por cero
fr: Division par zéro
ja: ゼロ除算

source: Floating point exception
de: Gleitkomma-Ausnahme
es: Excepción de punto flotante
fr: Exception à virgule flottante
ja: 浮動小数点例外

source: Overflow
de: Überlauf
es: Desbordamiento
fr: Débordement
ja: オーバーフロー

source: Subscript out of range
de: Index außerhalb des Bereichs
es: Subíndice fuera de rango
fr: Indice hors limites
ja: 添え字が範囲外

source: Icode buffer full
de: Icode-Puffer voll
es: Búfer Icode lleno
fr: Tampon Icode plein
ja: Icodeバッファがいっぱいです

source: too many nested GOSUB
de: zu viele verschachtelte GOSUB
es: demasiados GOSUB anidados
fr: trop de GOSUB imbriqués
ja: ネストされたGOSUBが多すぎます

source: Argument stack overflow
de: Argumentstapelüberlauf
es: Desbordamiento de la pila de argumentos
fr: Débordement de pile d'arguments
ja: 引数スタックオーバーフロー

source: Undefined argument
de: Unbekanntes Argument
es: Argumento indefinido
fr: Argument non défini
ja: 未定義の引数

source: LET without variable
de: LET ohne Variable
es: LET sin variable
fr: LET sans variable
ja: 変数なしのLET

source: Undefined line number
de: Unbekannte Zeilennummer
es: Número de línea indefinido
fr: Numéro de ligne indéfini
ja: 未定義の行番号

source: '(' or ')' expected
de: '(' oder ')' erwartet
es: '(' o ')' esperado
fr: '(' ou ')' attendu
ja: '('または')'が必要

source: '=' expected
de: '=' erwartet
es: '=' esperado
fr: '=' attendu
ja: '='が期待されます

source: Cannot use system command
de: Systembefehl kann nicht verwendet werden
es: No se puede usar el comando del sistema
fr: Impossible d'utiliser la commande système
ja: システムコマンドを使用できません

source: Illegal value
de: Unzulässiger Wert
es: Valor ilegal
fr: Valeur illégale
ja: 不正な値

source: Out of range value
de: Wert außerhalb des Bereichs
es: Valor fuera de rango
fr: Valeur hors plage
ja: 範囲外の値

source: Program not found
de: Programm nicht gefunden
es: Programa no encontrado
fr: Programme non trouvé
ja: プログラムが見つかりません

source: Syntax error
de: Syntaxfehler
es: Error de sintaxis
fr: Erreur de syntaxe
ja: 構文エラー

source: Internal error
de: Interner Fehler
es: Error interno
fr: Erreur interne
ja: 内部エラー

source: Line too long
de: Zeile zu lang
es: Línea demasiado larga
fr: Ligne trop longue
ja: 行が長すぎます

source: File write error
de: Fehler beim Schreiben der Datei
es: Error de escritura de archivo
fr: Erreur d'écriture de fichier
ja: ファイル書き込みエラー

source: File read error
de: Fehler beim Lesen der Datei
es: Error de lectura de archivo
fr: Erreur de lecture de fichier
ja: ファイル読み取りエラー

source: Cannot use GPIO function
de: GPIO-Funktion kann nicht verwendet werden
es: No se puede utilizar la función GPIO
fr: Impossible d'utiliser la fonction GPIO
ja: GPIO機能は使用できません

source: Path too long
de: Pfad zu lang
es: Camino demasiado largo
fr: Chemin trop long
ja: パスが長すぎます

source: File open error
de: Fehler beim Öffnen der Datei
es: Error de apertura de archivo
fr: Erreur d'ouverture de fichier
ja: ファイルオープンエラー

source: File not open
de: Datei nicht geöffnet
es: Archivo no abierto
fr: Fichier non ouvert
ja: ファイルが開かれていません

source: SD I/O error
de: SD I/O-Fehler
es: Error de E/S SD
fr: Erreur d'E/S SD
ja: SD I/Oエラー

source: Bad file name
de: Ungültiger Dateiname
es: Nombre de archivo incorrecto
fr: Nom de fichier incorrect
ja: 不正なファイル名

source: Not supported
de: Nicht unterstützt
es: No soportado
fr: Non supporté
ja: サポートされていません

source: Out of video memory
de: Videospeicher voll
es: Sin memoria de vídeo
fr: Mémoire vidéo insuffisante
ja: ビデオメモリが不足しています

source: Out of memory
de: Nicht genügend Speicher
es: Sin memoria
fr: Mémoire insuffisante
ja: メモリ不足

source: Can't continue
de: Kann nicht weitermachen
es: No puedo continuar
fr: Ne peut pas continuer
ja: 続行できません

source: Undefined array
de: Unbekanntes Array
es: Matriz indefinida
fr: Tableau indéfini
ja: 未定義の配列

source: Undefined procedure
de: Unbekannte Prozedur
es: Procedimiento indefinido
fr: Procédure indéfinie
ja: 未定義の手順

source: Undefined label
de: Unbekanntes Label
es: Etiqueta indefinida
fr: Étiquette non définie
ja: 未定義のラベル

source: Duplicate procedure
de: Doppelte Prozedur
es: Procedimiento duplicado
fr: Procédure en double
ja: 重複手順

source: Duplicate label
de: Doppeltes Label
es: Etiqueta duplicada
fr: Étiquette en double
ja: 重複ラベル

source: Out of data
de: Keine Daten mehr
es: Sin datos
fr: Hors de données
ja: データ不足

source: I/O error
de: I/O-Fehler
es: Error de E/S
fr: Erreur d'E/S
ja: I/O エラー

source: Local variable outside procedure
de: Lokale Variable außerhalb der Prozedur
es: Variable local fuera del procedimiento
fr: Variable locale en dehors de la procédure
ja: プロシージャ外のローカル変数

source: Empty list
de: Leere Liste
es: Lista vacía
fr: Liste vide
ja: 空のリスト

source: ENDIF not found
de: ENDIF nicht gefunden
es: ENDIF no encontrado
fr: ENDIF introuvable
ja: ENDIFが見つかりません

source: Not enough arguments
de: Nicht genug Argumente
es: No hay suficientes argumentos
fr: Pas assez d'arguments

source: File format error
de: Dateiformatfehler
es: Error de formato de archivo
fr: Erreur de format de fichier
ja: ファイル形式エラー

source: Network error
de: Netzwerkfehler
es: Error de red
fr: Erreur réseau
ja: ネットワークエラー

source: Not a directory
de: Kein Verzeichnis
es: No un directorio
fr: Pas un répertoire
ja: ディレクトリではありません

source: System stack overflow
de: Systemstapelüberlauf
es: Desbordamiento de pila del sistema
fr: Dépassement de la pile système
ja: システムスタックオーバーフロー

source: File seek error
de: Dateisuchfehler
es: Error de búsqueda de archivo
fr: Erreur de recherche de fichier
ja: ファイルシークエラー

source: Failed to initialize synthesizer
de: Synthesizer konnte nicht initialisiert werden
es: No se pudo inicializar el sintetizador
fr: Échec de l'initialisation du synthétiseur
ja: シンセサイザーの初期化に失敗しました

source: Unknown command
de: Unbekannter Befehl
es: Comando desconocido
fr: Commande inconnue
ja: 不明なコマンド

source: PROC without CALL/FN
de: PROC ohne CALL/FN
es: PROC sin CALL/FN
fr: PROC sans CALL/FN
ja: CALL/FNなしのPROC

source: CHAIN failed
de: CHAIN ist gescheitert
es: CHAIN falló
fr: CHAIN échoué

source: Undefined symbol
de: Unbekanntes Symbol
es: Símbolo indefinido
fr: Symbole indéfini
ja: 未定義のシンボル

source: Compiler error
de: Compilerfehler
es: Error del compilador
fr: Erreur du compilateur
ja: コンパイラエラー

source: MB free
es: MB libres

source: bytes free
es: bytes libres

source: files,
es: archivos,

source: in
es: en

source: Arguments
de: Argumente
es: Argumentos

source: Available commands:
de: Verfügbare Befehle:
es: Comandos disponibles:
fr: Commandes disponibles:
ja: 使用可能なコマンド：

source: Bugs
es: Errores
ja: バグ

source: Description
de: Beschreibung
es: Descripción
ja: 説明

source: Directory
es: Directorio

source: Matching commands:
de: Passende Befehle:
es: Comandos coincidentes:
fr: Commandes correspondantes:
ja: マッチングコマンド：

source: No help available
es: No hay ayuda disponible

source: Note
de: Hinweis
es: Nota
ja: 注意

source: Return value
de: Rückgabewert
es: Valor devuelto
fr: Valeur de retour
ja: 戻り値

source: See also
de: Siehe auch
es: Ver también
fr: Voir aussi
ja: 参照

source: Skipping autoexec.bas
es: Omitiendo autoexec.bas

source: Types
de: Typen
es: Tipos
ja: タイプ

source: Usage
de: Verwendung
es: Uso
fr: Utilisation
ja: 使用法

source: command
de: Befehl
es: mando
fr: commande
ja: コマンド

source: constant
de: Konstante
es: constante
ja: 絶え間ない

source: expected: "
de: erwartet: "
es: esperado: "
fr: attendu: "
ja: 予想："

source: expected: BG or SPRITE
de: erwartet: BG oder SPRITE
es: esperado: BG o SPRITE
fr: attendu: BG ou SPRITE
ja: 予想：BGまたはSPRITE

source: expected: BG parameter
de: erwartet: BG-Parameter
es: esperado: parámetro BG
fr: attendu: paramètre BG
ja: 予想：BGパラメーター

source: expected: GOTO or GOSUB
de: erwartet: GOTO oder GOSUB
es: esperado: GOTO o GOSUB
fr: attendu: GOTO ou GOSUB
ja: 予想：GOTOまたはGOSUB

source: expected: ON, OFF or LIST
de: erwartet: ON, OFF oder LIST
es: esperado: ON, OFF o LIST
fr: attendu: ON, OFF ou LIST
ja: 予想：ON、OFF、またはLIST

source: expected: command
de: erwartet: Befehl
es: esperado: comando
fr: attendu: commande
ja: 期待：コマンド

source: expected: end of statement
de: erwartet: Ende der Anweisung
es: esperado: fin de la declaración
fr: attendu: fin de déclaration
ja: 想定: ステートメントの終了

source: expected: file mode
de: erwartet: Dateimodus
es: esperado: modo de archivo
fr: attendu: mode fichier
ja: 予想：ファイルモード

source: expected: file name
de: erwartet: Dateiname
es: esperado: nombre de archivo
fr: attendu: nom de fichier
ja: 予想：ファイル名

source: expected: list reference
de: erwartet: Listenreferenz
es: esperado: referencia de lista
fr: attendu: référence de la liste
ja: 予想：リスト参照

source: expected: network command
de: erwartet: Netzwerkbefehl
es: esperado: comando de red
fr: attendu: commande réseau
ja: 予想：ネットワークコマンド

source: expected: network function
de: erwartet: Netzwerkfunktion
es: esperado: función de red
fr: attendu: fonction réseau
ja: 予想：ネットワーク機能

source: expected: numeric expression
de: erwartet: numerischer Ausdruck
es: esperado: expresión numérica
fr: attendu: expression numérique
ja: 予想：数字式

source: expected: numeric list reference
de: erwartet: numerische Listenreferenz
es: esperado: referencia de lista numérica
fr: attendu: référence de liste numérique
ja: 予想：数値リスト参照

source: expected: separator
de: erwartet: Trennzeichen
es: esperado: separador
fr: attendu: séparateur
ja: 予想：セパレータ

source: expected: sprite parameter
de: erwartet: Sprite-Parameter
es: esperado: parámetro de sprite
fr: attendu: paramètre de sprite
ja: 予想：スプライトパラメータ

source: expected: string expression
de: erwartet: String-Ausdruck
es: esperado: expresión de cadena
fr: attendu: expression de chaîne
ja: 期待：文字列式

source: expected: string list reference
de: erwartet: Stringlistenreferenz
es: esperado: referencia de lista de cadenas
fr: attendu: référence de la liste de chaînes
ja: 予期される: 文字列リスト参照

source: expected: variable
de: erwartet: Variable
es: esperado: variable
fr: attendu: variable
ja: 予想：変数

source: file system
de: Dateisystem
es: sistema de archivos
fr: système de fichiers
ja: ファイルシステム

source: from %d to %d
de: von %d bis %d
es: de %d a %d
fr: de %d à %d
ja: %dから%dへ

source: function
de: Funktion
es: función
fr: fonction

source: input/output
de: Eingabe/Ausgabe
es: entrada/salida
fr: entrée/sortie
ja: 入出力

source: invalid URL
de: ungültige URL
es: URL invalida
fr: URL invalide
ja: 無効なURL

source: invalid list index
de: ungültiger Listenindex
es: índice de lista no válido
fr: index de liste non valide
ja: 無効なリストインデックス

source: invalid number
de: ungültige Zahl
es: número invalido
fr: nombre invalide
ja: 無効な番号

source: invalid program line
de: ungültige Programmzeile
es: línea de programa no válida
fr: ligne de programme invalide
ja: 無効なプログラム行

source: math
de: Mathe
es: matemáticas
ja: 数学

source: missing dimensions
de: fehlende Dimensionen
es: dimensiones faltantes
fr: dimensions manquantes
ja: 欠けている寸法

source: need min 1 character
de: brauche mindestens 1 Zeichen
es: necesita un mínimo de 1 carácter
fr: besoin de 1 caractère minimum
ja: 最小1文字が必要

source: negative length
de: negative Länge
es: longitud negativa
fr: longueur négative
ja: 負の長さ

source: negative string offset
de: negativer String-Offset
es: desplazamiento de cadena negativo
fr: décalage de chaîne négatif
ja: 負の文字列オフセット

source: negative substring length
de: negative Teilstringlänge
es: longitud de subcadena negativa
fr: longueur de sous-chaîne négative
ja: 負の部分文字列の長さ

source: none
de: keines
es: ninguno
fr: aucun
ja: 無し

source: not a BASIC program
de: kein BASIC-Programm
es: no un programa BASIC
fr: pas un programme BASIC
ja: BASICプログラムではありません

source: not an array variable
de: keine Array-Variable
es: no una variable de matriz
fr: pas une variable de tableau
ja: 配列変数ではありません

source: not connected
de: nicht verbunden
es: no conectado
fr: pas connecté
ja: 接続されていません

source: numeric
de: numerisch
es: numérico
fr: numérique
ja: 数値

source: operator
es: operador
fr: opérateur
ja: オペレーター

source: pixel graphics
de: Pixelgrafik
es: gráficos de píxeles
fr: graphiques en pixels
ja: ピクセルグラフィックス

source: screen handling
de: Bildschirmhandling
es: manejo de pantalla
fr: manipulation de l'écran
ja: 画面処理

source: sound
de: Ton
es: sonido
fr: son
ja: 音

source: system
es: sistema
fr: système
ja: システム

source: unknown
de: unbekannt
es: desconocido
fr: inconnu
ja: わからない

source: unknown memory size
es: tamaño de memoria desconocido

source: unknown/SDL
de: unbekannt/SDL
es: desconocido/SDL
fr: inconnu/SDL
ja: 不明/SDL

source: too many nested FOR
de: zu viele verschachtelte FOR
es: demasiados FOR anidados
fr: trop de FOR imbriqués
ja: ネストされたFORが多すぎます

source: NEXT without FOR
de: NEXT ohne FOR
es: NEXT sin FOR
fr: NEXT sans FOR
ja: FORなしのNEXT

source: FOR without variable
de: FOR ohne Variable
es: FOR sin variable
fr: FOR sans variable
ja: 変数なしのFOR

source: FOR without TO
de: FOR ohne TO
es: FOR sin TO
fr: FOR sans TO
ja: TOなしのFOR

source: IF without condition
de: IF ohne Bedingung
es: IF sin condición
fr: IF sans condition
ja: 条件のないIF

source: USING format error
de: USING-Formatfehler
es: error de formato USING
fr: Erreur de format USING
ja: USINGフォーマットエラー

source: WHILE without WEND
de: WHILE ohne WEND
es: WHILE sin WEND
fr: WHILE sans WEND
ja: WENDのないWHILE

source: BASIC core
de: BASIC-Kern
es: Núcleo BASIC
fr: Noyau de BASIC
ja: BASICコア

source: expected: DATE or FLAGS
de: erwartet: DATE oder FLAGS
es: esperado: DATE o FLAGS
fr: attendu: DATE ou FLAGS
ja: 予想：DATEまたはFLAGS

source: expected: DATE or TIME
de: erwartet: DATE oder TIME
es: esperado: DATE o TIME
fr: attendu: DATE ou TIME
ja: 予想：DATEまたはTIME

source: expected: INPUT, OUTPUT or OFF
de: erwartet: INPUT, OUTPUT oder OFF
es: esperado: INPUT, OUTPUT o OFF
fr: attendu: INPUT, OUTPUT ou OFF
ja: 予想：INPUT、OUTPUT、またはOFF

source: expected: THEN or GOTO
de: erwartet: THEN oder GOTO
es: esperado: THEN o GOTO
fr: attendu: THEN ou GOTO
ja: 期待：THENまたはGOTO

source: malformed DATA
de: fehlerhaftes DATA
es: DATA mal formado
fr: DATA malformé

source: multiple periods
de: mehrere Dezimalpunkte
es: varios puntos decimales
fr: plusieurs points décimaux

source: Font error
de: Schriftartfehler
es: Error de fuente
fr: Erreur de police
ja: フォントエラー

source: Expressions
de: Ausdrücke
es: Expresiones
ja: 表現

source: Fonts
de: Schriftarten
es: Fuentes
fr: Polices
ja: フォント

source: Type mismatch
de: Typ-Mismatch
es: Falta de coincidencia de tipos
fr: Incompatibilité de type
ja: 型の不一致

source: Modes
de: Modi
es: Modos
ja: モード

source: Options
de: Optionen
es: Opciones
ja: オプション

source: See also:
de: Siehe auch:
es: Ver también:
fr: Voir aussi:
ja: 参照:

source: could not decode help file
de: Hilfedatei konnte nicht dekodiert werden
es: no se pudo decodificar el archivo de ayuda
fr: impossible de décoder le fichier d'aide
ja: ヘルプファイルをデコードできませんでした

source: could not open help file
de: Hilfedatei konnte nicht geöffnet werden
es: no se pudo abrir el archivo de ayuda
fr: impossible d'ouvrir le fichier d'aide
ja: ヘルプファイルを開くことができませんでした

source: could not read help file
de: Hilfedatei konnte nicht gelesen werden
es: no se pudo leer el archivo de ayuda
fr: impossible de lire le fichier d'aide
ja: ヘルプファイルを読み取れませんでした

source: missing
de: fehlen
es: desaparecido
fr: manquant
ja: ない

source: unknown section
de: unbekannter Abschnitt
es: sección desconocida
fr: section inconnue
ja: 不明なセクション

source: unknown type
de: unbekannter Typ
es: tipo desconocido
fr: type inconnu
ja: 不明なタイプ

source: %d files extracted
es: %d archivos extraídos

source: Data Abort
de: Datenabbruch
es: Aborto de datos

source: EXIT failed
de: EXIT ist fehlgeschlagen
es: EXIT fallida

source: Example
de: Beispiel
es: Ejemplo
fr: Exemple
ja: 例

source: Handler
es: Manipulador
fr: Gestionnaire
ja: ハンドラ

source: OS error
de: Betriebssystemfehler
es: error del sistema operativo
fr: Erreur du système d'exploitation
ja: OSエラー

source: Precedence
de: Vorrang
es: Precedencia
fr: Priorité
ja: 優先順位

source: Press B to reload the last parsable version.
es: Presione B para recargar la última versión analizable.

source: Press any key to continue.
de: Drücken Sie eine beliebige Taste, um fortzufahren.
es: Pulse cualquier tecla para continuar.
fr: Appuyez sur n'importe quelle touche pour continuer.
ja: 何かキーを押すと続行します。

source: Press any other key to continue.
es: Presione cualquier otra tecla para continuar.

source: RETURN stack underflow
de: RETURN-Stapelunterlauf
es: Desbordamiento insuficiente de la pila de RETURN
fr: sous-dépassement de la pile RETURN
ja: RETURNスタックアンダーフロー

source: Result
de: Ergebnis
es: Resultado
fr: Résultat
ja: 結果

source: System error:
es: Error del sistema:

source: TFTP error
es: Error de TFTP

source: ZIP file read error
de: Fehler beim Lesen der ZIP-Datei
es: Error de lectura del archivo ZIP
fr: Erreur de lecture du fichier ZIP
ja: ZIPファイルの読み込みエラー

source: broken ZIP file
de: defekte ZIP-Datei
es: archivo ZIP roto
fr: fichier ZIP cassé
ja: 壊れたZIPファイル

source: can't edit program while running it
de: Während der Ausführung kann das Programm nicht bearbeitet werden
es: No puedo editar el programa mientras lo ejecuto.
fr: je ne peux pas modifier le programme pendant son exécution
ja: 実行中にプログラムを編集することはできません

source: cannot create module directory
de: Modulverzeichnis kann nicht erstellt werden
es: no se puede crear el directorio del módulo
fr: impossible de créer le répertoire du module
ja: モジュールディレクトリを作成できません

source: cannot find end of loop
de: Das Ende der Schleife kann nicht gefunden werden
es: no puedo encontrar el final del bucle
fr: je ne trouve pas la fin de la boucle
ja: ループの終わりが見つかりません

source: could not initialize TFTP client
de: Der TFTP-Client konnte nicht initialisiert werden
es: no se pudo inicializar el cliente TFTP
fr: impossible d'initialiser le client TFTP
ja: TFTPクライアントを初期化できませんでした

source: could not start DHCP client
de: Der DHCP-Client konnte nicht gestartet werden
es: no se pudo iniciar el cliente DHCP
fr: impossible de démarrer le client DHCP
ja: DHCP クライアントを開始できませんでした

source: editor exited abnormally
de: Der Editor wurde abnormal beendet
es: el editor salió de forma anormal
fr: l'éditeur s'est quitté anormalement
ja: エディタが異常終了しました

source: empty string
de: leerer String
es: cuerda vacía
fr: chaîne vide
ja: 空の文字列

source: expected: OFF or ON
de: erwartet: OFF oder ON
es: esperado: OFF o ON
fr: attendu : OFF ou ON

source: expected: ON or OFF
de: erwartet: ON oder OFF
es: esperado: ON o OFF
fr: attendu : ON ou OFF

source: failed to acquire GPIO chip
de: GPIO-Chip konnte nicht belegt werden
es: no se pudo adquirir el chip GPIO
fr: échec d'acquisition de la puce GPIO
ja: GPIOチップの取得に失敗しました

source: failed to acquire GPIO line
de: Belegung der GPIO-Leitung fehlgeschlagen
es: no se pudo adquirir la línea GPIO
fr: échec d'acquisition de la ligne GPIO
ja: GPIO ラインの取得に失敗しました

source: failed to configure GPIO line
de: GPIO-Leitung konnte nicht konfiguriert werden
es: no se pudo configurar la línea GPIO
fr: échec de configuration de la ligne GPIO
ja: GPIO ラインの構成に失敗しました

source: failed to create file
de: Erstellen der Datei fehlgeschlagen
es: fracasado en la creación de archivos
fr: la création du fichier a échoué
ja: ファイルの作成に失敗した

source: failed to get GPIO state
de: GPIO-Status konnte nicht abgerufen werden
es: no se pudo obtener el estado GPIO
fr: impossible d'obtenir l'état GPIO
ja: GPIO 状態の取得に失敗しました

source: failed to open file
de: Datei konnte nicht geöffnet werden
es: Fallo al abrir el archivo
fr: échec de l'ouverture du fichier
ja: ファイルを開けませんでした

source: failed to send file
de: Datei konnte nicht gesendet werden
es: no se pudo enviar el archivo
fr: échec de l'envoi du fichier
ja: ファイルの送信に失敗しました

source: failed to set GPIO state
de: Der GPIO-Status konnte nicht festgelegt werden
es: no se pudo establecer el estado GPIO
fr: échec de la définition de l'état GPIO
ja: GPIO 状態の設定に失敗しました

source: failed to set bit order
de: Bitreihenfolge konnte nicht festgelegt werden
es: no se pudo establecer el orden de bits
fr: échec de définition de l'ordre des bits
ja: ビット順序の設定に失敗しました

source: file could not be extracted
de: Datei konnte nicht extrahiert werden
es: el archivo no se pudo extraer
fr: le fichier n'a pas pu être extrait
ja: ファイルを抽出できませんでした

source: font already exists
de: Schriftart existiert bereits
es: la fuente ya existe
fr: la police existe déjà
ja: フォントはすでに存在します

source: ipaddr_aton failed
de: ipaddr_aton ist fehlgeschlagen
es: ipaddr_aton falló
fr: ipaddr_aton a échoué
ja: ipaddr_aton が失敗しました

source: module not found
de: Modul nicht gefunden
es: módulo no encontrado
fr: module introuvable
ja: モジュールが見つかりません

source: no SPI device selected
de: Kein SPI-Gerät ausgewählt
es: ningún dispositivo SPI seleccionado
fr: aucun périphérique SPI sélectionné
ja: SPIデバイスが選択されていません

source: no active loops
de: keine aktiven Schleifen
es: sin bucles activos
ja: アクティブなループがありません

source: no matching loop
de: keine passende Schleife
es: sin bucle coincidente
fr: pas de boucle correspondante
ja: 一致するループがありません

source: not a ZIP file
de: keine ZIP-Datei
es: no es un archivo ZIP
fr: pas un fichier ZIP
ja: ZIPファイルではありません

source: not a valid TrueType font file
de: Keine gültige TrueType-Schriftartdatei
es: no es un archivo de fuente TrueType válido
fr: ce n'est pas un fichier de police TrueType valide
ja: 有効な TrueType フォント ファイルではありません

source: sprite/background engine
de: Sprite/Hintergrund-Engine
es: motor de sprites/fondo
fr: moteur de sprite/arrière-plan
ja: スプライト/バックグラウンドエンジン

source: string
es: cadena
fr: chaîne
ja: ストリング

source: unknown configuration variable
de: unbekannte Konfigurationsvariable
es: variable de configuración desconocida
fr: variable de configuration inconnue
ja: 不明な構成変数

source: unknown font
de: unbekannte Schriftart
es: fuente desconocida
fr: police inconnue
ja: 不明なフォント

source: unknown loop type
de: unbekannter Schleifentyp
es: tipo de bucle desconocido
fr: type de boucle inconnu
ja: 不明なループタイプ

source: IF stack overflow
de: IF-Stapelüberlauf
fr: Débordement de pile IF
ja: IFスタックオーバーフロー

source: IF stack underflow
de: IF-Stapelunterlauf
fr: dépassement de pile IF
ja: IFスタックアンダーフロー

source: Break
de: Unterbrechung
ja: ブレーク

source: MB free
de: MB frei
fr: Mo libres
ja: MB無料

source: bytes free
de: Bytes frei
fr: octets libres
ja: バイト空き

source: files,
de: Dateien,
fr: des dossiers,
ja: ファイル、

source: Directory
de: Verzeichnis
fr: Répertoire
ja: ディレクトリ

source: No help available
de: Keine Hilfe verfügbar
fr: Aucune aide disponible
ja: 利用可能なヘルプはありません

source: Skipping autoexec.bas
de: Überspringe autoexec.bas
fr: Ignorer autoexec.bas
ja: autoexec.basをスキップする

source: unknown memory size
de: unbekannte Speichergröße
fr: taille de mémoire inconnue
ja: 不明なメモリサイズ

source: %d files extracted
de: %d Dateien extrahiert
fr: %d fichiers extraits
ja: %d ファイルが抽出されました

source: Press B to reload the last parsable version.
de: Drücken Sie B, um die letzte gültige Version neu zu laden.
fr: Appuyez sur B pour recharger la dernière version analysable.
ja: B を押して、解析可能な最後のバージョンをリロードします。

source: Press any other key to continue.
de: Drücken Sie eine beliebige andere Taste, um fortzufahren.
fr: Appuyez sur n’importe quelle autre touche pour continuer.
ja: 続行するには、他のキーを押してください。

source: System error:
de: Systemfehler:
fr: Erreur système:
ja: システムエラー：

source: TFTP error
de: TFTP-Fehler
fr: Erreur TFTP
ja: TFTPエラー

source: bytes.
fr: octets.
ja: バイト。

source: Bugs:
ja: バグ：

source: Description:
ja: 説明：

source: max %d
fr: %d max
ja: 最大%d

source: min %d
fr: %d min
ja: 最小%d

source: in
fr: dans
